<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_version</key>
	<real>1.0</real>
	<key>pfm_domain</key>
	<string>com.apple.systempreferences</string>
	<key>pfm_description</key>
	<string>Managed Client settings to set the enabled Preference Panes in System Preferences.</string>
	<key>pfm_name</key>
	<string>SystemPreferences</string>
	<key>pfm_title</key>
	<string>System Preferences</string>
	<key>pfm_node</key>
	<string>From MCX, needs to be checked</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_description</key>
			<string>Preference pane union policy keys.</string>
			<key>pfm_name</key>
			<string>EnabledPreferencePanes-UPK</string>
			<key>pfm_remove_duplicates</key>
			<true/>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
				<string>system-managed</string>
			</array>
			<key>pfm_title</key>
			<string>Preference Panes Union Policy</string>
			<key>pfm_type</key>
			<string>union policy</string>
			<key>pfm_upk_input_keys</key>
			<array>
				<string>EnabledPreferencePanes-Raw</string>
			</array>
			<key>pfm_upk_output_name</key>
			<string>EnabledPreferencePanes</string>
			<key>pfm_upk_output_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set allowed Preference Panes within the System Preferences application.  
To find the domain of additional Preference Panes, navigate to:

/Library/PreferencePanes/

or

/System/Library/PreferencesPanes/

Find the Preference Pane you would like to add, and find the Info.plist file within the bundle's contents.  The CFBundleIdentifier key lists the Preference Pane's domain and should be added to the list to enable the pane for the end user.</string>
			<key>pfm_name</key>
			<string>EnabledPreferencePanes-Raw</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.Localization</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.prefs.backup</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preferences.Bluetooth</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.datetime</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.desktopscreeneffect</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.digihub.discs</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.displays</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.dock</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.energysaver</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.expose</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.ink</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.internet</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.prefpanel.fibrechannel</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.general</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.keyboard</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.mouse</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.network</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preferences.parentalcontrols</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.printfax</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.quicktime</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.security</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preferences.sharing</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preferences.softwareupdate</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.sound</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.speech</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.spotlight</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.startupdisk</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.trackpad</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preference.universalaccess</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>One preference pane.</string>
					<key>pfm_name</key>
					<string>prefpane</string>
					<key>pfm_repetition_max</key>
					<integer>-1</integer>
					<key>pfm_repetition_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Preference Pane</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>com.apple.preferences.users</string>
				</dict>
			</array>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
				<string>system-managed</string>
			</array>
			<key>pfm_title</key>
			<string>Enabled System Preference Panes</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
	</array>
</dict>
</plist>
