<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>Education Configuration Payload</string>
        <key>pfm_title</key>
        <string>Education Configuration Payload</string>
        <key>pfm_format_version</key>
        <integer>1</integer>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.education</string>
        <key>pfm_ios_min</key>
        <string>9.3</string>
        <key>pfm_supervised</key>
        <true/>
        <key>pfm_highlander</key>
        <true/>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDescription</string>
                <key>pfm_title</key>
                <string>Payload Description</string>
                <key>pfm_description</key>
                <string>Description of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Education Configuration Payload</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDisplayName</string>
                <key>pfm_title</key>
                <string>Payload Display Name</string>
                <key>pfm_description</key>
                <string>Name of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Education Configuration Payload</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadIdentifier</string>
                <key>pfm_title</key>
                <string>Payload Identifier</string>
                <key>pfm_description</key>
                <string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.education</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadType</string>
                <key>pfm_title</key>
                <string>Payload Type</string>
                <key>pfm_description</key>
                <string>The type of the payload, a reverse dns string</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.education</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadUUID</string>
                <key>pfm_title</key>
                <string>Payload UUID</string>
                <key>pfm_description</key>
                <string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string></string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadVersion</string>
                <key>pfm_title</key>
                <string>Payload Version</string>
                <key>pfm_description</key>
                <string>The version of the whole configuration profile.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_default</key>
                <integer>1</integer>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadOrganization</string>
                <key>pfm_title</key>
                <string>Payload Organization</string>
                <key>pfm_description</key>
                <string>This value describes the issuing organization of the profile, as displayed to the user</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>OrganizationUUID</string>
                <key>pfm_title</key>
                <string>Organization Identifier</string>
                <key>pfm_description</key>
                <string>This can be any valid UUID. All teacher and student devices that need to communicate with one another must have the same OrganizationUUID, particularly if they originated from different Device Enrollment Programs.</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>OrganizationName</string>
                <key>pfm_title</key>
                <string>Organization Display Name</string>
                <key>pfm_description</key>
                <string>This name will be shown in the iOS login screen.</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadCertificateUUID</string>
                <key>pfm_title</key>
                <string>Client Authentication Certificate UUID</string>
                <key>pfm_description</key>
                <string>The UUID of an identity certificate payload that will be used to perform client authentication with other devices.</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>LeaderPayloadCertificateAnchorUUID</string>
                <key>pfm_title</key>
                <string>Leader Peer Identities</string>
                <key>pfm_description</key>
                <string>An array of UUIDs referring to certificate payloads that will be used to authorize leader peer certificate identities. This array must contain all certificates needed to validate the entire chain of trust. Leader certificates must have the common name prefix leader (case insensitive).</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>LeaderPayloadCertificateAnchorUUIDItem</string>
                        <key>pfm_title</key>
                        <string>Leader Peer Identity</string>
                        <key>pfm_description</key>
                        <string>Certificate payload that will be used to authorize leader peers</string>
                        <key>pfm_type</key>
                        <string>string</string>
                        <key>pfm_format</key>
                        <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
                    </dict>
                </array>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>MemberPayloadCertificateAnchorUUID</string>
                <key>pfm_title</key>
                <string>Group Member Peer Identities</string>
                <key>pfm_description</key>
                <string>An array of UUIDs referring to certificate payloads that will be used to authorize group member peer certificate identities. This array must contain all certificates needed to validate the entire chain of trust. Member certificates must have the common name prefix member (case insensitive).</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>MemberPayloadCertificateAnchorUUIDItem</string>
                        <key>pfm_title</key>
                        <string>Group Member Peer Identity</string>
                        <key>pfm_description</key>
                        <string>Certificate payload that will be used to verify group member peers</string>
                        <key>pfm_type</key>
                        <string>string</string>
                        <key>pfm_format</key>
                        <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
                    </dict>
                </array>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>UserIdentifier</string>
                <key>pfm_title</key>
                <string>Device User</string>
                <key>pfm_description</key>
                <string>A unique string that identifies the user of this device within the organization.</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>Departments</string>
                <key>pfm_title</key>
                <string>Departments</string>
                <key>pfm_description</key>
                <string>Shared: An array of dictionaries that define departments that are shown in the iOS login window. Leader: An array of dictionaries that define departments that are shown in the Classroom app.</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>DepartmentItem</string>
                        <key>pfm_title</key>
                        <string>Department Entry</string>
                        <key>pfm_description</key>
                        <string>Department Entry</string>
                        <key>pfm_type</key>
                        <string>dict</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>Name</string>
                                <key>pfm_title</key>
                                <string>Department Display Name</string>
                                <key>pfm_description</key>
                                <string>The display name of the department.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>GroupBeaconIDs</string>
                                <key>pfm_title</key>
                                <string>Group Beacon Identifiers</string>
                                <key>pfm_description</key>
                                <string>group beacon identifiers that are members of this department.</string>
                                <key>pfm_type</key>
                                <string>array</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                        </array>
                    </dict>
                </array>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>Groups</string>
                <key>pfm_title</key>
                <string>Groups</string>
                <key>pfm_description</key>
                <string>Shared: An array of dictionaries that define groups that the user can select in the login window.
                    Leader: An array of dictionaries that define the groups that the user can control.
                    Member: An array of dictionaries that define the groups of which the user is a member.
                </string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>GroupItem</string>
                        <key>pfm_title</key>
                        <string>Group Entry</string>
                        <key>pfm_description</key>
                        <string>Group Entry</string>
                        <key>pfm_type</key>
                        <string>dict</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>BeaconID</string>
                                <key>pfm_title</key>
                                <string>Group Unique Beacon ID</string>
                                <key>pfm_description</key>
                                <string>unsigned 16 bit integer specifying this group’s unique beacon ID.</string>
                                <key>pfm_type</key>
                                <string>integer</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>Name</string>
                                <key>pfm_title</key>
                                <string>Group Display Name</string>
                                <key>pfm_description</key>
                                <string>The display name of the group.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>Description</string>
                                <key>pfm_title</key>
                                <string>Group Description</string>
                                <key>pfm_description</key>
                                <string>The description of the group.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>ImageURL</string>
                                <key>pfm_title</key>
                                <string>Image URL</string>
                                <key>pfm_description</key>
                                <string>URL of an image for the group.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_ios_max</key>
                                <string>9.3.1</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>ConfigurationSource</string>
                                <key>pfm_title</key>
                                <string>Configuration Source</string>
                                <key>pfm_description</key>
                                <string>the source that provided this group; e.g. iTunesU, SIS, or MDM.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>LeaderIdentifiers</string>
                                <key>pfm_title</key>
                                <string>Leader Identifiers</string>
                                <key>pfm_description</key>
                                <string>user identifiers that are leaders of this group.</string>
                                <key>pfm_type</key>
                                <string>array</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>MemberIdentifiers</string>
                                <key>pfm_title</key>
                                <string>Member Identifiers</string>
                                <key>pfm_description</key>
                                <string>strings that refer to entries in the Users array that are members of the group.</string>
                                <key>pfm_type</key>
                                <string>array</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>DeviceGroupIdentifiers</string>
                                <key>pfm_title</key>
                                <string>Device Group Identifiers</string>
                                <key>pfm_description</key>
                                <string>identifier strings that refer to entries in the DeviceGroups array that are device groups to which the instructor can assign users from this class.</string>
                                <key>pfm_type</key>
                                <string>array</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                        </array>
                    </dict>
                </array>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>Users</string>
                <key>pfm_title</key>
                <string>Users</string>
                <key>pfm_description</key>
                <string> Shared: An array of dictionaries that define the users that are shown in the iOS login window.
                    Leader: An array of dictionaries that define users that are members of the leader’s groups.
                    Member: An array of dictionaries that must contain the definition of the user specified in the UserIdentifier key.
                    With one-to-one member devices, this key should include only the device user and the leader but not other class members.</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>UserItem</string>
                        <key>pfm_title</key>
                        <string>User Entry</string>
                        <key>pfm_description</key>
                        <string>User Entry</string>
                        <key>pfm_type</key>
                        <string>dict</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>Identifier</string>
                                <key>pfm_title</key>
                                <string>User ID</string>
                                <key>pfm_description</key>
                                <string>uniquely identifies a user in the organization.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>Name</string>
                                <key>pfm_title</key>
                                <string>User Name</string>
                                <key>pfm_description</key>
                                <string>The display name of the user.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>GivenName</string>
                                <key>pfm_title</key>
                                <string>Given Name</string>
                                <key>pfm_description</key>
                                <string>will be displayed as the given name of the user.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>FamilyName</string>
                                <key>pfm_title</key>
                                <string>Family Name</string>
                                <key>pfm_description</key>
                                <string>will be displayed as the family name of the user.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>ImageURL</string>
                                <key>pfm_title</key>
                                <string>User Image</string>
                                <key>pfm_description</key>
                                <string>A string containing a URL pointing to an image of the user. This image will be displayed in the iOS login screen and in the Classroom app. The recommended resolution is 256 x 256 pixels (512 x 512 pixels on a 2x device). The recommended formats are JPEG, PNG, and TIFF. The ResourcePayloadCertificateUUID identity certificate or the MDM client identity will be used to perform authentication when fetching the image.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>FullScreenImageURL</string>
                                <key>pfm_title</key>
                                <string>User Full Screen Image</string>
                                <key>pfm_description</key>
                                <string>URL pointing to an image of the user. The ResourcePayloadCertificateUUID identity certificate or the MDM client identity will be used to perform authentication when fetching the specified resource.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_ios_max</key>
                                <string>9.3.1</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>AppleID</string>
                                <key>pfm_title</key>
                                <string>Managed Apple ID</string>
                                <key>pfm_description</key>
                                <string>the Managed Apple ID for this user.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>PasscodeType</string>
                                <key>pfm_title</key>
                                <string>Passcode Length</string>
                                <key>pfm_description</key>
                                <string>The passcode UI to show when the user is at the login window</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_range_list</key>
                                <array>
                                    <string>complex</string>
                                    <string>four</string>
                                    <string>six</string>
                                </array>
                            </dict>
                        </array>
                    </dict>
                </array>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>DeviceGroups</string>
                <key>pfm_title</key>
                <string>Device Groups</string>
                <key>pfm_description</key>
                <string>Leader: An array of dictionaries that define the device groups to which the leader can assign devices. This key is not included in member payloads.</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>DeviceGroupItem</string>
                        <key>pfm_title</key>
                        <string>Device Group Item</string>
                        <key>pfm_description</key>
                        <string>Device Group Item</string>
                        <key>pfm_type</key>
                        <string>dict</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>Identifier</string>
                                <key>pfm_title</key>
                                <string>Device Group ID</string>
                                <key>pfm_description</key>
                                <string>uniquely identifies a device group in the organization.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>Name</string>
                                <key>pfm_title</key>
                                <string>Device Group Name</string>
                                <key>pfm_description</key>
                                <string>Will be displayed as the name of the device group, which must be unique in the organization</string>
                                <key>pfm_type</key>
                                <string>string</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>SerialNumbers</string>
                                <key>pfm_title</key>
                                <string>Device Serial Numbers</string>
                                <key>pfm_description</key>
                                <string>strings containing the serial numbers of the devices in the group.</string>
                                <key>pfm_type</key>
                                <string>array</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                        </array>
                    </dict>
                </array>
            </dict>
        </array>
    </dict>
</plist>
