<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Allows redirection of folders in the user's home.</string>
	<key>pfm_domain</key>
	<string>com.apple.MCXRedirector</string>
	<key>pfm_name</key>
	<string>MCXRedirector</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_description</key>
			<string>Redirections performed at user login.</string>
			<key>pfm_name</key>
			<string>LoginRedirection-raw</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>One redirect action.</string>
					<key>pfm_name</key>
					<string>ActionInfo</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The action performed. Use "deleteAndCreateSymLink" to delete an item at "Folder Path" and then create a symbolic link to "Destination Folder Path."  Use "renameAndCreateSymLink" to rename an item at "Folder Path" and then create a symbolic link to "Destination Folder Path."  Use "deletePath" to delete an item at "Folder Path."  Use "deleteSymLinkAndRestore" to delete an symbolic link at "Folder Path" and move a folder created by "renameAndCreateSymLink" to "Folder Path.""</string>
							<key>pfm_name</key>
							<string>action</string>
							<key>pfm_range_list</key>
							<array>
								<string>deleteAndCreateSymLink</string>
								<string>renameAndCreateSymLink</string>
								<string>deletePath</string>
								<string>deleteSymLinkAndRestore</string>
							</array>
							<key>pfm_title</key>
							<string>Action Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<string>~/Library/Caches</string>
							<key>pfm_description</key>
							<string>The folder path to act upon\, and is where to place a symbolic link. The path must be in the user's home.  Start the path with "~/" or a non "/"-character.</string>
							<key>pfm_name</key>
							<string>path</string>
							<key>pfm_title</key>
							<string>Folder Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<string>/tmp/%@/Library/Caches</string>
							<key>pfm_description</key>
							<string>Destination folder path for a symbolic link.  Use "~" to specify a path in the curent user's home. Use "%@" to specify the current user's name.</string>
							<key>pfm_name</key>
							<string>destPath</string>
							<key>pfm_title</key>
							<string>Destination Folder Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Redirect Action</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Login Redirections</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Redirections performed at network transitions.</string>
			<key>pfm_name</key>
			<string>OtherRedirection-raw</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>One redirect action.</string>
					<key>pfm_name</key>
					<string>ActionInfo</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The action performed.</string>
							<key>pfm_name</key>
							<string>action</string>
							<key>pfm_range_list</key>
							<array>
								<string>deleteAndCreateSymLink</string>
								<string>renameAndCreateSymLink</string>
								<string>deletePath</string>
								<string>deleteSymLinkAndRestore</string>
							</array>
							<key>pfm_title</key>
							<string>Action Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<string>~/Library/Caches</string>
							<key>pfm_description</key>
							<string>The folder path to act upon\, and is where to place a symbolic link. The path must be in the user's home.  Start the path with "~/" or a non "/"-charater.</string>
							<key>pfm_name</key>
							<string>path</string>
							<key>pfm_title</key>
							<string>Folder Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<string>/tmp/%@/Library/Caches</string>
							<key>pfm_description</key>
							<string>Destination folder path for a symbolic link.  Use "~" to specify a path in the curent user's home. Use "%@" to specify the current user's name.</string>
							<key>pfm_name</key>
							<string>destPath</string>
							<key>pfm_title</key>
							<string>Destination Folder Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Redirect Action</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Login Redirections</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Redirections performed at user logout.</string>
			<key>pfm_name</key>
			<string>LogoutRedirection-raw</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>One redirect action.</string>
					<key>pfm_name</key>
					<string>ActionInfo</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The action performed.</string>
							<key>pfm_name</key>
							<string>action</string>
							<key>pfm_range_list</key>
							<array>
								<string>deleteAndCreateSymLink</string>
								<string>renameAndCreateSymLink</string>
								<string>deletePath</string>
								<string>deleteSymLinkAndRestore</string>
							</array>
							<key>pfm_title</key>
							<string>Action Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<string>~/Library/Caches</string>
							<key>pfm_description</key>
							<string>The folder path to act upon\, and is where to place a symbolic link. The path must be in the user's home.  Start the path with "~/" or a non "/"-charater.</string>
							<key>pfm_name</key>
							<string>path</string>
							<key>pfm_title</key>
							<string>Folder Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<string>/tmp/%@/Library/Caches</string>
							<key>pfm_description</key>
							<string>Destination folder path for a symbolic link.  Use "~" to specify a path in the current user's home. Use "%@" to specify the current user's name.</string>
							<key>pfm_name</key>
							<string>destPath</string>
							<key>pfm_title</key>
							<string>Destination Folder Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Redirect Action</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Login Redirections</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Login redirection union policy</string>
			<key>pfm_name</key>
			<string>LoginRedirection-UPK</string>
			<key>pfm_remove_duplicates</key>
			<true/>
			<key>pfm_title</key>
			<string>Login Redirection Union Policy</string>
			<key>pfm_type</key>
			<string>union policy</string>
			<key>pfm_upk_input_keys</key>
			<array>
				<string>LoginRedirection-raw</string>
			</array>
			<key>pfm_upk_output_name</key>
			<string>LoginRedirection</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Other redirection union policy</string>
			<key>pfm_name</key>
			<string>OtherRedirection-UPK</string>
			<key>pfm_remove_duplicates</key>
			<true/>
			<key>pfm_title</key>
			<string>Other Redirection Union Policy</string>
			<key>pfm_type</key>
			<string>union policy</string>
			<key>pfm_upk_input_keys</key>
			<array>
				<string>OtherRedirection-raw</string>
			</array>
			<key>pfm_upk_output_name</key>
			<string>OtherRedirection</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Logout redirection union policy</string>
			<key>pfm_name</key>
			<string>LogoutRedirection-UPK</string>
			<key>pfm_remove_duplicates</key>
			<true/>
			<key>pfm_title</key>
			<string>Logout Redirection Union Policy</string>
			<key>pfm_type</key>
			<string>union policy</string>
			<key>pfm_upk_input_keys</key>
			<array>
				<string>LogoutRedirection-raw</string>
			</array>
			<key>pfm_upk_output_name</key>
			<string>LogoutRedirection</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user-managed</string>
	</array>
	<key>pfm_title</key>
	<string>Home Folder Redirection</string>
	<key>pfm_version</key>
	<real>1.1</real>
</dict>
</plist>
