<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>Parental Control Time Limits Payload</string>
        <key>pfm_title</key>
        <string>Parental Control Time Limits Payload</string>
        <key>pfm_format_version</key>
        <integer>1</integer>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.familycontrols.timelimits.v2</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDescription</string>
                <key>pfm_title</key>
                <string>Payload Description</string>
                <key>pfm_description</key>
                <string>Description of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Parental Control Time Limits Payload</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDisplayName</string>
                <key>pfm_title</key>
                <string>Payload Display Name</string>
                <key>pfm_description</key>
                <string>Name of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Parental Control Time Limits Payload</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadIdentifier</string>
                <key>pfm_title</key>
                <string>Payload Identifier</string>
                <key>pfm_description</key>
                <string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.familycontrols.timelimits.v2</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadType</string>
                <key>pfm_title</key>
                <string>Payload Type</string>
                <key>pfm_description</key>
                <string>The type of the payload, a reverse dns string</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.familycontrols.timelimits.v2</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadUUID</string>
                <key>pfm_title</key>
                <string>Payload UUID</string>
                <key>pfm_description</key>
                <string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string></string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadVersion</string>
                <key>pfm_title</key>
                <string>Payload Version</string>
                <key>pfm_description</key>
                <string>The version of the whole configuration profile.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_default</key>
                <integer>1</integer>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadOrganization</string>
                <key>pfm_title</key>
                <string>Payload Organization</string>
                <key>pfm_description</key>
                <string>This value describes the issuing organization of the profile, as displayed to the user</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>familyControlsEnabled</string>
                <key>pfm_title</key>
                <string>Family Controls Enabled</string>
                <key>pfm_description</key>
                <string>Required. Set to true to use time limits.</string>
                <key>pfm_type</key>
                <string>boolean</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>limits-list</string>
                <key>pfm_title</key>
                <string>Time Limits</string>
                <key>pfm_description</key>
                <string>Required if familyControlsEnabled is true. Time limits settings.</string>
                <key>pfm_type</key>
                <string>dictionary</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>weekday-allowance</string>
                        <key>pfm_title</key>
                        <string>Weekday allowance settings</string>
                        <key>pfm_description</key>
                        <string>Weekday allowance settings</string>
                        <key>pfm_type</key>
                        <string>dictionary</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>enabled</string>
                                <key>pfm_title</key>
                                <string>Setting Enabled</string>
                                <key>pfm_description</key>
                                <string>Required. Set to true to enable these settings.</string>
                                <key>pfm_type</key>
                                <string>boolean</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>rangeType</string>
                                <key>pfm_title</key>
                                <string>Range Type</string>
                                <key>pfm_description</key>
                                <string>Required. Type of day range: 0 = weekday, 1 = weekend.</string>
                                <key>pfm_type</key>
                                <string>integer</string>
                                <key>pfm_range_min</key>
                                <integer>0</integer>
                                <key>pfm_range_max</key>
                                <integer>1</integer>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>start</string>
                                <key>pfm_title</key>
                                <string>Start time</string>
                                <key>pfm_description</key>
                                <string>Optional. Curfew start time in the format %d:%d:%d.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>end</string>
                                <key>pfm_title</key>
                                <string>End time</string>
                                <key>pfm_description</key>
                                <string>Optional. Curfew end time in the format %d:%d:%d.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>secondsPerDay</string>
                                <key>pfm_title</key>
                                <string>Seconds per day</string>
                                <key>pfm_description</key>
                                <string>Optional. Seconds for that day for allowance.</string>
                                <key>pfm_type</key>
                                <string>integer</string>
                            </dict>
                        </array>
                    </dict>
                    <dict>
                        <key>pfm_name</key>
                        <string>weekday-curfew</string>
                        <key>pfm_title</key>
                        <string>Weekday curfew settings</string>
                        <key>pfm_description</key>
                        <string>Weekday curfew settings</string>
                        <key>pfm_type</key>
                        <string>dictionary</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>enabled</string>
                                <key>pfm_title</key>
                                <string>Setting Enabled</string>
                                <key>pfm_description</key>
                                <string>Required. Set to true to enable these settings.</string>
                                <key>pfm_type</key>
                                <string>boolean</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>rangeType</string>
                                <key>pfm_title</key>
                                <string>Range Type</string>
                                <key>pfm_description</key>
                                <string>Required. Type of day range: 0 = weekday, 1 = weekend.</string>
                                <key>pfm_type</key>
                                <string>integer</string>
                                <key>pfm_range_min</key>
                                <integer>0</integer>
                                <key>pfm_range_max</key>
                                <integer>1</integer>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>start</string>
                                <key>pfm_title</key>
                                <string>Start time</string>
                                <key>pfm_description</key>
                                <string>Optional. Curfew start time in the format %d:%d:%d.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>end</string>
                                <key>pfm_title</key>
                                <string>End time</string>
                                <key>pfm_description</key>
                                <string>Optional. Curfew end time in the format %d:%d:%d.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>secondsPerDay</string>
                                <key>pfm_title</key>
                                <string>Seconds per day</string>
                                <key>pfm_description</key>
                                <string>Optional. Seconds for that day for allowance.</string>
                                <key>pfm_type</key>
                                <string>integer</string>
                            </dict>
                        </array>
                    </dict>
                    <dict>
                        <key>pfm_name</key>
                        <string>weekend-allowance</string>
                        <key>pfm_title</key>
                        <string>Weekend allowance settings</string>
                        <key>pfm_description</key>
                        <string>Weekend allowance settings</string>
                        <key>pfm_type</key>
                        <string>dictionary</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>enabled</string>
                                <key>pfm_title</key>
                                <string>Setting Enabled</string>
                                <key>pfm_description</key>
                                <string>Required. Set to true to enable these settings.</string>
                                <key>pfm_type</key>
                                <string>boolean</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>rangeType</string>
                                <key>pfm_title</key>
                                <string>Range Type</string>
                                <key>pfm_description</key>
                                <string>Required. Type of day range: 0 = weekday, 1 = weekend.</string>
                                <key>pfm_type</key>
                                <string>integer</string>
                                <key>pfm_range_min</key>
                                <integer>0</integer>
                                <key>pfm_range_max</key>
                                <integer>1</integer>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>start</string>
                                <key>pfm_title</key>
                                <string>Start time</string>
                                <key>pfm_description</key>
                                <string>Optional. Curfew start time in the format %d:%d:%d.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>end</string>
                                <key>pfm_title</key>
                                <string>End time</string>
                                <key>pfm_description</key>
                                <string>Optional. Curfew end time in the format %d:%d:%d.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>secondsPerDay</string>
                                <key>pfm_title</key>
                                <string>Seconds per day</string>
                                <key>pfm_description</key>
                                <string>Optional. Seconds for that day for allowance.</string>
                                <key>pfm_type</key>
                                <string>integer</string>
                            </dict>
                        </array>
                    </dict>
                    <dict>
                        <key>pfm_name</key>
                        <string>weekend-curfew</string>
                        <key>pfm_title</key>
                        <string>Weekend curfew settings</string>
                        <key>pfm_description</key>
                        <string>Weekend curfew settings</string>
                        <key>pfm_type</key>
                        <string>dictionary</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>enabled</string>
                                <key>pfm_title</key>
                                <string>Setting Enabled</string>
                                <key>pfm_description</key>
                                <string>Required. Set to true to enable these settings.</string>
                                <key>pfm_type</key>
                                <string>boolean</string>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>rangeType</string>
                                <key>pfm_title</key>
                                <string>Range Type</string>
                                <key>pfm_description</key>
                                <string>Required. Type of day range: 0 = weekday, 1 = weekend.</string>
                                <key>pfm_type</key>
                                <string>integer</string>
                                <key>pfm_range_min</key>
                                <integer>0</integer>
                                <key>pfm_range_max</key>
                                <integer>1</integer>
                                <key>pfm_require</key>
                                <string>always</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>start</string>
                                <key>pfm_title</key>
                                <string>Start time</string>
                                <key>pfm_description</key>
                                <string>Optional. Curfew start time in the format %d:%d:%d.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>end</string>
                                <key>pfm_title</key>
                                <string>End time</string>
                                <key>pfm_description</key>
                                <string>Optional. Curfew end time in the format %d:%d:%d.</string>
                                <key>pfm_type</key>
                                <string>string</string>
                            </dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>secondsPerDay</string>
                                <key>pfm_title</key>
                                <string>Seconds per day</string>
                                <key>pfm_description</key>
                                <string>Optional. Seconds for that day for allowance.</string>
                                <key>pfm_type</key>
                                <string>integer</string>
                            </dict>
                        </array>
                    </dict>
                </array>
            </dict>
        </array>
    </dict>
</plist>
