<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>Unified Logging Configuration</string>
        <key>pfm_title</key>
        <string>Unified Logging Configuration</string>
        <key>pfm_format_version</key>
        <integer>1</integer>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.system.logging</string>
        <key>pfm_macos_min</key>
        <string>10.12</string>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDescription</string>
                <key>pfm_title</key>
                <string>Payload Description</string>
                <key>pfm_description</key>
                <string>Description of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Unified Logging Configuration</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDisplayName</string>
                <key>pfm_title</key>
                <string>Payload Display Name</string>
                <key>pfm_description</key>
                <string>Name of the payload</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>Unified Logging Configuration</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadIdentifier</string>
                <key>pfm_title</key>
                <string>Payload Identifier</string>
                <key>pfm_description</key>
                <string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.system.logging</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadType</string>
                <key>pfm_title</key>
                <string>Payload Type</string>
                <key>pfm_description</key>
                <string>The type of the payload, a reverse dns string</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.system.logging</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadUUID</string>
                <key>pfm_title</key>
                <string>Payload UUID</string>
                <key>pfm_description</key>
                <string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string></string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadVersion</string>
                <key>pfm_title</key>
                <string>Payload Version</string>
                <key>pfm_description</key>
                <string>The version of the whole configuration profile.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_default</key>
                <integer>1</integer>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadOrganization</string>
                <key>pfm_title</key>
                <string>Payload Organization</string>
                <key>pfm_description</key>
                <string>This value describes the issuing organization of the profile, as displayed to the user</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>Processes</string>
                <key>pfm_title</key>
                <string>Processes</string>
                <key>pfm_description</key>
                <string>Configure Process Logging</string>
                <key>pfm_type</key>
                <string>dictionary</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>Subsystems</string>
                <key>pfm_title</key>
                <string>Subsystems</string>
                <key>pfm_description</key>
                <string>Configure Subsystem Logging</string>
                <key>pfm_type</key>
                <string>dictionary</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_name</key>
                        <string>subsystemDomain</string>
                        <key>pfm_title</key>
                        <string>com.subsystem.domain</string>
                        <key>pfm_description</key>
                        <string>A subsystem is your apps bundle ID or is explicitly set through the os_log_create function. Wildcards are not accepted</string>
                        <key>pfm_type</key>
                        <string>dictionary</string>
                        <key>pfm_subkeys</key>
                        <array>
                            <dict>
                                <key>pfm_name</key>
                                <string>DEFAULT-OPTIONS</string>
                                <key>pfm_title</key>
                                <string>Default options</string>
                                <key>pfm_description</key>
                                <string>Default logging settings for logs that have no category set.</string>
                                <key>pfm_type</key>
                                <string>dictionary</string>
                                <key>pfm_subkeys</key>
                                <array>
                                    <dict>
                                        <key>pfm_name</key>
                                        <string>Level</string>
                                        <key>pfm_title</key>
                                        <string>Minimum Level</string>
                                        <key>pfm_description</key>
                                        <string>Configures minimum logging level and persistence level</string>
                                        <key>pfm_type</key>
                                        <string>dictionary</string>
                                        <key>pfm_subkeys</key>
                                        <array>
                                            <dict>
                                                <key>pfm_name</key>
                                                <string>Enable</string>
                                                <key>pfm_title</key>
                                                <string>Minimum log level enabled</string>
                                                <key>pfm_description</key>
                                                <string>The minimum log level that will be enabled. Messages sent through NSLog are at the Default level. The default value of this is inherited from the System setting.</string>
                                                <key>pfm_type</key>
                                                <string>string</string>
                                                <key>pfm_default</key>
                                                <string>Inherit</string>
                                                <key>pfm_range_list</key>
                                                <array>
                                                    <string>Inherit</string>
                                                    <string>Default</string>
                                                    <string>Info</string>
                                                    <string>Debug</string>
                                                </array>
                                            </dict>
                                            <dict>
                                                <key>pfm_name</key>
                                                <string>Persist</string>
                                                <key>pfm_title</key>
                                                <string>Minimum log level to persist</string>
                                                <key>pfm_description</key>
                                                <string>The minimum log level that will be persisted. Messages sent through NSLog are at the Default level. The default value of this is inherited from the System setting.</string>
                                                <key>pfm_type</key>
                                                <string>string</string>
                                                <key>pfm_default</key>
                                                <string>Inherit</string>
                                                <key>pfm_range_list</key>
                                                <array>
                                                    <string>Inherit</string>
                                                    <string>Default</string>
                                                    <string>Info</string>
                                                    <string>Debug</string>
                                                </array>
                                            </dict>
                                        </array>
                                    </dict>
                                    <dict>
                                        <key>pfm_name</key>
                                        <string>Default-Privacy-Setting</string>
                                        <key>pfm_title</key>
                                        <string>Sensitive Data Logging Settings</string>
                                        <key>pfm_description</key>
                                        <string>Changes how variables eg string substitutions are formatted in the log</string>
                                        <key>pfm_type</key>
                                        <string>string</string>
                                        <key>pfm_range_list</key>
                                        <array>
                                            <string>Inherit</string>
                                            <string>Public</string>
                                            <string>Private</string>
                                        </array>
                                    </dict>
                                    <dict>
                                        <key>pfm_name</key>
                                        <string>TTL</string>
                                        <key>pfm_title</key>
                                        <string>Log entry time to live by level</string>
                                        <key>pfm_description</key>
                                        <string>Changes how long a log entry will remain before being removed</string>
                                        <key>pfm_type</key>
                                        <string>dictionary</string>
                                        <key>pfm_subkeys</key>
                                        <array>
                                            <dict>
                                                <key>pfm_name</key>
                                                <string>Default</string>
                                                <key>pfm_title</key>
                                                <string>Default</string>
                                                <key>pfm_description</key>
                                                <string>Default Log Level TTL in days</string>
                                                <key>pfm_type</key>
                                                <string>integer</string>
                                            </dict>
                                            <dict>
                                                <key>pfm_name</key>
                                                <string>Debug</string>
                                                <key>pfm_title</key>
                                                <string>Debug</string>
                                                <key>pfm_description</key>
                                                <string>Debug Log Level TTL in days</string>
                                                <key>pfm_type</key>
                                                <string>integer</string>
                                            </dict>
                                            <dict>
                                                <key>pfm_name</key>
                                                <string>Info</string>
                                                <key>pfm_title</key>
                                                <string>Info</string>
                                                <key>pfm_description</key>
                                                <string>Info Log Level TTL in days</string>
                                                <key>pfm_type</key>
                                                <string>integer</string>
                                            </dict>
                                        </array>
                                    </dict>
                                    <dict>
                                        <key>pfm_name</key>
                                        <string>Propagate-with-Activity</string>
                                        <key>pfm_title</key>
                                        <string>Messages attached to the activity tree</string>
                                        <key>pfm_description</key>
                                        <string>Messages are attached to the activity tree in Console and crash dumps</string>
                                        <key>pfm_type</key>
                                        <string>boolean</string>
                                    </dict>
                                </array>
                            </dict>
                        </array>
                    </dict>
                    <dict>
                        <key>pfm_name</key>
                        <string>CategoryName</string>
                        <key>pfm_title</key>
                        <string>Category Logging Options</string>
                        <key>pfm_description</key>
                        <string>Default logging settings for the category specified by (CategoryName). This dictionary takes the same format as DEFAULT-OPTIONS.</string>
                        <key>pfm_type</key>
                        <string>dictionary</string>
                    </dict>
                    <dict>
                        <key>pfm_name</key>
                        <string>Enable-Oversize-Messages</string>
                        <key>pfm_title</key>
                        <string>Enable Oversize Messages</string>
                        <key>pfm_description</key>
                        <string>Enables large messages in the log. This WILL have
                            a detrimental effect on performance.</string>
                        <key>pfm_type</key>
                        <string>boolean</string>
                    </dict>
                </array>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>System</string>
                <key>pfm_title</key>
                <string>System</string>
                <key>pfm_description</key>
                <string>Configure System Logging</string>
                <key>pfm_type</key>
                <string>dictionary</string>
            </dict>
        </array>
    </dict>
</plist>