<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define 802.1x Ethernet settings</string>
	<key>pfm_title</key>
	<string>802.1x Ethernet Settings</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_version</key>
	<integer>1</integer>
	<key>pfm_domain</key>
	<string>com.apple.firstactiveethernet.managed</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>802.1x Ethernet Settings</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>802.1x Ethernet Settings</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.firstactiveethernet.managed</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_range_list</key>
			<array>
				<string>com.apple.firstactiveethernet.managed</string>
				<string>com.apple.firstethernet.managed</string>
				<string>com.apple.secondactiveethernet.managed</string>
				<string>com.apple.secondethernet.managed</string>
				<string>com.apple.thirdactiveethernet.managed</string>
				<string>com.apple.thirdethernet.managed</string>
				<string>com.apple.globalethernet.managed</string>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.firstactiveethernet.managed</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>EAPClientConfiguration</string>
			<key>pfm_title</key>
			<string>EAP Client Configuration</string>
			<key>pfm_description</key>
			<string>Specifies 802.1x EAP authentication parameters</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>AcceptEAPTypes</string>
					<key>pfm_title</key>
					<string>Accept EAP Types</string>
					<key>pfm_description</key>
					<string>The EAP types accepted</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>EAPType</string>
							<key>pfm_title</key>
							<string>EAP Type</string>
							<key>pfm_description</key>
							<string>An integer representing an EAP type, inside of the Accept EAP Types array</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_range_list</key>
							<array>
								<integer>13</integer>
								<integer>17</integer>
								<integer>21</integer>
								<integer>25</integer>
								<integer>43</integer>
								<integer>18</integer>
								<integer>23</integer>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>UserName</string>
					<key>pfm_title</key>
					<string>Username</string>
					<key>pfm_description</key>
					<string>Username. If not provided, the user may be prompted during login</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
									<key>pfm_contains_any</key>
									<array>
										<integer>17</integer>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>17</integer>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>UserPassword</string>
					<key>pfm_title</key>
					<string>Password</string>
					<key>pfm_description</key>
					<string>Password. If not provided, the user may be prompted during login</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
									<key>pfm_contains_any</key>
									<array>
										<integer>17</integer>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
								</dict>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.OneTimeUserPassword</string>
									<key>pfm_n_range_list</key>
									<array>
										<true/>
									</array>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.OneTimeUserPassword</string>
									<key>pfm_range_list</key>
									<array>
										<true/>
									</array>
								</dict>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.OneTimeUserPassword</string>
									<key>pfm_present</key>
									<true/>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>17</integer>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>OneTimeUserPassword</string>
					<key>pfm_title</key>
					<string>Per-Connection Password</string>
					<key>pfm_description</key>
					<string>If set, the user will be prompted for a password each time they connect to the network</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>17</integer>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>PayloadCertificateAnchorUUID</string>
					<key>pfm_title</key>
					<string>Certificate Anchor UUID</string>
					<key>pfm_description</key>
					<string>Array of UUIDs corresponding to the trusted certificates for this authentication</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>CertificateAnchorUUID</string>
							<key>pfm_title</key>
							<string>Individual Certificate Anchor UUID</string>
							<key>pfm_description</key>
							<string>A UUID for a trusted certificate</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_format</key>
							<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>TLSTrustedServerNames</string>
					<key>pfm_title</key>
					<string>TLS Trusted Server Names</string>
					<key>pfm_description</key>
					<string>Array of Common Names of server certificates that can be trusted. The wildcard * can be used to match a range of strings</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>TLSTrustedServerName</string>
							<key>pfm_title</key>
							<string>Individual Trusted TLS Server Name</string>
							<key>pfm_description</key>
							<string>An item in the TLS Trusted Server Names array representing a Common Name of a server certificate.</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>TLSAllowTrustExceptions</string>
					<key>pfm_title</key>
					<string>Allow Trust Exceptions</string>
					<key>pfm_description</key>
					<string>No longer supported in iOS 8 and later</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>NONEXISTENT</string>
									<key>pfm_present</key>
									<false/>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_max</key>
					<string>7.9</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>TTLSInnerAuthentication</string>
					<key>pfm_title</key>
					<string>TTLS Inner Authentication</string>
					<key>pfm_description</key>
					<string>Specifies the inner authentication used by the TTLS module</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_range_list</key>
					<array>
						<string>PAP</string>
						<string>EAP</string>
						<string>CHAP</string>
						<string>MSCHAP</string>
						<string>MSCHAPv2</string>
					</array>
					<key>pfm_default</key>
					<string>MSCHAPv2</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
									<key>pfm_contains_any</key>
									<array>
										<integer>21</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>OuterIdentity</string>
					<key>pfm_title</key>
					<string>Outer Identity</string>
					<key>pfm_description</key>
					<string>If TTLS, PEAP, or EAP-FAST is used, this string is used instead of the user&apos;s identity outside the encrypted tunnel. This value can be used to mask the true identity of the person using the network</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>EAPFASTUsePAC</string>
					<key>pfm_title</key>
					<string>Use PAC</string>
					<key>pfm_description</key>
					<string>If set, the device will use an existing PAC if it&apos;s present. Otherwise the server must present its identity using a certificate</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>43</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>EAPFASTProvisionPAC</string>
					<key>pfm_title</key>
					<string>Provision PAC</string>
					<key>pfm_description</key>
					<string>If set, provisions the device </string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>43</integer>
									</array>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.EAPFASTUsePAC</string>
									<key>pfm_n_range_list</key>
									<array>
										<true/>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>EAPFASTProvisionPACAnonymously</string>
					<key>pfm_title</key>
					<string>Provision PAC Anonymously</string>
					<key>pfm_description</key>
					<string>If set, provisions the device anonymously. Note that there are known man-in-the-middle attacks for anonymous provisioning</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>43</integer>
									</array>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.EAPFASTProvisionPAC</string>
									<key>pfm_n_range_list</key>
									<array>
										<true/>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>EAPSIMNumberOfRANDs</string>
					<key>pfm_title</key>
					<string>Allow Two RANDs</string>
					<key>pfm_description</key>
					<string>The minimum number of RAND values accepted from the server. 3 is the default, and 2 is allowed, but offers less security. For use with EAP-SIM only.</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_default</key>
					<integer>3</integer>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>18</integer>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>Password</string>
			<key>pfm_title</key>
			<string>Password</string>
			<key>pfm_description</key>
			<string>Specifies the password for the access point</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>EAPClientConfiguration</string>
							<key>pfm_present</key>
							<true/>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadCertificateUUID</string>
			<key>pfm_title</key>
			<string>Certificate UUID</string>
			<key>pfm_description</key>
			<string>UUID of the certificate payload containing an identity used as the client credential</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>EAPClientConfiguration.AcceptEAPTypes</string>
							<key>pfm_n_contains_any</key>
							<array>
								<integer>13</integer>
								<integer>21</integer>
								<integer>25</integer>
								<integer>43</integer>
							</array>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>EAPClientConfiguration.AcceptEAPTypes</string>
							<key>pfm_contains_any</key>
							<array>
								<integer>13</integer>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>TLSCertificateRequired</string>
			<key>pfm_title</key>
			<string>Certificate Required</string>
			<key>pfm_description</key>
			<string>If set, force a non-default authentication method. (if YES, uses certificate from PayloadCertificateUUID)</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ProxyType</string>
			<key>pfm_title</key>
			<string>Proxy Type</string>
			<key>pfm_description</key>
			<string>The type of proxy configuration to use for this wireless connection</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>None</string>
			<key>pfm_range_list</key>
			<array>
				<string>None</string>
				<string>Manual</string>
				<string>Auto</string>
			</array>
			<key>pfm_ios_min</key>
			<string>5.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ProxyServer</string>
			<key>pfm_title</key>
			<string>Proxy Server</string>
			<key>pfm_description</key>
			<string>The hostname of the proxy server</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>ProxyType</string>
							<key>pfm_range_list</key>
							<array>
								<string>Manual</string>
							</array>
						</dict>
						<dict>
							<key>pfm_target</key>
							<string>ProxyType</string>
							<key>pfm_present</key>
							<true/>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>ProxyType</string>
							<key>pfm_n_range_list</key>
							<array>
								<string>Manual</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ProxyUsername</string>
			<key>pfm_title</key>
			<string>Proxy Username</string>
			<key>pfm_description</key>
			<string>The username for proxy server authentication</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>ProxyType</string>
							<key>pfm_n_range_list</key>
							<array>
								<string>Manual</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ProxyServerPort</string>
			<key>pfm_title</key>
			<string>Proxy Server Port</string>
			<key>pfm_description</key>
			<string>The port used to connect to the proxy server</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_range_max</key>
			<integer>65535</integer>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>ProxyType</string>
							<key>pfm_range_list</key>
							<array>
								<string>Manual</string>
							</array>
						</dict>
						<dict>
							<key>pfm_target</key>
							<string>ProxyType</string>
							<key>pfm_present</key>
							<true/>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>ProxyType</string>
							<key>pfm_n_range_list</key>
							<array>
								<string>Manual</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ProxyPassword</string>
			<key>pfm_title</key>
			<string>Proxy Password</string>
			<key>pfm_description</key>
			<string>The password to authenticate with the proxy</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>ProxyType</string>
							<key>pfm_n_range_list</key>
							<array>
								<string>Manual</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ProxyPACURL</string>
			<key>pfm_title</key>
			<string>Proxy Username</string>
			<key>pfm_description</key>
			<string>URL used to recieve proxy settings</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>ProxyType</string>
							<key>pfm_n_range_list</key>
							<array>
								<string>Auto</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ProxyPACFallbackAllowed</string>
			<key>pfm_title</key>
			<string>Proxy PAC Fallback Allowed</string>
			<key>pfm_description</key>
			<string>Proxy PAC Fallback Allowed</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>ProxyType</string>
							<key>pfm_n_range_list</key>
							<array>
								<string>Auto</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>QoSMarkingPolicy</string>
			<key>pfm_title</key>
			<string>QoS Marking Policy</string>
			<key>pfm_description</key>
			<string>Restrict fast lane QoS marking</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>QoSMarkingEnabled</string>
					<key>pfm_title</key>
					<string>Allow QoS marking</string>
					<key>pfm_description</key>
					<string>Enable any kind of QoS marking</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfm_default</key>
					<true/>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>QoSMarkingAppleAudioVideoCalls</string>
					<key>pfm_title</key>
					<string>QoS marking for audio/video calls</string>
					<key>pfm_description</key>
					<string>Enable QoS for WiFi Calling, FaceTime, SMS, etc.</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfm_default</key>
					<true/>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>QoSMarkingWhitelistedAppIdentifiers</string>
					<key>pfm_title</key>
					<string>Whitelisted App Identifiers</string>
					<key>pfm_description</key>
					<string>Whitelist specific apps for QoS marking</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>appBundleID</string>
							<key>pfm_title</key>
							<string>Whitelisted App</string>
							<key>pfm_description</key>
							<string>Whitelisted App</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_default</key>
							<string></string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>10.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>Interface</string>
			<key>pfm_title</key>
			<string>Interface name</string>
			<key>pfm_description</key>
			<string>The name of the interface, only used with the payload com.apple.globalethernet.managed</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_range_list</key>
			<array>
				<string>FirstEthernet</string>
				<string>AnyEthernet</string>
			</array>
		</dict>
	</array>
</dict>
</plist>
