<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>NoMAD Actions settings</string>
		<key>pfm_title</key>
		<string>NoMAD Actions</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_icon</key>
		<data></data>
		<key>pfm_domain</key>
		<string>menu.nomad.actions</string>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_app_url</key>
		<string>https://nomad.menu</string>
		<key>pfm_documentation_url</key>
		<string>https://nomad.menu/help-center/preferences-and-what-they-do/</string>
		<key>pfm_subkeys</key>
		<array>
		
			<!-- Default Payload Keys -->
		
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures NoMAD Actions settings</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>NoMAD Actions</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>menu.nomad.actions</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>menu.nomad.actions</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
		
			<!-- Custom Payload Keys -->
		
			<dict>
				<key>pfm_name</key>
				<string>Actions</string>
				<key>pfm_description</key>
				<string>Actions</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_app_min</key>
				<string>1.0</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>Action Item</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_require</key>
						<string>always</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>Name</string>
								<key>pfm_description</key>
								<string></string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_require</key>
								<string>always</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>ToolTip</string>
								<key>pfm_description</key>
								<string></string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>Action</string>
								<key>pfm_description</key>
								<string></string>
								<key>pfm_type</key>
								<string>array</string>
								<key>pfm_subkeys</key>
								<array>
									<dict>
										<key>pfm_name</key>
										<string>Command</string>
										<key>pfm_description</key>
										<string></string>
										<key>pfm_type</key>
										<string>string</string>
										<key>pfm_range_list</key>
										<array>
											<string>url</string>
											<string>path</string>
										</array>
									</dict>
									<dict>
										<key>pfm_name</key>
										<string>CommandOptions</string>
										<key>pfm_description</key>
										<string></string>
										<key>pfm_type</key>
										<string>string</string>
									</dict>
								</array>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>Title</string>
								<key>pfm_description</key>
								<string></string>
								<key>pfm_type</key>
								<string>array</string>
								<key>pfm_subkeys</key>
								<array>
									<dict>
										<key>pfm_name</key>
										<string>Command</string>
										<key>pfm_description</key>
										<string></string>
										<key>pfm_type</key>
										<string>string</string>
										<key>pfm_range_list</key>
										<array>
											<string>url</string>
											<string>path</string>
										</array>
									</dict>
									<dict>
										<key>pfm_name</key>
										<string>CommandOptions</string>
										<key>pfm_description</key>
										<string></string>
										<key>pfm_type</key>
										<string>string</string>
									</dict>
								</array>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
		</array>
	</dict>
</plist>
