<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Developer: Require settings</string>
	<key>pfm_domain</key>
	<string>com.profilecreator.developer.require</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2018-07-18T08:58:49Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
		<string>tvOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Developer: Require settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Developer: Require</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.profilecreator.developer.require</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.profilecreator.developer.require</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Require condition target.</string>
			<key>pfm_name</key>
			<string>Require00</string>
			<key>pfm_range_list</key>
			<array>
				<string>Item01</string>
				<string>Item02</string>
				<string>Item03</string>
				<string>Item04</string>
				<string>Item05</string>
				<string>Item06</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Require 00: Settings</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Require always.</string>
			<key>pfm_name</key>
			<string>Require01</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Require 01: Always</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Item01</string>
							</array>
							<key>pfm_target</key>
							<string>Require00</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Require always if Item01 is selected.</string>
			<key>pfm_name</key>
			<string>Require02</string>
			<key>pfm_title</key>
			<string>Require 02: Always If Item01 is selected</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<string>Item02</string>
								<string>Item03</string>
							</array>
							<key>pfm_target</key>
							<string>Require00</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Require always if Item02 or Item03 is selected.</string>
			<key>pfm_name</key>
			<string>Require03</string>
			<key>pfm_title</key>
			<string>Require 03: Always If Item02 or Item03 is selected</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Item04</string>
							</array>
							<key>pfm_target</key>
							<string>Require00</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Require always if Item04 is NOT selected.</string>
			<key>pfm_name</key>
			<string>Require04</string>
			<key>pfm_title</key>
			<string>Require 04: Always If Item04 is NOT selected</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_contains_any</key>
							<array>
								<string>Item05</string>
								<string>Item06</string>
							</array>
							<key>pfm_target</key>
							<string>Require00</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Require always if Item05 or Item06 is NOT selected.</string>
			<key>pfm_name</key>
			<string>Require05</string>
			<key>pfm_title</key>
			<string>Require 05: Always If Item05 or Item06 is NOT selected</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Require push.</string>
			<key>pfm_name</key>
			<string>Require06</string>
			<key>pfm_require</key>
			<string>push</string>
			<key>pfm_title</key>
			<string>Require 06: Push</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Item01</string>
							</array>
							<key>pfm_target</key>
							<string>Require00</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Require push if Item01 is selected.</string>
			<key>pfm_name</key>
			<string>Require07</string>
			<key>pfm_title</key>
			<string>Require 07: Push If Item01 is selected</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<string>Item02</string>
								<string>Item03</string>
							</array>
							<key>pfm_target</key>
							<string>Require00</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Require push if Item02 or Item03 is selected.</string>
			<key>pfm_name</key>
			<string>Require08</string>
			<key>pfm_title</key>
			<string>Require 08: Push If Item02 or Item03 is selected</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Item04</string>
							</array>
							<key>pfm_target</key>
							<string>Require00</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Require push if Item04 is NOT selected.</string>
			<key>pfm_name</key>
			<string>Require09</string>
			<key>pfm_title</key>
			<string>Require 09: Push If Item04 is NOT selected</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_contains_any</key>
							<array>
								<string>Item05</string>
								<string>Item06</string>
							</array>
							<key>pfm_target</key>
							<string>Require00</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Require push if Item05 or Item06 is NOT selected.</string>
			<key>pfm_name</key>
			<string>Require10</string>
			<key>pfm_title</key>
			<string>Require 10: Push If Item05 or Item06 is NOT selected</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Developer: Require</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
