<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Developer: Substitution Variables settings</string>
	<key>pfm_domain</key>
	<string>com.profilecreator.developer.substitution_variables</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2021-12-22T09:41:49Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
		<string>tvOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Developer: Substitution Variables settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Developer: Substitution Variables</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.profilecreator.developer.substitution_variables</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.profilecreator.developer.substitution_variables</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>

		<!-- Custom Keys -->

		<dict>
			<key>pfm_description</key>
			<string>TextField with substitution variables: &lt;&lt;serial&gt;&gt;</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>10.13.1</string>
			<key>pfm_documentation_url</key>
			<string>https://www.apple.com</string>
			<key>pfm_substitution_variables</key>
			<dict>
				<key>&lt;&lt;serial&gt;&gt;</key>
				<dict>
					<key>pfm_description</key>
					<string>Serial Number of the device.</string>
					<key>pfm_value_placeholder</key>
					<string>C02LL3M2FH01</string>
					<key>pfm_substitution_source</key>
					<string>local</string>
				</dict>
				<key>&lt;&lt;fullname&gt;&gt;</key>
				<dict>
					<key>pfm_description</key>
					<string>Full Name of the current user.</string>
					<key>pfm_value_placeholder</key>
					<string>John Doe</string>
					<key>pfm_substitution_source</key>
					<string>local</string>
				</dict>
				<key>&lt;&lt;shortname&gt;&gt;</key>
				<dict>
					<key>pfm_description</key>
					<string>Shortname of the current user.</string>
					<key>pfm_value_placeholder</key>
					<string>johndoe</string>
					<key>pfm_substitution_source</key>
					<string>local</string>
				</dict>
				<key>&lt;&lt;domain&gt;&gt;</key>
				<dict>
					<key>pfm_description</key>
					<string>AD Domain.</string>
					<key>pfm_value_placeholder</key>
					<string>example.com</string>
					<key>pfm_substitution_source</key>
					<string>local</string>
				</dict>
			</dict>
			<key>pfm_name</key>
			<string>SubstitutionVariables01</string>
			<key>pfm_title</key>
			<string>Substitution Variables 01: TextField</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>Substitute this: &lt;&lt;serial&gt;&gt;</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Developer: Substitution Variables</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
