<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Developer: TextField Integer settings</string>
	<key>pfm_domain</key>
	<string>com.profilecreator.developer.TextFieldInteger</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2018-07-18T08:58:49Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
		<string>tvOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Developer: TextField Integer settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Developer: TextField Integer</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.profilecreator.developer.textfieldinteger</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.profilecreator.developer.textfieldinteger</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>TextField Integer.</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>TextFieldInteger01</string>
			<key>pfm_title</key>
			<string>TextFieldInteger 01: Standard Integer</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>TextField Integer with a long title.</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>TextFieldInteger02</string>
			<key>pfm_title</key>
			<string>TextFieldInteger 02: Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Title</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>TextFieldInteger with a long long long long long long long long long long long long long long long long long long long long long long long long long description.</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>TextFieldInteger03</string>
			<key>pfm_title</key>
			<string>TextFieldInteger 03: Long Description</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>TextFieldInteger with a placeholder value.</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>TextFieldInteger04</string>
			<key>pfm_title</key>
			<string>TextFieldInteger 04: Placeholder Value</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<integer>99</integer>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>99</integer>
			<key>pfm_description</key>
			<string>TextFieldInteger with a default value.</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>TextFieldInteger05</string>
			<key>pfm_title</key>
			<string>TextFieldInteger 05: Default Value</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>TextFieldInteger with no title.</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>TextFieldInteger06</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>TextFieldInteger with an empty title.</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>TextFieldInteger07</string>
			<key>pfm_title</key>
			<string></string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>TextFieldInteger08</string>
			<key>pfm_title</key>
			<string>TextFieldInteger 08: No Description</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>TextFieldInteger09</string>
			<key>pfm_title</key>
			<string>TextFieldInteger 09: Empty Description</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>98</integer>
			<key>pfm_description</key>
			<string>TextFieldInteger with a max value of: 99</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>TextFieldInteger10</string>
			<key>pfm_range_max</key>
			<integer>99</integer>
			<key>pfm_title</key>
			<string>TextFieldInteger 10: Max Value</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>2</integer>
			<key>pfm_description</key>
			<string>TextFieldInteger with a min value of: 1</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>TextFieldInteger11</string>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>TextFieldInteger 11: Min Value</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>2</integer>
			<key>pfm_description</key>
			<string>TextFieldInteger with a min value of: 1 and max value of: 99</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>TextFieldInteger12</string>
			<key>pfm_range_max</key>
			<integer>99</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>TextFieldInteger 12: Min and Max Value</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Developer: TextField Integer</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
