<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Configures Parental Controls: Application Access settings</string>
	<key>pfm_description_reference</key>
	<string>The Parental Control Application Access payload is designated by specifying com.apple.applicationaccess.new as the PayloadType value.
It enables application access restrictions on macOS.
To determine if an application can be launched, these rules are evaluated:
1. Certainsystemapplicationsandutilitiesarealwaysallowedtorun.
2. ThewhiteListissearchedtoseeifamatchingentryisfoundbybundleID.Ifamatchisfound,theappID and detachedSignature (if present) are used to verify the signature of the application being launched. If the signature is valid and matches the designated requirement (in the appID key), the application is allowed to launch.
3. If the path to the binary being launched matches (or is in a subdirectory) of a path in pathBlackList, the binary is denied.
4. Ifthepathtothebinarybeinglaunchedmatches(orisasubdirectory)ofapathinpathWhiteList,thebinary is allowed to launch.
5. Thebinaryisdeniedpermissiontolaunch.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/parentalcontrolsapplicationrestrictions</string>
	<key>pfm_domain</key>
	<string>com.apple.applicationaccess.new</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2021-12-13T03:14:13Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Parental Controls: Application Access</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Parental Controls: Application Access</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.applicationaccess.new</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.applicationaccess.new</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile.
The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If 'true', enables app access restrictions.</string>
			<key>pfm_description_reference</key>
			<string>Required. Set to true to enable application access restrictions.</string>
			<key>pfm_name</key>
			<string>familyControlsEnabled</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Enable application access restrictions</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_allowed_file_types</key>
			<array>
				<string>com.apple.application-bundle</string>
			</array>
			<key>pfm_description</key>
			<string>The allow list of app item dictionaries.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A list of code signatures for applications that are allowed to run.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>familyControlsEnabled</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>whiteList</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Allowlisted application dictionary</string>
					<key>pfm_name</key>
					<string>whiteListItem</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The bundle ID of the app.</string>
							<key>pfm_description_reference</key>
							<string>Required. Bundle ID of application.</string>
							<key>pfm_name</key>
							<string>bundleID</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Bundle Identifier</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The name used for display purposes.</string>
							<key>pfm_description_reference</key>
							<string>Optional. Display name.</string>
							<key>pfm_name</key>
							<string>displayName</string>
							<key>pfm_title</key>
							<string>Display Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The identifier of the app. Obtain this value from the Security framework using SecCodeCopyDesignatedRequirement.</string>
							<key>pfm_description_reference</key>
							<string>Required. The designated requirement describing the code signature of this executable. This value is obtained from the Security.framework using SecCodeCopyDesignatedRequirement.</string>
							<key>pfm_name</key>
							<string>appID</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Code Requirement</string>
							<key>pfm_type</key>
							<string>data</string>
							<key>pfm_type_input</key>
							<string>string</string>
							<key>pfm_value_processor</key>
							<string>designatedCodeRequirement2Data</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>An array of nested helper applications.</string>
							<key>pfm_description_reference</key>
							<string>Optional. For applications that include nested helper applications, describes the signatures of embedded applications. The dictionary format is the same as for the whiteList key.</string>
							<key>pfm_hidden</key>
							<string>all</string>
							<key>pfm_name</key>
							<string>subApps</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>Bundle ID of application.</string>
									<key>pfm_description_reference</key>
									<string>Required. Bundle ID of application.</string>
									<key>pfm_name</key>
									<string>bundleID</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Bundle Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Display name of the application.</string>
									<key>pfm_description_reference</key>
									<string>Optional. Display name.</string>
									<key>pfm_name</key>
									<string>displayName</string>
									<key>pfm_title</key>
									<string>Display Name</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Required. The designated requirement describing the code signature of this executable. This value is obtained from the Security.framework using SecCodeCopyDesignatedRequirement.</string>
									<key>pfm_name</key>
									<string>appID</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Application Identifier</string>
									<key>pfm_type</key>
									<string>data</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The required signature for an unsigned binary</string>
									<key>pfm_description_reference</key>
									<string>Optional. Can be used to provide the required signature for an unsigned binary. Generate an ad-hoc signature of the unsigned binary and store the signature here.</string>
									<key>pfm_name</key>
									<string>detachedSignature</string>
									<key>pfm_title</key>
									<string>Detached Signature</string>
									<key>pfm_type</key>
									<string>data</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string></string>
									<key>pfm_description_reference</key>
									<string></string>
									<key>pfm_documentation_source</key>
									<string>Profile Manager</string>
									<key>pfm_name</key>
									<string>appStore</string>
									<key>pfm_title</key>
									<string>App Store</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Specifies whether this application information is to be included in the allowlist or not.</string>
									<key>pfm_description_reference</key>
									<string>Optional. Specifies whether this application information is to be included in the whiteList or not. Set to true to keep the application off the whiteList. It could still be allowed to launch via pathWhiteList, although this behavior is discouraged.
Default is false.</string>
									<key>pfm_name</key>
									<string>disabled</string>
									<key>pfm_title</key>
									<string>Disabled</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Sub Apps</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The signature for an unsigned binary.</string>
							<key>pfm_description_reference</key>
							<string>Optional. Can be used to provide the required signature for an unsigned binary. Generate an ad-hoc signature of the unsigned binary and store the signature here.</string>
							<key>pfm_hidden</key>
							<string>all</string>
							<key>pfm_name</key>
							<string>detachedSignature</string>
							<key>pfm_title</key>
							<string>Detached Signature</string>
							<key>pfm_type</key>
							<string>data</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_documentation_source</key>
							<string>Profile Manager</string>
							<key>pfm_name</key>
							<string>appStore</string>
							<key>pfm_title</key>
							<string>App Store</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>If 'true', this app isn't added to the allow list.</string>
							<key>pfm_description_reference</key>
							<string>Optional. Specifies whether this application information is to be included in the whiteList or not. Set to true to keep the application off the whiteList. It could still be allowed to launch via pathWhiteList, although this behavior is discouraged.
Default is false.</string>
							<key>pfm_name</key>
							<string>disabled</string>
							<key>pfm_title</key>
							<string>Disabled</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Allowlisted Item</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allowlisted Applications by Code Signature</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_value_import_processor</key>
			<string>com.apple.applicationaccess.new.whiteList</string>
		</dict>
		<dict>
			<key>pfm_allowed_file_types</key>
			<array>
				<string>public.folder</string>
			</array>
			<key>pfm_description</key>
			<string>The paths to apps in the allow list. This property is deprecated in macOS 10.15 and later.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Paths to allowed applications.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>familyControlsEnabled</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_macos_deprecated</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>pathWhiteList</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A path.</string>
					<key>pfm_name</key>
					<string>pathWhiteListItem</string>
					<key>pfm_title</key>
					<string>Folder Path</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>/Applications</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allowlisted Application Folders</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_value_import_processor</key>
			<string>public.folder</string>
		</dict>
		<dict>
			<key>pfm_allowed_file_types</key>
			<array>
				<string>public.folder</string>
			</array>
			<key>pfm_description</key>
			<string>The paths to apps in the deny list. This property is deprecated in macOS 10.15 and later.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Paths to disallowed applications.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>familyControlsEnabled</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_macos_deprecated</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>pathBlackList</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A path.</string>
					<key>pfm_name</key>
					<string>pathBlackListItem</string>
					<key>pfm_title</key>
					<string>Folder Path</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>/Users/Shared/Applications</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Denylisted Application Folders</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_value_import_processor</key>
			<string>public.folder</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Parental Controls: Application Access</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
