<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define which Setup Assistant items should be skipped.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/setupassistant</string>
	<key>pfm_domain</key>
	<string>com.apple.SetupAssistant.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_ios_min</key>
	<string>14.0</string>
	<key>pfm_last_modified</key>
	<date>2024-11-05T10:12:48Z</date>
	<key>pfm_macos_min</key>
	<string>10.12</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Setup Assistant</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.SetupAssistant.managed</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.SetupAssistant.managed</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array strings that describe the setup items to skip. SkipKeys provides a list of valid strings and their meanings. Available in iOS 14, macOS 15 and later.</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/skipkeys</string>
			<key>pfm_ios_min</key>
			<string>14.0</string>
			<key>pfm_macos_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>SkipSetupItems</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>SkipSetupItems</string>
					<key>pfm_range_list</key>
					<array>
						<string>Accessibility</string>
						<string>ActionButton</string>
						<string>Android</string>
						<string>Appearance</string>
						<string>AppleID</string>
						<string>AppStore</string>
						<string>Biometric</string>
						<string>CameraButton</string>
						<string>DeviceToDeviceMigration</string>
						<string>Diagnostics</string>
						<string>DisplayTone</string>
						<string>EnableLockdownMode</string>
						<string>FileVault</string>
						<string>HomeButtonSensitivity</string>
						<string>iCloudDiagnostics</string>
						<string>iCloudStorage</string>
						<string>iMessageAndFaceTime</string>
						<string>Intelligence</string>
						<string>Keyboard</string>
						<string>Location</string>
						<string>MessagingActivationUsingPhoneNumber</string>
						<string>OnBoarding</string>
						<string>Passcode</string>
						<string>Payment</string>
						<string>Privacy</string>
						<string>Restore</string>
						<string>RestoreCompleted</string>
						<string>Safety</string>
						<string>ScreenTime</string>
						<string>SIMSetup</string>
						<string>Siri</string>
						<string>SpokenLanguage</string>
						<string>SoftwareUpdate</string>
						<string>TermsOfAddress</string>
						<string>TOS</string>
						<string>UnlockWithWatch</string>
						<string>UpdateCompleted</string>
						<string>Wallpaper</string>
						<string>WatchMigration</string>
						<string>WebContentFiltering</string>
						<string>Welcome</string>
						<string>Zoom</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Accessibility</string>
						<string>Action Button</string>
						<string>Android</string>
						<string>Appearance</string>
						<string>Apple ID</string>
						<string>App Store</string>
						<string>Biometric</string>
						<string>Camera Button</string>
						<string>Device to Device Migration</string>
						<string>Diagnostics</string>
						<string>Display Tone</string>
						<string>Enable Lockdown Mode</string>
						<string>FileVault</string>
						<string>Home Button Sensitivity</string>
						<string>iCloud Diagnostics</string>
						<string>iCloud Documents and Desktop</string>
						<string>iMessage and FaceTime</string>
						<string>Intelligence</string>
						<string>Keyboard</string>
						<string>Location</string>
						<string>Messaging Activation Using Phone Number</string>
						<string>OnBoarding</string>
						<string>Passcode</string>
						<string>Payment</string>
						<string>Privacy</string>
						<string>Restore</string>
						<string>Restore Completed</string>
						<string>Safety</string>
						<string>ScreenTime</string>
						<string>SIM Setup</string>
						<string>Siri</string>
						<string>Spoken Language</string>
						<string>Software Update</string>
						<string>Terms of Address</string>
						<string>Terms of Service</string>
						<string>Unlock with Apple Watch</string>
						<string>Update Completed</string>
						<string>Wallpaper</string>
						<string>Watch Migration</string>
						<string>Web Content Filtering</string>
						<string>Welcome</string>
						<string>Zoom</string>
					</array>
					<key>pfm_title</key>
					<string>Items to Skip</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_unique</key>
					<true/>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Skip Setup Items</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system skips the Choose Your Look pane.</string>
			<key>pfm_macos_deprecated</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>10.14</string>
			<key>pfm_name</key>
			<string>SkipAppearance</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip Appearance window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system skips the Apple Account setup pane.</string>
			<key>pfm_macos_deprecated</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>SkipCloudSetup</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip iCloud</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system skips the iCloud Storage pane.</string>
			<key>pfm_macos_deprecated</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>10.13.4</string>
			<key>pfm_name</key>
			<string>SkipiCloudStorageSetup</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip iCloud Storage window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system skips the Privacy consent pane.</string>
			<key>pfm_macos_deprecated</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>10.13.4</string>
			<key>pfm_name</key>
			<string>SkipPrivacySetup</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip Privacy consent window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system skips the Siri setup pane.</string>
			<key>pfm_macos_deprecated</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>SkipSiriSetup</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip Siri</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system skips the True Tone Display pane.</string>
			<key>pfm_macos_deprecated</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>10.13.6</string>
			<key>pfm_name</key>
			<string>SkipTrueTone</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip True Tone Display window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system skips the Screen Time pane.</string>
			<key>pfm_macos_deprecated</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>SkipScreenTime</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip Screen Time window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system skips the Touch ID setup pane.</string>
			<key>pfm_macos_deprecated</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>SkipTouchIDSetup</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip TouchID</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system skips the Unlock With Apple Watch pane.</string>
			<key>pfm_macos_deprecated</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>SkipUnlockWithWatch</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip Unlock with Apple Watch</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system skips the Accessibility pane.</string>
			<key>pfm_macos_deprecated</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>SkipAccessibility</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip Accessibility</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system skips the Wallpaper selection window.</string>
			<key>pfm_macos_deprecated</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>14.1</string>
			<key>pfm_name</key>
			<string>SkipWallpaper</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip Wallpaper</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_supervised</key>
	<true/>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Setup Assistant</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>10</integer>
</dict>
</plist>
