<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Content Caching settings</string>
	<key>pfm_description_reference</key>
	<string>The Content Caching payload is designated by specifying com.apple.AssetCache.managed as the PayloadType. It configures the Content Caching service.</string>
	<key>pfm_domain</key>
	<string>com.apple.AssetCache.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2019-12-04T21:04:00Z</date>
	<key>pfm_macos_min</key>
	<string>10.13.4</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Content Caching settings</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Content Caching</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.AssetCache.managed</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier.</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.AssetCache.managed</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF).</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile.
The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Users can’t turn off the content caching service.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, automatically activate the Content Cache when possible and prevent disabling of the Content Cache. Default is false.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>AutoActivation</string>
			<key>pfm_title</key>
			<string>Automatically activate content caching</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Clients may take some time (hours, days) to react to changes to this setting; it does not have an immediate effect. At least one of the AllowPersonalCaching or AllowSharedCaching keys must be true.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, caches the userʼs iCloud data. Clients may take some time (hours, days) to react to changes to this setting; it does not have an immediate effect. Default is true. At least one of the AllowPersonalCaching or AllowSharedCaching keys must be true.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>AllowPersonalCaching</string>
			<key>pfm_title</key>
			<string>Caches the user’s iCloud data, such as photos and documents</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Clients may take some time (hours, days) to react to changes to this setting; it does not have an immediate effect. At least one of the AllowPersonalCaching or AllowSharedCaching keys must be true.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, caches non-iCloud content, such as apps and software updates. Clients may take some time (hours, days) to react to changes to this setting; it does not have an immediate effect. Default is true.
At least one of the AllowPersonalCaching or AllowSharedCaching keys must be true.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>AllowSharedCaching</string>
			<key>pfm_title</key>
			<string>Cache non-iCloud content, such as apps and software updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>The maximum number of bytes of disk space that will be used for the content cache. The value of zero allows unlimited space.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Defines the maximum number of bytes of disk space that will be used for the Content Cache. A CacheLimit of 0 means unlimited disk space. Default is 0.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>CacheLimit</string>
			<key>pfm_title</key>
			<string>Maximum Cache Size</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>TCP port on which the content caching service accepts requests for uploads or downloads. Set to 0 to pick a random port.</string>
			<key>pfm_description_reference</key>
			<string>Optional. The TCP port number on which the Content Cache accepts requests for uploads or downloads. Port set to 0 picks a random, available port. Default is 0.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>Port</string>
			<key>pfm_range_max</key>
			<integer>65535</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Port</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The path to the directory used to store cached content. Changing this setting manually does not automatically move cached content from the old to the new location. The path must be, or end with, /Library/Application Support/Apple/AssetCache/Data.</string>
			<key>pfm_description_reference</key>
			<string>Optional. The path to the directory used to store Cached Content. Changing this setting manually does not automatically move cached content from the old to the new location. To move content automatically, use the Sharing preferenceʼs Content Caching pane.
The value must be, or end with, /Library/Application Support/Apple/AssetCache/Data. A directory (and its intermediates) will be created for the given DataPath if it does not already exist. The directory will be owned by _assetcache:_assetcache and have mode 0750. Its immediate parent directory (.../Library/Application Support/Apple/AssetCache) will be owned by _assetcache:_assetcache and have mode 0755.
Default is /Library/Application Support/Apple/AssetCache/Data.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>DataPath</string>
			<key>pfm_title</key>
			<string>Data Path</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Library/Application Support/Apple/AssetCache/Data</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Share this computer's Internet connection and cached content with iOS devices connected using USB.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, tethered caching is disabled. Default is false.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>DenyTetheredCaching</string>
			<key>pfm_title</key>
			<string>Share Internet Connection</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_value_inverted</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Log the IP address and port number of clients that request content.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, the Content Cache will log the IP address and port number of the clients that request content. Default is false.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>LogClientIdentity</string>
			<key>pfm_title</key>
			<string>Log Client Details</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A list of the local IP addresses of other content caches from which this cache should download or upload content instead of downloading from or uploading to Apple directly.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Array of the local IP addresses of other Content Caches that this cache should download from or upload to, instead of downloading from or uploading to Apple directly. Invalid addresses and addresses of computers that are not Content Caches are ignored.
Parent caches that become unavailable are skipped. If all parent Content Caches become unavailable, the Content Cache will download from or upload to Apple directly until a parent Content Cache becomes available again.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>Parents</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>IPAddress</string>
					<key>pfm_title</key>
					<string>IP Address</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>10.0.0.1</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Parents IP Addresses</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>round-robin</string>
			<key>pfm_description</key>
			<string>The policy to use when choosing among more than one configured parent content cache.</string>
			<key>pfm_description_reference</key>
			<string>Optional. The policy to use when choosing among more than one configured parent Content Cache. With every policy, parent caches that are temporarily unavailable are skipped.
• first-available: Always use the first parent in the Parents list that is available. This is useful for designating permanent primary, secondary, and subsequent parents.
• url-path-hash: Hash the path part of the requested URL so that the same parent is always used for the same URL. This is useful for maximizing the size of the combined caches of the parents.
• random: Choose a parent at random. This is useful for load balancing.
• round-robin: Rotate through the parents in order. This is useful for load balancing.
• sticky-available: Starting with the first parent in the Parents list, always use the first parent that is available. Use that parent until it becomes unavailable, then advance to the next one. This is useful for designating floating primary, secondary, and subsequent parents.
Default is round-robin.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>ParentSelectionPolicy</string>
			<key>pfm_range_list</key>
			<array>
				<string>first-available</string>
				<string>random</string>
				<string>round-robin</string>
				<string>sticky-available</string>
				<string>url-path-hash</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>First available</string>
				<string>Random</string>
				<string>Round robin</string>
				<string>Sticky available</string>
				<string>Hash</string>
			</array>
			<key>pfm_title</key>
			<string>Parent Selection Policy</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A range of public IP addresses that the cloud servers should use for matching clients to Content Caches.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Array of dictionaries describing a range of public IP addresses that the cloud servers should use for matching clients to Content Caches.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>PeerLocalSubnetsOnly</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>PublicRanges</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>RangeDict</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>IPv4</string>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>type</string>
							<key>pfm_range_list</key>
							<array>
								<string>IPv4</string>
								<string>IPv6</string>
							</array>
							<key>pfm_title</key>
							<string>IP Address Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>first</string>
							<key>pfm_title</key>
							<string>Start IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>last</string>
							<key>pfm_title</key>
							<string>End IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>RangeDict</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Public Ranges</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Automatically remove content from the cache when the system needs disk space for other apps.</string>
			<key>pfm_name</key>
			<string>AllowCacheDelete</string>
			<key>pfm_title</key>
			<string>Allow Cache Delete</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Display Content Caching alerts as notifications.</string>
			<key>pfm_name</key>
			<string>DisplayAlerts</string>
			<key>pfm_title</key>
			<string>Display Content Caching Alerts</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Prevent the computer from sleeping while caching is on.</string>
			<key>pfm_name</key>
			<string>KeepAwake</string>
			<key>pfm_title</key>
			<string>Keep Awake for Content Caching</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Client Restrictions</string>
				<string>Peer Restrictions</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Client Restrictions</key>
				<array>
					<string>LocalSubnetsOnly</string>
					<string>ListenRangesOnly</string>
					<string>ListenRanges</string>
				</array>
				<key>Peer Restrictions</key>
				<array>
					<string>PeerLocalSubnetsOnly</string>
					<string>PeerFilterRanges</string>
					<string>PeerListenRanges</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Content Cache offers content to clients only on the same immediate local network.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, the Content Cache offers content to clients only on the same immediate local network as the Content Cache. No content would be offered to clients on other networks reachable by the Content Cache. Default is true.
If LocalSubnetsOnly is set to true, ListenRanges will be ignored.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>LocalSubnetsOnly</string>
			<key>pfm_title</key>
			<string>Restrict Clients To Local Network</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Provide content only to the clients specified by the listen ranges.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, the Content Cache provides content only to clients in the ranges specified by the ListenRanges key. To use the ListenRangesOnly key, the ListenRanges key must also be specified. Default is false.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>LocalSubnetsOnly</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>ListenRanges</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ListenRangesOnly</string>
			<key>pfm_title</key>
			<string>Restrict To Client Listen Ranges</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A range of IPv4 and IPv6 addresses to restrict clients to.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Array of dictionaries describing a range of client IP addresses to serve.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>LocalSubnetsOnly</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ListenRanges</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>RangeDict</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>IPv4</string>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_description_reference</key>
							<string>Optional. The IP address type (IPv4 or IPv6). Default is IPv4.</string>
							<key>pfm_name</key>
							<string>type</string>
							<key>pfm_range_list</key>
							<array>
								<string>IPv4</string>
								<string>IPv6</string>
							</array>
							<key>pfm_title</key>
							<string>IP Address Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_description_reference</key>
							<string>Required. First IP address in the range.</string>
							<key>pfm_name</key>
							<string>first</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Start IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>10.0.0.0</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_description_reference</key>
							<string>Required. Last IP address in the range.</string>
							<key>pfm_name</key>
							<string>last</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>End IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>10.255.255.255</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>RangeDict</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Client Listen Ranges</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Content Cache will only peer with other Content Caches on the same immediate local network, rather than with Content Caches that use the same public IP address as the device.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, the Content Cache will only peer with other Content Caches on the same immediate local network, rather than with Content Caches that use the same public IP address as the device. When PeerLocalSubnetsOnly is true, it overrides the configuration of PeerFilterRanges and PeerListenRanges. If the network changes, the local network peering restrictions update appropriately.
If set to false, the Content Cache defers to PeerFilterRanges and PeerListenRanges for configuring the peering restrictions.
Default is true.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>PeerLocalSubnetsOnly</string>
			<key>pfm_title</key>
			<string>Restrict Peers To Local Network</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A range of peer IP addresses that the Content Cache will use to filter its list of peers to query for content.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Array of dictionaries describing a range of peer IP addresses that the Content Cache will use to filter its list of peers to query for content. The Content Cache only queries peers that are in the PeerFilterRanges. When PeerFilterRanges is an empty array the Content Cache will not query any peers. Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>PeerLocalSubnetsOnly</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>PeerFilterRanges</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>RangeDict</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>IPv4</string>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_description_reference</key>
							<string>Optional. The IP address type (IPv4 or IPv6). Default is IPv4.</string>
							<key>pfm_name</key>
							<string>type</string>
							<key>pfm_range_list</key>
							<array>
								<string>IPv4</string>
								<string>IPv6</string>
							</array>
							<key>pfm_title</key>
							<string>IP Address Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_description_reference</key>
							<string>Required. First IP address in the range.</string>
							<key>pfm_name</key>
							<string>first</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Start IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>10.0.0.0</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_description_reference</key>
							<string>Required. Last IP address in the range.</string>
							<key>pfm_name</key>
							<string>last</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>End IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>10.255.255.255</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>RangeDict</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Peer Filter Ranges</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A range of peer IP addresses the Content Cache will respond to peer cache queries from.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Array of dictionaries describing a range of peer IP addresses the Content Cache will respond to peer cache queries from. When PeerListenRanges is an empty array, the Content Cache will respond with an error to all cache queries. Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>PeerLocalSubnetsOnly</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>PeerListenRanges</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>RangeDict</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>IPv4</string>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_description_reference</key>
							<string>Optional. The IP address type (IPv4 or IPv6). Default is IPv4.</string>
							<key>pfm_name</key>
							<string>type</string>
							<key>pfm_range_list</key>
							<array>
								<string>IPv4</string>
								<string>IPv6</string>
							</array>
							<key>pfm_title</key>
							<string>IP Address Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_description_reference</key>
							<string>Required. First IP address in the range.</string>
							<key>pfm_name</key>
							<string>first</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Start IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>10.0.0.0</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_description_reference</key>
							<string>Required. Last IP address in the range.</string>
							<key>pfm_name</key>
							<string>last</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>End IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>10.255.255.255</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>RangeDict</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Peer Listen Ranges</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>30</integer>
			<key>pfm_description_reference</key>
			<string>When content is purged from the content cache because it's low on disk space, and the purged content was added to the content cache less than this many days ago, you receive a low space alert.</string>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>AgeForLowSpaceAlert</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_title</key>
			<string>Low Space Alert</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Content Caching</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>
