<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Use this section to configure restrictions on a device.</string>
		<key>pfm_domain</key>
		<string>com.apple.applicationaccess</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_imazing_category</key>
		<string>system</string>
		<key>pfm_imazing_documentation_url</key>
		<string>https://developer.apple.com/documentation/devicemanagement/restrictions</string>
		<key>pfm_imazing_format_version</key>
		<integer>1</integer>
		<key>pfm_imazing_groups</key>
		<dict>
			<key>AirDrop</key>
			<array>
				<string>allowAirDrop</string>
				<string>forceAirDropUnmanaged</string>
			</array>
			<key>AirPlay</key>
			<array>
				<string>allowAirPlayIncomingRequests</string>
				<string>forceAirPlayIncomingRequestsPairingPassword</string>
				<string>forceAirPlayOutgoingRequestsPairingPassword</string>
			</array>
			<key>AirPrint</key>
			<array>
				<string>allowAirPrint</string>
				<string>allowAirPrintCredentialsStorage</string>
				<string>allowAirPrintiBeaconDiscovery</string>
				<string>forceAirPrintTrustedTLSRequirement</string>
			</array>
			<key>Apps</key>
			<array>
				<string>allowAddingGameCenterFriends</string>
				<string>allowAppInstallation</string>
				<string>allowAppRemoval</string>
				<string>allowAppClips</string>
				<string>allowSystemAppRemoval</string>
				<string>allowInAppPurchases</string>
				<string>allowAutomaticAppDownloads</string>
				<string>allowRemoteAppPairing</string>
				<string>allowBookstore</string>
				<string>allowChat</string>
				<string>allowGameCenter</string>
				<string>allowMultiplayerGaming</string>
				<string>allowMusicService</string>
				<string>allowNews</string>
				<string>allowPodcasts</string>
				<string>allowRadioService</string>
				<string>allowSafari</string>
				<string>allowUIAppInstallation</string>
				<string>allowYouTube</string>
				<string>allowiTunes</string>
				<string>safariAcceptCookies</string>
				<string>safariAllowAutoFill</string>
				<string>safariAllowJavaScript</string>
				<string>safariAllowPopups</string>
				<string>safariForceFraudWarning</string>
				<string>allowDeprecatedWebKitTLS</string>
				<string>blockedAppBundleIDs</string>
				<string>allowListedAppBundleIDs</string>
				<string>blacklistedAppBundleIDs</string>
				<string>whitelistedAppBundleIDs</string>
			</array>
			<key>Classroom</key>
			<array>
				<string>forceClassroomAutomaticallyJoinClasses</string>
				<string>forceClassroomRequestPermissionToLeaveClasses</string>
				<string>allowRemoteScreenObservation</string>
				<string>forceClassroomUnpromptedScreenObservation</string>
				<string>forceClassroomUnpromptedAppAndDeviceLock</string>
				<string>forceUnpromptedManagedClassroomScreenObservation</string>
			</array>
			<key>General</key>
			<array>
				<string>allowCamera</string>
				<string>allowAccountModification</string>
				<string>allowActivityContinuation</string>
				<string>allowAppCellularDataModification</string>
				<string>allowAutoCorrection</string>
				<string>allowContinuousPathKeyboard</string>
				<string>allowBluetoothModification</string>
				<string>allowCellularPlanModification</string>
				<string>allowContentCaching</string>
				<string>allowDefinitionLookup</string>
				<string>allowDeviceNameModification</string>
				<string>allowDiagnosticSubmission</string>
				<string>allowDiagnosticSubmissionModification</string>
				<string>allowDictation</string>
				<string>forceOnDeviceOnlyDictation</string>
				<string>forceOnDeviceOnlyTranslation</string>
				<string>allowEnablingRestrictions</string>
				<string>allowEnterpriseAppTrust</string>
				<string>allowEraseContentAndSettings</string>
				<string>allowESIMModification</string>
				<string>allowFindMyFriendsModification</string>
				<string>allowFindMyDevice</string>
				<string>allowFindMyFriends</string>
				<string>allowGlobalBackgroundFetchWhenRoaming</string>
				<string>allowHostPairing</string>
				<string>allowiTunesFileSharing</string>
				<string>allowUnpairedExternalBootToRecovery</string>
				<string>allowKeyboardShortcuts</string>
				<string>allowLockScreenControlCenter</string>
				<string>allowLockScreenNotificationsView</string>
				<string>allowLockScreenTodayView</string>
				<string>allowNotificationsModification</string>
				<string>allowNFC</string>
				<string>allowOTAPKIUpdates</string>
				<string>allowOpenFromManagedToUnmanaged</string>
				<string>allowOpenFromUnmanagedToManaged</string>
				<string>allowUnmanagedToReadManagedContacts</string>
				<string>allowManagedToWriteUnmanagedContacts</string>
				<string>requireManagedPasteboard</string>
				<string>allowPairedWatch</string>
				<string>allowPassbookWhileLocked</string>
				<string>allowPersonalHotspotModification</string>
				<string>allowPredictiveKeyboard</string>
				<string>allowProximitySetupToNewDevice</string>
				<string>allowScreenShot</string>
				<string>allowSharedDeviceTemporarySession</string>
				<string>allowSpellCheck</string>
				<string>allowSpotlightInternetResults</string>
				<string>allowUIConfigurationProfileInstallation</string>
				<string>allowUSBRestrictedMode</string>
				<string>allowUntrustedTLSPrompt</string>
				<string>allowVPNCreation</string>
				<string>allowVideoConferencing</string>
				<string>allowVoiceDialing</string>
				<string>allowWallpaperModification</string>
				<string>forceAuthenticationBeforeAutoFill</string>
				<string>forceAutomaticDateAndTime</string>
				<string>forceEncryptedBackup</string>
				<string>forceITunesStorePasswordEntry</string>
				<string>forceLimitAdTracking</string>
				<string>allowApplePersonalizedAdvertising</string>
				<string>allowMailPrivacyProtection</string>
				<string>allowUniversalControl</string>
				<string>forceWatchWristDetection</string>
				<string>forceWiFiPowerOn</string>
				<string>forceWiFiToAllowedNetworksOnly</string>
				<string>forceWiFiWhitelisting</string>
			</array>
			<key>iCloud</key>
			<array>
				<string>allowCloudAddressBook</string>
				<string>allowCloudBookmarks</string>
				<string>allowCloudBTMM</string>
				<string>allowCloudBackup</string>
				<string>allowCloudCalendar</string>
				<string>allowCloudDesktopAndDocuments</string>
				<string>allowCloudDocumentSync</string>
				<string>allowCloudFMM</string>
				<string>allowCloudKeychainSync</string>
				<string>allowCloudMail</string>
				<string>allowCloudNotes</string>
				<string>allowCloudPhotoLibrary</string>
				<string>allowCloudReminders</string>
				<string>allowEnterpriseBookBackup</string>
				<string>allowEnterpriseBookMetadataSync</string>
				<string>allowCloudPrivateRelay</string>
				<string>allowManagedAppsCloudSync</string>
				<string>allowPhotoStream</string>
				<string>allowSharedStream</string>
			</array>
			<key>Media</key>
			<array>
				<string>ratingApps</string>
				<string>ratingMovies</string>
				<string>ratingRegion</string>
				<string>ratingTVShows</string>
				<string>allowBookstoreErotica</string>
				<string>allowExplicitContent</string>
				<string>allowFilesUSBDriveAccess</string>
				<string>allowFilesNetworkDriveAccess</string>
			</array>
			<key>Passwords / Unlock</key>
			<array>
				<string>allowFingerprintForUnlock</string>
				<string>allowFingerprintModification</string>
				<string>enforcedFingerprintTimeout</string>
				<string>allowPasswordAutoFill</string>
				<string>allowAutoUnlock</string>
				<string>allowPasscodeModification</string>
				<string>allowPasswordProximityRequests</string>
				<string>allowPasswordSharing</string>
				<string>allowAutomaticScreenSaver</string>
			</array>
			<key>Siri</key>
			<array>
				<string>allowAssistant</string>
				<string>allowAssistantWhileLocked</string>
				<string>allowAssistantUserGeneratedContent</string>
				<string>allowSiriServerLogging</string>
				<string>forceAssistantProfanityFilter</string>
			</array>
			<key>Updates</key>
			<array>
				<string>forceDelayedSoftwareUpdates</string>
				<string>forceDelayedMajorSoftwareUpdates</string>
				<string>forceDelayedAppSoftwareUpdates</string>
				<string>enforcedSoftwareUpdateDelay</string>
				<string>enforcedSoftwareUpdateMajorOSDeferredInstallDelay</string>
				<string>enforcedSoftwareUpdateMinorOSDeferredInstallDelay</string>
				<string>enforcedSoftwareUpdateNonOSDeferredInstallDelay</string>
				<string>allowRapidSecurityResponseInstallation</string>
				<string>allowRapidSecurityResponseRemoval</string>
			</array>
		</dict>
		<key>pfm_imazing_groups_order</key>
		<array>
			<string>General</string>
			<string>AirDrop</string>
			<string>AirPlay</string>
			<string>AirPrint</string>
			<string>Apps</string>
			<string>Classroom</string>
			<string>iCloud</string>
			<string>Media</string>
			<string>Passwords / Unlock</string>
			<string>Siri</string>
			<string>Updates</string>
		</array>
		<key>pfm_imazing_icon</key>
		<data>iVBORw0KGgoAAAANSUhEUgAAAQAAAAEACAQAAAD2e2DtAAAHx0lEQVR42u3dz2tcVRjG8SfJBNJGYqCtNSVJYxDTSurCBiOo0QqtUEEIVrrpvhvt3yG6ki7ssi1I3Uh2LrowGKU00mqIIkhasGnaohVBsVqodVxIY3PunclkMve85877/czqToZ73nvOMzP3x+RcCQAAAAAAAAAAAAAAAAAAAAAAAAAAAAAApK7DuoDoKtqpcQ1rpwY0qCGNSPpR17WiW/pJy/pOP+lv6yLj8ROA7dqnKb2pfQ289lt9ojl9q1+si0Yr9Glal1Rt4nFJ0+qzLh/Nq+iQzjc19A8/zuuQKtabgo2q6K1ND/3Dj7cIQXlUdKSlg//gcYQQlMGhQgb/weOQ9eahnj6dKXT4q6rqTDvtGLbXYeABfdbAq07qiq7ppm7rN93RPUnd6tWj2qFd2q0n9U4D63hVs9Ybi7V6dGqdd+6K3tZIA5Hv0Ije1so6azulHutNxv+26Wqdwbqgo9qx4XXu0FFdqLPWq9pmvdn4zxN1hmlWY5ta95hm66z9CetNhzRRc3iWNdmSFia1XLONCevN9+5wzaE53MJd3I667cBMrXf/CXW3vK1uneBTIC21vvsPFtbiQfYF0rGtxmA8VWirT9VolSOCyHpyD/zm1V94y/2azz0o5LxAVHmnfT5QV5S2u/RB7qkhRHMgd/hjyovAAetu8aIv98M/zrv/ga7cL4I2ukyUsrwrfv3Rq+jPqeKMddd4kHe9v9g9/1ryjgj4vUDBKlGP+9eTd16AXw0VKvtjrxOm9WTPDh6x7qJ2lvf+b/1J343oLvdnQKd1ARs0nXnmdd0zreieXm+gSrRE9v2/nMCP2jpyLhaX6DOgTLL7/6253r9ZkxwLxBH+l086P8ycDSo7b11QO8qe/9vcj71aaYxzgsWbDrr4gnVBa4Q/H2VHsOXC//A9al3QGkeD6i5ZF9Rutmc+ZDf+Q+8i7cjUt926pEaU5zxAOLHDDd22LmmN27qxTsVJKk8ApoLld60LyggrmmpqLahhMfiAHbEuKGMkqHDRuqBG2J9Ha0wlc8K3U1XrogId+id4pjv96abK8hWwM1g+mdzwS1WdXKfqBJUlAOPB8hXrgnKFVY03tZaoyhKA4WD5mnVBucKqhptaS1RlCUD4YXrTuqBcYVV8BbTMQLCc1jmAWlUNNLWWqMoSgMFg+TfrgnKFVQ02tZaoyhKAoWD5jnVBucKqhppaC3L8GpxkSfP8RUdQ5a/WBTVScjmER/2p1l2WOleV5SsABSEAzhEA5wiAcwTAOQLgHAFwjgA4RwCcIwDOEQDnCIBzBMA5AuAcAXCOADhHAJwjAM4RAOcIgHMEwDkC4BwBcI4AOEcAnCMAzqUyq3WXHtvQxK+vWBfcgjp/0M+6b12g9f+ubdVzelHTeta6I4x8rRl9qa/0p1UBtgGY1EXT9tPxvOZtGrbbB+jRewz/qot6z+bWs1afAPuZTDnHhC7HbtImAAOJTvJkb5duxW3Q5ivgY5NWyyB6z1gE4BjTKNc0pWNxG4z/FTCo6znPLmpGc5m5dttZp6Y0rWdy/jKkFeviipS95/aSRq2LMjOqpZz7oLexrszmnnZ+OrpTpzN90sYe5+5aGX2WAYj97tsbLB/U75ErSM/vhnc/jx6Al4Ll7+02PSGOeuEb7rGbo2L3FRD7MLB0M2lGsrZfIvaK7z1wEADvCIBzBMA5AuAcAXCOADhHAJwjAM4RAOcIgHMEwDkC4BwBcI4AOEcAnCMAzhEA5wiAcwTAOQLgHAFwjgA4RwCcIwDOEQDnvP9v3iPaLema/rAuxIt0pkJ4RWd1f7WO+zprOv1sKr0SeUOtNrVXH2YqqaqqD9WbRL+0sRQC8ELu4D94vJBAv7Qx+wAM1x3+qqoaNu+XNmYdgA4trBuABYNZCwhAJMfXHf6qqjpu3C8R+ZohpLfhw71HdCdqZcwQEsXuAl5Zcr4CsL+AV5acrwC8VsArS87XPsBGdq8sK2MfoCCfFvDKkosdANt5AecKeGXJxQ6A7UmOhQJeWXK+9gG2Nnx03xv5Tn7sA0TxZ4Pn+I7b3cgxNl+fAFKP/mrgVVt0N3JdfAJEcreBOxSPRR9+R6wvBknSnroXgvYk0C9tLIUASEM6lzv45zSURL+0sTQCIEl7M7Xs3fxKW9QvEXnbCSxHLewEIhYC4BwBcI4AOEcAnCMAzhEA5wiAcwTAOQLgnOcAfFRnCQVJ52KQNL6mkvGE+qWNpRQA6Y3VOt5Iql8i8nw1UEpnjiCzq4HeA5AKLgfDBgFwjgA4RwCcIwDOEQDnCIBzBMA5AuAcAXCOADhHAJwjAM4RAOcIgHMEwDkC4BwBcI4AOEcAnCMAzhEA5wiAcwTAOQLgHAFwLnYAFoLlinUHJMGwF2IHYCZYfsxu0xNi2AuxA/BFsPy03aYnxFEvPJ6ZIaDPuiRzfYnNmlCorszGnna+I9qp054CIM1nNndJo9ZFmRnVUqY/5mMWEH+ChkFdz3l2UTOa0z/Rq7HTqSlN65mcvwxpxbq4Yh2re88e749jcQfDZoqWzzVl0m765vRy3AZtAjCgmybtpm+XbsVt0GYP/JYmTNpN3UTs4be7FnBZW/S+Udtpel9bdDl+s7bTtE3qomn76Xg+7sEfAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAok38BHG7EQkYMJJ8AAAAASUVORK5CYII=</data>
		<key>pfm_imazing_icon_is_template</key>
		<true />
		<key>pfm_imazing_last_modification</key>
		<date>2022-11-17T01:55:17Z</date>
		<key>pfm_imazing_note</key>
		<string>You can specify additional restrictions, including maximum allowed content ratings, by creating a profile using Apple Configurator 2 or Profile Manager.</string>
		<key>pfm_imazing_platforms</key>
		<array>
			<string>iOS</string>
			<string>macOS</string>
			<string>tvOS</string>
		</array>
		<key>pfm_imazing_single_payload</key>
		<true />
		<key>pfm_imazing_sort_priority</key>
		<integer>10</integer>
		<key>pfm_imazing_version</key>
		<integer>1</integer>
		<key>pfm_last_modified</key>
		<date>2022-11-23T09:20:43Z</date>
		<key>pfm_subkeys</key>
		<array>
			<dict>
				<key>pfm_default</key>
				<string>Configures restrictions</string>
				<key>pfm_description</key>
				<string>Description of the payload.</string>
				<key>pfm_imazing_user_visible</key>
				<false />
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>Restrictions</string>
				<key>pfm_description</key>
				<string>Name of the payload.</string>
				<key>pfm_imazing_user_visible</key>
				<false />
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>com.apple.applicationaccess</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier.</string>
				<key>pfm_imazing_user_visible</key>
				<false />
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>com.apple.applicationaccess</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string.</string>
				<key>pfm_imazing_user_visible</key>
				<false />
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string />
				<key>pfm_description</key>
				<string>Unique identifier for the payload. (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
				<key>pfm_imazing_user_visible</key>
				<false />
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_imazing_user_visible</key>
				<false />
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_user_visible</key>
				<false />
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>10.11</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>1</integer>
				<key>pfm_name</key>
				<string>allowCamera</string>
				<key>pfm_title</key>
				<string>Allow Camera</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If Allow use of Camera is set to 'false', this will override this preference if set to 'true'.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowCamera</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>2</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowVideoConferencing</string>
				<key>pfm_title</key>
				<string>Allow FaceTime</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>5.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>24</integer>
				<key>pfm_name</key>
				<string>allowCloudBackup</string>
				<key>pfm_title</key>
				<string>Allow iCloud backup</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>9.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>31</integer>
				<key>pfm_name</key>
				<string>allowCloudPhotoLibrary</string>
				<key>pfm_title</key>
				<string>Allow iCloud Photo Library</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Disallowing can cause data loss.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>5.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>32</integer>
				<key>pfm_name</key>
				<string>allowPhotoStream</string>
				<key>pfm_title</key>
				<string>Allow My Photo Stream</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>6.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>30</integer>
				<key>pfm_name</key>
				<string>allowSharedStream</string>
				<key>pfm_title</key>
				<string>Allow iCloud Photo Sharing</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>12.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.14</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>69</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowPasswordAutoFill</string>
				<key>pfm_title</key>
				<string>Allow password autofill</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>14.5</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>72</integer>
				<key>pfm_name</key>
				<string>allowAutoUnlock</string>
				<key>pfm_title</key>
				<string>Allow Apple Watch to auto unlock device</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12.4</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>68</integer>
				<key>pfm_name</key>
				<string>allowFingerprintForUnlock</string>
				<key>pfm_title</key>
				<string>Allow Touch ID / Face ID to unlock device</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>6.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>16</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowBookstore</string>
				<key>pfm_title</key>
				<string>Allow iBooks Store</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>6.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>7</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowChat</string>
				<key>pfm_title</key>
				<string>Allow iMessage</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>200</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowiTunes</string>
				<key>pfm_title</key>
				<string>Allow iTunes Store</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>9.3</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>8</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowMusicService</string>
				<key>pfm_title</key>
				<string>Allow Apple Music</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>9.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>202</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowNews</string>
				<key>pfm_title</key>
				<string>Allow News</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>8.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>203</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowPodcasts</string>
				<key>pfm_title</key>
				<string>Allow podcasts</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>9.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>9</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowRadioService</string>
				<key>pfm_title</key>
				<string>Allow Radio</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>5.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.11</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>25</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowCloudDocumentSync</string>
				<key>pfm_title</key>
				<string>Allow iCloud Drive</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Allow synchronization of Keychain with iCloud</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>26</integer>
				<key>pfm_name</key>
				<string>allowCloudKeychainSync</string>
				<key>pfm_title</key>
				<string>Allow iCloud Keychain sync</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>8.1.3</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.11.2</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>87</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowDefinitionLookup</string>
				<key>pfm_title</key>
				<string>Allow definition lookup</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string>Allow websites that use TLS 1.0 and TLS 1.1 to be accessed using Safari.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowSafari</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_documentation_url</key>
				<string>https://docs.jamf.com/10.20.0/jamf-pro/release-notes/What%27s_New.html</string>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>13.4</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.15.4</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>211</integer>
				<key>pfm_name</key>
				<string>allowDeprecatedWebKitTLS</string>
				<key>pfm_title</key>
				<string>Allow accessing websites using TLS 1.0 and 1.1</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>11.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>78</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowAirPrint</string>
				<key>pfm_title</key>
				<string>Allow AirPrint</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowAirPrint</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>11.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.13.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>79</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowAirPrintiBeaconDiscovery</string>
				<key>pfm_title</key>
				<string>Allow discovery of AirPrint printers using iBeacons</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string />
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowAirPrint</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>11.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.13.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>81</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>forceAirPrintTrustedTLSRequirement</string>
				<key>pfm_title</key>
				<string>Disallow AirPrint to destinations with untrusted certificates</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>10.14.4</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>3</integer>
				<key>pfm_name</key>
				<string>allowScreenShot</string>
				<key>pfm_title</key>
				<string>Allow screenshots and screen recording</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If 'Allow Screenshots and Screen Recording' is set to 'false', it also overrides this preference and prevents the Classroom app from observing remote screens.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>9.3</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.14.4</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>4</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowRemoteScreenObservation</string>
				<key>pfm_title</key>
				<string>Allow AirPlay and View Screen by Classroom app</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string>If Allow screenshots and screen recording is set to 'false' or Allow AirPlay and View Screen by Classroom app, they also override this preference and prevents the Classroom app from unprompted remote AirPlay and view screens.

Additionally, if set to true and ScreenObservationPermissionModificationAllowed is also true in the Education payload, a student enrolled in a managed course via the Classroom app will automatically give permission to that course's teacher's requests to observe the student's screen without prompting the student.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowRemoteScreenObservation</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>11.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.14.4</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>5</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>forceClassroomUnpromptedScreenObservation</string>
				<key>pfm_title</key>
				<string>Allow Classroom app to perform AirPlay and View Screen without prompting</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string>Deprecated in iOS 11. Use forceClassroomUnpromptedScreenObservation instead.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowRemoteScreenObservation</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_deprecation</key>
				<string>11.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>5</integer>
				<key>pfm_name</key>
				<string>forceUnpromptedManagedClassroomScreenObservation</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>10</integer>
				<key>pfm_name</key>
				<string>allowVoiceDialing</string>
				<key>pfm_title</key>
				<string>Allow voice dialing while the device is locked</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>11</integer>
				<key>pfm_name</key>
				<string>allowAssistant</string>
				<key>pfm_title</key>
				<string>Allow Siri</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If Allow Siri is set to 'false', it also overrides this preference. This preference is ignored if the device does not have a passcode set.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowAssistant</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>5.1</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>12</integer>
				<key>pfm_name</key>
				<string>allowAssistantWhileLocked</string>
				<key>pfm_title</key>
				<string>Allow Siri when device is locked</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>When true, forces the use of the profanity filter assistant.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowAssistant</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>13</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>forceAssistantProfanityFilter</string>
				<key>pfm_title</key>
				<string>Enable Siri profanity filter</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If Allow Siri is set to 'false', it also overrides this preference. This preference is ignored if the device does not have a passcode set.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowAssistant</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>14</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowAssistantUserGeneratedContent</string>
				<key>pfm_title</key>
				<string>Show user-generated content in Siri</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Allow server-side logging of Siri commands</string>
				<key>pfm_imazing_documentation_url</key>
				<string>https://docs.jamf.com/10.11.0/jamf-pro/release-notes/What's_New.html</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>12.2</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>14</integer>
				<key>pfm_name</key>
				<string>allowSiriServerLogging</string>
				<key>pfm_title</key>
				<string>Allow server-side logging of Siri commands</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>8.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.11</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>15</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowSpotlightInternetResults</string>
				<key>pfm_title</key>
				<string>Allow Siri Suggestions</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>17</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowAppInstallation</string>
				<key>pfm_title</key>
				<string>Allow Installing Apps</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If Allow installing apps is set to 'false', this will override this preference.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowAppInstallation</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>9.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>18</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowUIAppInstallation</string>
				<key>pfm_title</key>
				<string>Allow installing apps using App Store</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If Allow installing apps is set to 'false', this will override this preference.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowAppInstallation</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>9.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>19</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowAutomaticAppDownloads</string>
				<key>pfm_title</key>
				<string>Allow automatic app downloads</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Deprecated on unsupervised devices.</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>20</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowAppRemoval</string>
				<key>pfm_title</key>
				<string>Allow removing apps</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>14.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>190</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowAppClips</string>
				<key>pfm_title</key>
				<string>Allow App Clips</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>11.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>21</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowSystemAppRemoval</string>
				<key>pfm_title</key>
				<string>Allow removing system apps</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>When false, prohibits in-app purchasing.</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>22</integer>
				<key>pfm_name</key>
				<string>allowInAppPurchases</string>
				<key>pfm_title</key>
				<string>Allow in app purchases</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>5.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>23</integer>
				<key>pfm_name</key>
				<string>forceITunesStorePasswordEntry</string>
				<key>pfm_title</key>
				<string>Require iTunes Store password for all purchases</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>27</integer>
				<key>pfm_name</key>
				<string>allowManagedAppsCloudSync</string>
				<key>pfm_title</key>
				<string>Allow managed apps to store data in iCloud</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>28</integer>
				<key>pfm_name</key>
				<string>allowEnterpriseBookBackup</string>
				<key>pfm_title</key>
				<string>Allow backup of enterprise books</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>29</integer>
				<key>pfm_name</key>
				<string>allowEnterpriseBookMetadataSync</string>
				<key>pfm_title</key>
				<string>Allow notes and highlights sync for enterprise books</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If set to false, prevents the use of iCloud Private Relay.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>15.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>12.0</string>
				<key>pfm_imazing_tvos_introduction</key>
				<string>15.0</string>
				<key>pfm_name</key>
				<string>allowCloudPrivateRelay</string>
				<key>pfm_title</key>
				<string>Allow iCloud Private Relay</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>33</integer>
				<key>pfm_name</key>
				<string>allowGlobalBackgroundFetchWhenRoaming</string>
				<key>pfm_title</key>
				<string>Allow automatic sync while roaming</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>34</integer>
				<key>pfm_name</key>
				<string>forceEncryptedBackup</string>
				<key>pfm_title</key>
				<string>Force encrypted backups</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>12.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>36</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowEraseContentAndSettings</string>
				<key>pfm_title</key>
				<string>Allow Erase All Content and Settings</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>5.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>37</integer>
				<key>pfm_name</key>
				<string>allowUntrustedTLSPrompt</string>
				<key>pfm_title</key>
				<string>Allow users to accept untrusted TLS certificates</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>9.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>39</integer>
				<key>pfm_name</key>
				<string>allowEnterpriseAppTrust</string>
				<key>pfm_title</key>
				<string>Allow trusting new enterprise app authors</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Allows public-key-infrastructure updates to be carried out over the air. Does not disable OCL and OSCP checks</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>38</integer>
				<key>pfm_name</key>
				<string>allowOTAPKIUpdates</string>
				<key>pfm_title</key>
				<string>Allows over-the-air PKI updates</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>6.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>13.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>40</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowUIConfigurationProfileInstallation</string>
				<key>pfm_title</key>
				<string>Allow user installation of configuration profiles</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>11.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>41</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowVPNCreation</string>
				<key>pfm_title</key>
				<string>Allow adding VPN configurations</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>12.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>42</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_imazing_tvos_introduction</key>
				<string>12.2</string>
				<key>pfm_name</key>
				<string>forceAutomaticDateAndTime</string>
				<key>pfm_title</key>
				<string>Force automatic date and time</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>11.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.14.4</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>43</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>forceClassroomUnpromptedAppAndDeviceLock</string>
				<key>pfm_title</key>
				<string>Allow Classroom to lock apps or the device without prompting</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>11.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.14.4</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>44</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>forceClassroomAutomaticallyJoinClasses</string>
				<key>pfm_title</key>
				<string>Automatically join Classroom classes without prompting</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>11.3</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.14.4</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>45</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>forceClassroomRequestPermissionToLeaveClasses</string>
				<key>pfm_title</key>
				<string>Require teacher permission to leave Classroom app unmanaged classes</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>49</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowAccountModification</string>
				<key>pfm_title</key>
				<string>Allow modifying account settings</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>10.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>13.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>47</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowBluetoothModification</string>
				<key>pfm_title</key>
				<string>Allow modifying Bluetooth settings</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>48</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowAppCellularDataModification</string>
				<key>pfm_title</key>
				<string>Allow modifying celluar data app settings</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>11.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>49</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowCellularPlanModification</string>
				<key>pfm_title</key>
				<string>Allow modifying celluar plan settings</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>12.1</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>50</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowESIMModification</string>
				<key>pfm_title</key>
				<string>Allow modifying eSIM settings</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>52</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowFindMyFriendsModification</string>
				<key>pfm_title</key>
				<string>Allow modifying Find My Friends settings</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>9.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>53</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowNotificationsModification</string>
				<key>pfm_title</key>
				<string>Allow modifying notification settings</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If set to false, disables Near-field Communication functionality.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>14.2</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_name</key>
				<string>allowNFC</string>
				<key>pfm_title</key>
				<string>Allow NFC</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>9.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>54</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowPasscodeModification</string>
				<key>pfm_title</key>
				<string>Allow modifying passcode</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If Allow modifying passcode is set to 'false', this will override this preference if set to 'true'.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowPasscodeModification</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>9.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>55</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowFingerprintModification</string>
				<key>pfm_title</key>
				<string>Allow modifying Touch ID / Face ID</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If set to 'false', disables the "Enable ScreenTime" option in the ScreenTime UI in Settings and disables ScreenTime if already enabled.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>8.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>56</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowEnablingRestrictions</string>
				<key>pfm_title</key>
				<string>Allow Screen Time</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>9.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>57</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowWallpaperModification</string>
				<key>pfm_title</key>
				<string>Allow modifying Wallpaper</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Set to false to allow new USB accessories to connect to a Mac without authorization</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>11.4.1</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>13.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>58</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowUSBRestrictedMode</string>
				<key>pfm_title</key>
				<string>Allow USB Restricted Mode</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>59</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowHostPairing</string>
				<key>pfm_title</key>
				<string>Allow host pairing</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_imazing_ios_introduction</key>
				<string>14.5</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>59</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowUnpairedExternalBootToRecovery</string>
				<key>pfm_title</key>
				<string>Allow booting into recovery by unpaired devices</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>60</integer>
				<key>pfm_name</key>
				<string>allowOpenFromManagedToUnmanaged</string>
				<key>pfm_title</key>
				<string>Allow documents from managed sources in unmanaged destinations</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>61</integer>
				<key>pfm_name</key>
				<string>allowOpenFromUnmanagedToManaged</string>
				<key>pfm_title</key>
				<string>Allow documents from unmanaged sources in managed destinations</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string>Allow unmanaged apps to read contacts from managed contacts accounts</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>12.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>63</integer>
				<key>pfm_name</key>
				<string>allowUnmanagedToReadManagedContacts</string>
				<key>pfm_title</key>
				<string>Allow unmanaged apps to read contacts from managed contacts accounts</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string>Allow managed apps to write contacts to unmanaged contacts accounts</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>12.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>62</integer>
				<key>pfm_name</key>
				<string>allowManagedToWriteUnmanagedContacts</string>
				<key>pfm_title</key>
				<string>Allow managed apps to write contacts to unmanaged contacts accounts</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string>When set to true, pasteboard functionality between managed and unmanaged apps mirrors that set for opening documents.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>15.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_name</key>
				<string>requireManagedPasteboard</string>
				<key>pfm_title</key>
				<string>Require managed pasteboard</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If false, disables AirDrop.</string>
				<key>pfm_imazing_documentation_url</key>
				<string>https://developer.apple.com/documentation/devicemanagement/restrictions</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.13</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>6</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowAirDrop</string>
				<key>pfm_title</key>
				<string>Allow AirDrop</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>9.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>64</integer>
				<key>pfm_name</key>
				<string>forceAirDropUnmanaged</string>
				<key>pfm_title</key>
				<string>Treat AirDrop as unmanaged destination</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>10.15</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>65</integer>
				<key>pfm_name</key>
				<string>allowActivityContinuation</string>
				<key>pfm_title</key>
				<string>Allow Handoff</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_documentation_url</key>
				<string>https://developer.apple.com/documentation/devicemanagement/restrictions</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>6.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.13</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>66</integer>
				<key>pfm_name</key>
				<string>allowDiagnosticSubmission</string>
				<key>pfm_title</key>
				<string>Allow submitting diagnostic and usage data to Apple</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If Allow diagnostic and usage data to Apple is set to 'false', this will override this preference if set to 'true'.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowDiagnosticSubmission</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>9.3.2</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>67</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowDiagnosticSubmissionModification</string>
				<key>pfm_title</key>
				<string>Allow modifying diagnostic settings</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>11.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>70</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>forceAuthenticationBeforeAutoFill</string>
				<key>pfm_title</key>
				<string>Require Touch ID / Face ID authentication before Autofill</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>9.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>72</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowPairedWatch</string>
				<key>pfm_title</key>
				<string>Allow pairing with Apple Watch</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>8.2</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>71</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>forceWatchWristDetection</string>
				<key>pfm_title</key>
				<string>Force Apple Watch wrist detection</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string>Prevents turning Wi-Fi off in Settings, Control Center, or by entering Airplane Mode.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>13.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>48</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>forceWiFiPowerOn</string>
				<key>pfm_title</key>
				<string>Force Wi-Fi Power On</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_imazing_ios_introduction</key>
				<string>14.5</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>74</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>forceWiFiToAllowedNetworksOnly</string>
				<key>pfm_title</key>
				<string>Join only Wi-Fi networks installed by a Wi-Fi payload</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_deprecation</key>
				<string>14.5</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>10.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>74</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>forceWiFiWhitelisting</string>
				<key>pfm_title</key>
				<string>Join only Wi-Fi networks installed by a Wi-Fi payload</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>11.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>75</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowProximitySetupToNewDevice</string>
				<key>pfm_title</key>
				<string>Allow setting up new nearby iOS devices</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>8.1.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>82</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowPredictiveKeyboard</string>
				<key>pfm_title</key>
				<string>Allow predictive keyboard</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>9.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>83</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowKeyboardShortcuts</string>
				<key>pfm_title</key>
				<string>Allow keyboard shortcuts</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>8.1.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>85</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowAutoCorrection</string>
				<key>pfm_title</key>
				<string>Allow auto correction</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Permits usage of QuickPath keyboard</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>13.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>84</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowContinuousPathKeyboard</string>
				<key>pfm_title</key>
				<string>Allow continuous path keyboard</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>8.1.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>86</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowSpellCheck</string>
				<key>pfm_title</key>
				<string>Allow spell check</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Enable temporary sessions for iPads that have been enabled as Shared iPad.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>13.4</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>5</integer>
				<key>pfm_name</key>
				<string>allowSharedDeviceTemporarySession</string>
				<key>pfm_title</key>
				<string>Allow Shared iPad temporary session</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>10.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>88</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowDictation</string>
				<key>pfm_title</key>
				<string>Allow dictation</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_imazing_ios_introduction</key>
				<string>14.5</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>88</integer>
				<key>pfm_name</key>
				<string>forceOnDeviceOnlyDictation</string>
				<key>pfm_title</key>
				<string>Force on-device only dictation</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_imazing_ios_introduction</key>
				<string>15.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_name</key>
				<string>forceOnDeviceOnlyTranslation</string>
				<key>pfm_title</key>
				<string>Force on-device only translation</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>6.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>89</integer>
				<key>pfm_name</key>
				<string>allowPassbookWhileLocked</string>
				<key>pfm_title</key>
				<string>Allow Apple Wallet notifications on Lock screen</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Allow modifying Personal Hotspot settings</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>12.2</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>57</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowPersonalHotspotModification</string>
				<key>pfm_title</key>
				<string>Allow Personal Hotspot modification</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>90</integer>
				<key>pfm_name</key>
				<string>allowLockScreenControlCenter</string>
				<key>pfm_title</key>
				<string>Allow lock screen control center</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>91</integer>
				<key>pfm_name</key>
				<string>allowLockScreenNotificationsView</string>
				<key>pfm_title</key>
				<string>Show Notification Center on Lock screen</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>92</integer>
				<key>pfm_name</key>
				<string>allowLockScreenTodayView</string>
				<key>pfm_title</key>
				<string>Allow lock screen today view</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>7.1</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>210</integer>
				<key>pfm_name</key>
				<string>forceAirPlayOutgoingRequestsPairingPassword</string>
				<key>pfm_title</key>
				<string>Require passcode on first outgoing AirPlay pairing</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If Allow AirPrint is set to 'false', it also overrides this preference.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowAirPrint</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>11.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>80</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowAirPrintCredentialsStorage</string>
				<key>pfm_title</key>
				<string>Allow storage of AirPrint credentials in Keychain</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>7.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>35</integer>
				<key>pfm_name</key>
				<string>forceLimitAdTracking</string>
				<key>pfm_title</key>
				<string>Force limited ad tracking</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_imazing_ios_introduction</key>
				<string>14</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_name</key>
				<string>allowApplePersonalizedAdvertising</string>
				<key>pfm_title</key>
				<string>Allow Apple-personalized advertizing</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_imazing_ios_introduction</key>
				<string>15</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>12</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_name</key>
				<string>allowMailPrivacyProtection</string>
				<key>pfm_title</key>
				<string>Allow mail privacy protection</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>6.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.13</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>204</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowGameCenter</string>
				<key>pfm_title</key>
				<string>Allow Game Center</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowGameCenter</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>6.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.13</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>206</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowAddingGameCenterFriends</string>
				<key>pfm_title</key>
				<string>Allow adding Game Center friends</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If Allow use of Game Center is set to 'false', this will override this preference.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowGameCenter</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>6.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>205</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowMultiplayerGaming</string>
				<key>pfm_title</key>
				<string>Allow multiplayer gaming</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>207</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowSafari</string>
				<key>pfm_title</key>
				<string>Allow use of Safari</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If Allow use of Safari is set to 'false', this will override this preference.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowSafari</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>4.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>208</integer>
				<key>pfm_name</key>
				<string>safariAllowAutoFill</string>
				<key>pfm_title</key>
				<string>Enable AutoFill</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string>If Allow use of Safari is set to 'false', this will override this preference.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowSafari</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>4.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>209</integer>
				<key>pfm_name</key>
				<string>safariForceFraudWarning</string>
				<key>pfm_title</key>
				<string>Force fraud warning</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If Allow use of Safari is set to 'false', this will override this preference.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowSafari</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>4.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>210</integer>
				<key>pfm_name</key>
				<string>safariAllowJavaScript</string>
				<key>pfm_title</key>
				<string>Enable JavaScript</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If Allow use of Safari is set to 'false', this will override this preference.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_range_list</key>
								<array>
									<false />
								</array>
								<key>pfm_target</key>
								<string>allowSafari</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_indentation_level</key>
				<integer>1</integer>
				<key>pfm_imazing_ios_introduction</key>
				<string>4.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>212</integer>
				<key>pfm_name</key>
				<string>safariAllowPopups</string>
				<key>pfm_title</key>
				<string>Block popups</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<real>2</real>
				<key>pfm_description</key>
				<string>If Allow use of Safari is set to 'false', this will override this preference.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>4.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_pretty_range_list</key>
				<dict>
					<key>0</key>
					<string>Never</string>
					<key>1</key>
					<string>From current website only</string>
					<key>1.5</key>
					<string>From websites I visit</string>
					<key>2</key>
					<string>Always</string>
				</dict>
				<key>pfm_imazing_sorting_index</key>
				<integer>212</integer>
				<key>pfm_name</key>
				<string>safariAcceptCookies</string>
				<key>pfm_range_list</key>
				<array>
					<real>0</real>
					<real>1</real>
					<real>1.5</real>
					<real>2</real>
				</array>
				<key>pfm_title</key>
				<string>Accept cookies</string>
				<key>pfm_type</key>
				<string>real</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If set to false, prevents device name from being changed.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>9.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>51</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_imazing_tvos_introduction</key>
				<string>11.0</string>
				<key>pfm_name</key>
				<string>allowDeviceNameModification</string>
				<key>pfm_title</key>
				<string>Allow modifying device name</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Prevents launching or even showing listed apps. Use bundle ID com.apple.webapp to disallow all webclips. Disabled when using the Allowed Apps preference</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_present</key>
								<true />
								<key>pfm_target</key>
								<string>allowListedAppBundleIDs</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_ios_introduction</key>
				<string>15.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>450</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_imazing_tvos_introduction</key>
				<string>15.0</string>
				<key>pfm_name</key>
				<string>blockedAppBundleIDs</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_imazing_control_type</key>
						<string>bundle-id</string>
						<key>pfm_imazing_value_placeholder</key>
						<string>Blocked app bundle ID</string>
						<key>pfm_title</key>
						<string>Bundle ID</string>
						<key>pfm_type</key>
						<string>string</string>
					</dict>
				</array>
				<key>pfm_title</key>
				<string>Blocked Apps</string>
				<key>pfm_type</key>
				<string>array</string>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Prevents launching or even showing listed apps. Use bundle ID com.apple.webapp to disallow all webclips. Disabled when using the Allowed Apps preference</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_present</key>
								<true />
								<key>pfm_target</key>
								<string>whitelistedAppBundleIDs</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_ios_deprecation</key>
				<string>15.0</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>9.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>452</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_imazing_tvos_deprecation</key>
				<string>15.0</string>
				<key>pfm_imazing_tvos_introduction</key>
				<string>11.0</string>
				<key>pfm_name</key>
				<string>blacklistedAppBundleIDs</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_imazing_control_type</key>
						<string>bundle-id</string>
						<key>pfm_imazing_value_placeholder</key>
						<string>Blocked app bundle ID</string>
						<key>pfm_title</key>
						<string>iOS / tvOS Bundle ID</string>
						<key>pfm_type</key>
						<string>string</string>
					</dict>
				</array>
				<key>pfm_title</key>
				<string>Blocked Apps</string>
				<key>pfm_type</key>
				<string>array</string>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Prevents launching or even showing apps other than the listed ones. Use bundle ID com.apple.webapp to allow webclips. Disabled when using the Blocked Apps preference</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_present</key>
								<true />
								<key>pfm_target</key>
								<string>blockedAppBundleIDs</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_ios_introduction</key>
				<string>15.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>451</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_imazing_tvos_introduction</key>
				<string>15.0</string>
				<key>pfm_name</key>
				<string>allowListedAppBundleIDs</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_imazing_control_type</key>
						<string>bundle-id</string>
						<key>pfm_imazing_value_placeholder</key>
						<string>Allowed app bundle ID</string>
						<key>pfm_title</key>
						<string>Bundle ID</string>
						<key>pfm_type</key>
						<string>string</string>
					</dict>
				</array>
				<key>pfm_title</key>
				<string>Allowed Apps</string>
				<key>pfm_type</key>
				<string>array</string>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Prevents launching or even showing apps other than the listed ones. Use bundle ID com.apple.webapp to allow webclips. Disabled when using the Blocked Apps preference</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_present</key>
								<true />
								<key>pfm_target</key>
								<string>blacklistedAppBundleIDs</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_ios_deprecation</key>
				<string>15.0</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>9.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>453</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_imazing_tvos_deprecation</key>
				<string>15.0</string>
				<key>pfm_imazing_tvos_introduction</key>
				<string>11.0</string>
				<key>pfm_name</key>
				<string>whitelistedAppBundleIDs</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_imazing_control_type</key>
						<string>bundle-id</string>
						<key>pfm_imazing_value_placeholder</key>
						<string>Allowed app bundle ID</string>
						<key>pfm_title</key>
						<string>iOS / tvOS Bundle ID</string>
						<key>pfm_type</key>
						<string>string</string>
					</dict>
				</array>
				<key>pfm_title</key>
				<string>Allowed Apps</string>
				<key>pfm_type</key>
				<string>array</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>us</string>
				<key>pfm_description</key>
				<string>This 2-letter key is used by profile tools to display the proper ratings for given region. It is not recognized or reported by the client.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>11.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_pretty_range_list</key>
				<dict>
					<key>au</key>
					<string>Australia</string>
					<key>ca</key>
					<string>Canada</string>
					<key>de</key>
					<string>Germany</string>
					<key>fr</key>
					<string>France</string>
					<key>gb</key>
					<string>United Kingdom</string>
					<key>ie</key>
					<string>Ireland</string>
					<key>jp</key>
					<string>Japan</string>
					<key>nz</key>
					<string>New Zealand</string>
					<key>us</key>
					<string>United States</string>
				</dict>
				<key>pfm_imazing_sorting_index</key>
				<integer>300</integer>
				<key>pfm_imazing_tvos_introduction</key>
				<string>11.3</string>
				<key>pfm_name</key>
				<string>ratingRegion</string>
				<key>pfm_range_list</key>
				<array>
					<string>au</string>
					<string>ca</string>
					<string>fr</string>
					<string>de</string>
					<string>ie</string>
					<string>jp</string>
					<string>nz</string>
					<string>gb</string>
					<string>us</string>
				</array>
				<key>pfm_title</key>
				<string>Ratings region</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>1000</integer>
				<key>pfm_description</key>
				<string>The maximum level of app content allowed on the device</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>5.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_pretty_range_list</key>
				<dict>
					<key>0</key>
					<string>Don't Allow Apps</string>
					<key>100</key>
					<string>4+</string>
					<key>1000</key>
					<string>Allow All Apps</string>
					<key>200</key>
					<string>9+</string>
					<key>300</key>
					<string>12+</string>
					<key>600</key>
					<string>17+</string>
				</dict>
				<key>pfm_imazing_sorting_index</key>
				<integer>303</integer>
				<key>pfm_imazing_tvos_introduction</key>
				<string>11.3</string>
				<key>pfm_name</key>
				<string>ratingApps</string>
				<key>pfm_range_list</key>
				<array>
					<integer>1000</integer>
					<integer>600</integer>
					<integer>300</integer>
					<integer>200</integer>
					<integer>100</integer>
					<integer>0</integer>
				</array>
				<key>pfm_title</key>
				<string>Allowed content ratings - Apps</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>1000</integer>
				<key>pfm_description</key>
				<string>The maximum level of movie content allowed on the device</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>5.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_pretty_range_list</key>
				<dict>
					<key>0</key>
					<string>Don't Allow Movies</string>
					<key>100</key>
					<string>G</string>
					<key>1000</key>
					<string>Allow All Movies</string>
					<key>200</key>
					<string>PG</string>
					<key>300</key>
					<string>PG-13</string>
					<key>400</key>
					<string>R</string>
					<key>500</key>
					<string>NC-17</string>
				</dict>
				<key>pfm_imazing_sorting_index</key>
				<integer>301</integer>
				<key>pfm_imazing_tvos_introduction</key>
				<string>11.3</string>
				<key>pfm_name</key>
				<string>ratingMovies</string>
				<key>pfm_range_list</key>
				<array>
					<integer>1000</integer>
					<integer>500</integer>
					<integer>400</integer>
					<integer>300</integer>
					<integer>200</integer>
					<integer>100</integer>
					<integer>0</integer>
				</array>
				<key>pfm_title</key>
				<string>Allowed content ratings - Movies</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>1000</integer>
				<key>pfm_description</key>
				<string>The maximum level of TV content allowed on the device</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>5.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_pretty_range_list</key>
				<dict>
					<key>0</key>
					<string>Don't Allow TV Shows</string>
					<key>100</key>
					<string>TV-Y</string>
					<key>1000</key>
					<string>Allow All TV Shows</string>
					<key>200</key>
					<string>TV-Y7</string>
					<key>300</key>
					<string>TV-G</string>
					<key>400</key>
					<string>TV-PG</string>
					<key>500</key>
					<string>TV-14</string>
					<key>600</key>
					<string>TV-MA</string>
				</dict>
				<key>pfm_imazing_sorting_index</key>
				<integer>302</integer>
				<key>pfm_imazing_tvos_introduction</key>
				<string>11.3</string>
				<key>pfm_name</key>
				<string>ratingTVShows</string>
				<key>pfm_range_list</key>
				<array>
					<integer>1000</integer>
					<integer>600</integer>
					<integer>500</integer>
					<integer>400</integer>
					<integer>300</integer>
					<integer>200</integer>
					<integer>100</integer>
					<integer>0</integer>
				</array>
				<key>pfm_title</key>
				<string>Allowed content ratings - TV Shows</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>When false, explicit music or video content purchased from the iTunes Store is hidden. Explicit content is marked as such by content providers, such as record labels, when sold through the iTunes Store. This key is deprecated on unsupervised devices.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>11.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>304</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_imazing_tvos_introduction</key>
				<string>11.3</string>
				<key>pfm_name</key>
				<string>allowExplicitContent</string>
				<key>pfm_title</key>
				<string>Allow playback of explicit music, podcasts, and iTunes U</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Allow connecting to and browsing any USB storage device in the Files App</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>13.1</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>27</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowFilesUSBDriveAccess</string>
				<key>pfm_title</key>
				<string>Allow Files USB Drive Access</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If set to false, the user will not be able to download media from Apple Books that has been tagged as erotica.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>11.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>305</integer>
				<key>pfm_imazing_tvos_introduction</key>
				<string>11.3</string>
				<key>pfm_name</key>
				<string>allowBookstoreErotica</string>
				<key>pfm_title</key>
				<string>Allow explicit sexual content in iBooks Store</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_ios_introduction</key>
				<string>12.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.14</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>77</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowPasswordSharing</string>
				<key>pfm_title</key>
				<string>Allow password sharing</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If set to false, a user's device will not request passwords from nearby devices.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>12.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.14</string>
				<key>pfm_imazing_sorting_index</key>
				<integer>76</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_imazing_tvos_introduction</key>
				<string>12.0</string>
				<key>pfm_name</key>
				<string>allowPasswordProximityRequests</string>
				<key>pfm_title</key>
				<string>Allow proximity based password sharing requests</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string>If set to true, delays user visibility of Software Updates.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>11.3</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.13.4</string>
				<key>pfm_imazing_sorting_index</key>
				<integer>100</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_imazing_tvos_introduction</key>
				<string>12.2</string>
				<key>pfm_name</key>
				<string>forceDelayedSoftwareUpdates</string>
				<key>pfm_title</key>
				<string>Defer Software Updates</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>30</integer>
				<key>pfm_description</key>
				<string>Number of days the software updates will be hidden from the user.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_n_range_list</key>
								<array>
									<true />
								</array>
								<key>pfm_target</key>
								<string>forceDelayedSoftwareUpdates</string>
							</dict>
							<dict>
								<key>pfm_n_range_list</key>
								<array>
									<true />
								</array>
								<key>pfm_target</key>
								<string>forceDelayedAppSoftwareUpdates</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_ios_introduction</key>
				<string>11.3</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.13.4</string>
				<key>pfm_imazing_sorting_index</key>
				<integer>130</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_imazing_tvos_introduction</key>
				<string>12.2</string>
				<key>pfm_name</key>
				<string>enforcedSoftwareUpdateDelay</string>
				<key>pfm_range_max</key>
				<integer>90</integer>
				<key>pfm_range_min</key>
				<integer>1</integer>
				<key>pfm_title</key>
				<string>Deferred Software Updates Delay</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Set to false to prevent the installation of rapid security responses</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>16.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>13.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowRapidSecurityResponseInstallation</string>
				<key>pfm_title</key>
				<string>Allow rapid security response installation</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Set to false to prevent the removal of rapid security responses</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>16.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>13.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowRapidSecurityResponseRemoval</string>
				<key>pfm_title</key>
				<string>Allow rapid security response removal</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Allows disabling Find My Device in the Find My app</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>13.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>58</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowFindMyDevice</string>
				<key>pfm_title</key>
				<string>Allow Find My Devices</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Allows disabling Find My Friends in the Find My app</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>13.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>58</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowFindMyFriends</string>
				<key>pfm_title</key>
				<string>Allow Find My Friends</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Allows preventing connection to network drives in the Files app</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>13.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>27</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>allowFilesNetworkDriveAccess</string>
				<key>pfm_title</key>
				<string>Allow Files Network Drive Access</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>172800</integer>
				<key>pfm_description</key>
				<string>Period of time in seconds after which the device will require entry of password or passcode to unlock.</string>
				<key>pfm_imazing_ios_introduction</key>
				<string>15.0</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>12.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>iOS</string>
					<string>macOS</string>
				</array>
				<key>pfm_name</key>
				<string>enforcedFingerprintTimeout</string>
				<key>pfm_title</key>
				<string>Enforced Fingerprint Timeout</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>12.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>200</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_imazing_tvos_introduction</key>
				<string>10.2</string>
				<key>pfm_name</key>
				<string>allowAirPlayIncomingRequests</string>
				<key>pfm_title</key>
				<string>Allow incoming AirPlay requests</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>When false this disallows content caching. Defaults to true. Introduced in macOS 10.13 but moved to the content caching domain in 10.13.4.</string>
				<key>pfm_imazing_macos_deprecation</key>
				<string>10.13.4</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>10.13</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_name</key>
				<string>allowContentCaching</string>
				<key>pfm_title</key>
				<string>Allow Content Caching</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>Set to false to prevent sharing mouse and keyboard between a Mac and an iPad</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>13.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_name</key>
				<string>allowUniversalControl</string>
				<key>pfm_title</key>
				<string>Allow Universal Control</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>10.13</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>201</integer>
				<key>pfm_name</key>
				<string>allowiTunesFileSharing</string>
				<key>pfm_title</key>
				<string>Allow iTunes File Sharing</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>95</integer>
				<key>pfm_name</key>
				<string>allowCloudBTMM</string>
				<key>pfm_title</key>
				<string>Allow iCloud Back to My Mac</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>27</integer>
				<key>pfm_name</key>
				<string>allowCloudBookmarks</string>
				<key>pfm_title</key>
				<string>Allow iCloud Bookmarks</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>27</integer>
				<key>pfm_name</key>
				<string>allowCloudCalendar</string>
				<key>pfm_title</key>
				<string>Allow iCloud Calendar</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>27</integer>
				<key>pfm_name</key>
				<string>allowCloudAddressBook</string>
				<key>pfm_title</key>
				<string>Allow iCloud Contacts</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12.4</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>27</integer>
				<key>pfm_name</key>
				<string>allowCloudDesktopAndDocuments</string>
				<key>pfm_title</key>
				<string>Allow iCloud Desktop &amp; Documents</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>27</integer>
				<key>pfm_name</key>
				<string>allowCloudFMM</string>
				<key>pfm_title</key>
				<string>Allow iCloud Find My Mac</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>27</integer>
				<key>pfm_name</key>
				<string>allowCloudMail</string>
				<key>pfm_title</key>
				<string>Allow iCloud Mail</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>27</integer>
				<key>pfm_name</key>
				<string>allowCloudNotes</string>
				<key>pfm_title</key>
				<string>Allow iCloud Notes</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>10.12</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>27</integer>
				<key>pfm_name</key>
				<string>allowCloudReminders</string>
				<key>pfm_title</key>
				<string>Allow iCloud Reminders</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>30</integer>
				<key>pfm_description</key>
				<string>Number of days minor software updates will be hidden from the user.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_n_range_list</key>
								<array>
									<true />
								</array>
								<key>pfm_target</key>
								<string>forceDelayedSoftwareUpdates</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_macos_introduction</key>
				<string>11.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>150</integer>
				<key>pfm_name</key>
				<string>enforcedSoftwareUpdateMinorOSDeferredInstallDelay</string>
				<key>pfm_range_max</key>
				<integer>90</integer>
				<key>pfm_range_min</key>
				<integer>1</integer>
				<key>pfm_title</key>
				<string>Deferred Minor Software Updates Delay</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string>If true, delays user visibility of non-OS Software Updates. Requires a supervised device.</string>
				<key>pfm_imazing_macos_introduction</key>
				<string>11.0</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>120</integer>
				<key>pfm_imazing_supervision_required</key>
				<true />
				<key>pfm_name</key>
				<string>forceDelayedAppSoftwareUpdates</string>
				<key>pfm_title</key>
				<string>Defer non-OS Software Updates</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>30</integer>
				<key>pfm_description</key>
				<string>Number of days non-OS software updates will be hidden from the user.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_n_range_list</key>
								<array>
									<true />
								</array>
								<key>pfm_target</key>
								<string>forceDelayedAppSoftwareUpdates</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_macos_introduction</key>
				<string>11.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>160</integer>
				<key>pfm_name</key>
				<string>enforcedSoftwareUpdateNonOSDeferredInstallDelay</string>
				<key>pfm_range_max</key>
				<integer>90</integer>
				<key>pfm_range_min</key>
				<integer>1</integer>
				<key>pfm_title</key>
				<string>Deferred non-OS Software Updates Delay</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<false />
				<key>pfm_description</key>
				<string />
				<key>pfm_imazing_macos_introduction</key>
				<string>11.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>110</integer>
				<key>pfm_name</key>
				<string>forceDelayedMajorSoftwareUpdates</string>
				<key>pfm_title</key>
				<string>Defer Major OS Software Updates</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>30</integer>
				<key>pfm_description</key>
				<string>Number of days major software updates will be hidden from the user.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_imazing_exclusion_disables</key>
						<true />
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_n_range_list</key>
								<array>
									<true />
								</array>
								<key>pfm_target</key>
								<string>forceDelayedMajorSoftwareUpdates</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_imazing_macos_introduction</key>
				<string>11.3</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>macOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>140</integer>
				<key>pfm_name</key>
				<string>enforcedSoftwareUpdateMajorOSDeferredInstallDelay</string>
				<key>pfm_range_max</key>
				<integer>90</integer>
				<key>pfm_range_min</key>
				<integer>1</integer>
				<key>pfm_title</key>
				<string>Deferred Major Software Updates Delay</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_imazing_platforms</key>
				<array>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_tvos_introduction</key>
				<string>15.4</string>
				<key>pfm_name</key>
				<string>allowAutomaticScreenSaver</string>
				<key>pfm_title</key>
				<string>Allow Automatic Screen Saver</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>It is recommended to use the AirPlay Security Payload.</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>220</integer>
				<key>pfm_imazing_tvos_deprecation</key>
				<string>10.2</string>
				<key>pfm_imazing_tvos_introduction</key>
				<string>6.1</string>
				<key>pfm_name</key>
				<string>forceAirPlayIncomingRequestsPairingPassword</string>
				<key>pfm_title</key>
				<string>Require passcode on first incoming AirPlay pairing</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<true />
				<key>pfm_description</key>
				<string>If set to false, the Apple TV cannot be paired for use with the Remote app or Control Center widget.</string>
				<key>pfm_imazing_platforms</key>
				<array>
					<string>tvOS</string>
				</array>
				<key>pfm_imazing_sorting_index</key>
				<integer>93</integer>
				<key>pfm_imazing_tvos_introduction</key>
				<string>10.2</string>
				<key>pfm_name</key>
				<string>allowRemoteAppPairing</string>
				<key>pfm_title</key>
				<string>Allow pairing with Remote app</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
		</array>
		<key>pfm_targets</key>
		<array>
			<string>system</string>
			<string>user</string>
		</array>
		<key>pfm_title</key>
		<string>Restrictions</string>
		<key>pfm_version</key>
		<integer>5</integer>
	</dict>
</plist>
