<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define settings for the Exchange ActiveSync account.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/exchangeactivesync</string>
	<key>pfm_domain</key>
	<string>com.apple.eas.account</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2023-12-11T10:37:56Z</date>
	<key>pfm_note</key>
	<string>As with VPN and Wi-Fi configurations, it is possible to associate an SCEP credential with an Exchange configu- ration via the PayloadCertificateUUID key.</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures an Exchange account</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Exchange ActiveSync</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Account name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.eas.account</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.eas.account</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile.
The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This user name for this Exchange account. The user name is required for noninteractive installations like MDM in iOS.</string>
			<key>pfm_description_reference</key>
			<string>This string specifies the user name for this Exchange account.
Required in macOS or non-interactive installations (like MDM on iOS).</string>
			<key>pfm_name</key>
			<string>UserName</string>
			<key>pfm_require</key>
			<string>push</string>
			<key>pfm_title</key>
			<string>Account user name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The full email address for the account. If not present in the payload, the device prompts for this string during profile installation.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the full email address for the account. If not present in the payload, the device prompts for this string during profile installation.
In macOS, this key is required.</string>
			<key>pfm_name</key>
			<string>EmailAddress</string>
			<key>pfm_title</key>
			<string>Account email address</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The password of the account. Use only with encrypted profiles.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>OAuth</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>Password</string>
			<key>pfm_sensitive</key>
			<true/>
			<key>pfm_title</key>
			<string>Account password</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true',  overrides the previous user/EAS password with the new EAS password in the payload. Available in iOS 14 and later.</string>
			<key>pfm_ios_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>OverridePreviousPassword</string>
			<key>pfm_title</key>
			<string>Override previous password</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>14.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Exchange server host name or IP address.
If using OAuth without an OAuthSignInURL, the host name is ignored.</string>
			<key>pfm_name</key>
			<string>Host</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Internal Exchange Host</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables SSL for authentication.</string>
			<key>pfm_name</key>
			<string>SSL</string>
			<key>pfm_title</key>
			<string>Use SSL for Internal Exchange Host</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables OAuth for authentication. If enabled, don't specify a password.
Available only in iOS 12.0 and above.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Specifies whether the connection should use OAuth for authentication. If enabled, a password should not be specified. This defaults to false.
Availability: Available only in iOS 12.0 and macOS 10.14 and later.</string>
			<key>pfm_ios_min</key>
			<string>12.0</string>
			<key>pfm_macos_min</key>
			<string>10.14</string>
			<key>pfm_name</key>
			<string>OAuth</string>
			<key>pfm_title</key>
			<string>Use OAuth</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>12.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_allowed_file_types</key>
			<array>
				<string>com.rsa.pkcs-12</string>
			</array>
			<key>pfm_description</key>
			<string>The '.p12' identity certificate in NSData blob format, for accounts that allow authentication via certificate.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>PayloadCertificateUUID</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>Certificate</string>
			<key>pfm_title</key>
			<string>Identity Certificate</string>
			<key>pfm_type</key>
			<string>data</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>7.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The name or description of the certificate.</string>
			<key>pfm_name</key>
			<string>CertificateName</string>
			<key>pfm_title</key>
			<string>Certificate Name</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>7.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The password necessary for the '.p12' identity certificate. Used with mandatory encryption of profiles.</string>
			<key>pfm_name</key>
			<string>CertificatePassword</string>
			<key>pfm_sensitive</key>
			<true/>
			<key>pfm_title</key>
			<string>Certificate Password</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', prevents messages from being moved out of this email account into another account. This setting also prevents forwarding or replying from an account other than the one the message was sent to.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Defaultfalse.
If set to true, messages may not be moved out of this email account into another account. Also prevents forwarding or replying from a different account than the message was originated from.
Availability: Available in iOS 5.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>PreventMove</string>
			<key>pfm_title</key>
			<string>Prevent Move</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>5.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', prevents this account from sending mail in any app other than the Apple Mail app.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Default false. If set to true, this account will not be available for sending mail in any app other than the Apple Mail app.
Availability: Available in iOS 5.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>PreventAppSheet</string>
			<key>pfm_title</key>
			<string>Prevent App Sheet</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>5.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The UUID of of the certificate payload within the same profile to use for the identity credential. If this field is present, the Certificate field is not used.</string>
			<key>pfm_description_reference</key>
			<string>UUID of the certificate payload to use for the identity credential. If this field is present, the Certificate field is not used.
Availability: Available in iOS 5.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>PayloadCertificateUUID</string>
			<key>pfm_title</key>
			<string>Identity Certificate UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables S/MIME encryption. In iOS 10.0 and later, this key is ignored. Use 'SMIMESigningEnabled' instead.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Default false. If true, this account supports S/MIME.
As of iOS 10.0, this key is ignored.
Availability: Available only in iOS 5.0 through 9.3.3.</string>
			<key>pfm_ios_deprecated</key>
			<string>9.3.3</string>
			<key>pfm_ios_max</key>
			<string>9.3.3</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>SMIMEEnabled</string>
			<key>pfm_title</key>
			<string>Enable S/MIME</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_deprecated</key>
					<string>10.0</string>
					<key>pfmx_introduced</key>
					<string>5.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables S/MIME signing for this account. Available in iOS 10.0 and later.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Default true. If set to true, S/MIME signing is enabled for this account.
Availability: Available only in iOS 10.3 and later.</string>
			<key>pfm_ios_min</key>
			<string>10.3</string>
			<key>pfm_name</key>
			<string>SMIMESigningEnabled</string>
			<key>pfm_title</key>
			<string>Enable S/MIME Signing</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.3</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The UUID of the identity certificate used to sign messages sent from this account.</string>
			<key>pfm_description_reference</key>
			<string>Optional. The PayloadUUID of the identity certificate used to sign messages sent from this account. 
Availability: Available only in iOS 5.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>SMIMESigningCertificateUUID</string>
			<key>pfm_title</key>
			<string>S/MIME Signing Certificate</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>5.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables S/MIME encryption for this account. Available in iOS 10.0 and later. As of iOS 12.0, this key is deprecated. It is recommended to use 'SMIMEEncryptByDefault' instead.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Default false. If set to true, S/MIME encryption is on by default for this account.
Availability: Available only in iOS 10.3 and later. As of iOS 12.0, this key is deprecated. It is recommended to use SMIMEEncryptByDefault instead.</string>
			<key>pfm_ios_deprecated</key>
			<string>12.0</string>
			<key>pfm_ios_min</key>
			<string>10.3</string>
			<key>pfm_name</key>
			<string>SMIMEEncryptionEnabled</string>
			<key>pfm_title</key>
			<string>Enable S/MIME Encryption</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_deprecated</key>
					<string>12.0</string>
					<key>pfmx_introduced</key>
					<string>10.3</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The payload UUID of the identity certificate used to decrypt messages sent to this account. The public certificate is attached to outgoing mail to allow encrypted mail to be sent to this user. When the user sends encrypted mail, the public certificate is used to encrypt the copy of the mail in the user's Sent mailbox.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>SMIMEEnabled</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>SMIMEEncryptionCertificateUUID</string>
			<key>pfm_title</key>
			<string>S/MIME Encryption Certificate</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>5.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', displays the per-message encryption switch in the Mail Compose UI.
Available in iOS 8.0 and later. As of iOS 12.0, this key is deprecated. Use 'SMIMEEnableEncryptionPerMessageSwitch' instead.</string>
			<key>pfm_ios_deprecated</key>
			<string>12.0</string>
			<key>pfm_ios_min</key>
			<string>8.0</string>
			<key>pfm_name</key>
			<string>SMIMEEnablePerMessageSwitch</string>
			<key>pfm_title</key>
			<string>Enable S/MIME Per Message Switch</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_deprecated</key>
					<string>12.0</string>
					<key>pfmx_introduced</key>
					<string>8.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the user can turn S/MIME signing on or off in Settings. Available in iOS 12.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>SMIMESigningUserOverrideable</string>
			<key>pfm_title</key>
			<string>Allow user to toggle S/MIME Signing</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>12.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the user can select the signing identity. Available in iOS 12.0 and later.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Default false. If set to true, the user can select the signing identity.
Availability: Available only in iOS 12.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>SMIMESigningCertificateUUIDUserOverrideable</string>
			<key>pfm_title</key>
			<string>Allow user to select S/MIME Identity</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>12.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If set to true, S/MIME encryption is enabled by default. If 'SMIMEEnableEncryptionPerMessageSwitch' is false, this default cannot be changed by the user. Available in iOS 12.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>SMIMEEncryptByDefault</string>
			<key>pfm_title</key>
			<string>Enable S/MIME Encryption</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>12.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the user can turn encryption by default on/off, and encryption is on. Available in iOS 12.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>SMIMEEncryptByDefaultUserOverrideable</string>
			<key>pfm_title</key>
			<string>Allow user to select S/MIME Encryption</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>12.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the user can select the S/MIME encryption identity, and encryption is on.Available in iOS 12.0 and later.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Default false. If set to true, the user can select the S/MIME encryption identity and encryption is enabled.
Availability: Available only in iOS 12.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>SMIMEEncryptionCertificateUUIDUserOverrideable</string>
			<key>pfm_title</key>
			<string>Allow user to select S/MIME Encryption Certificate</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>12.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', displays the per-message encryption switch in the Mail Compose UI. Available in iOS 12.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>SMIMEEnableEncryptionPerMessageSwitch</string>
			<key>pfm_title</key>
			<string>Allow user to select S/MIME Encryption per message</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>12.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables the Calendars service for this account. The Calendars service may be re-enabled in Settings unless 'EnableCalendarsUserOverridable' is 'false'.
'EnableMail', 'EnableContacts', 'EnableCalendars', 'EnableReminders', and 'EnableNotes' can't all be set to 'false'.</string>
			<key>pfm_name</key>
			<string>EnableCalendars</string>
			<key>pfm_note</key>
			<string>EnableMail, EnableContacts, EnableCalendars, EnableReminders, and EnableNotes can't all be set to false. At least 1 must be enabled.</string>
			<key>pfm_title</key>
			<string>Enabled Services - Calendars</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables the Contacts service for this account. The Contacts service may be re-enabled in Settings unless 'EnableContactsUserOverridable' is 'false'.
'EnableMail', 'EnableContacts', 'EnableCalendars', 'EnableReminders', and 'EnableNotes' can't all be set to 'false'.</string>
			<key>pfm_name</key>
			<string>EnableContacts</string>
			<key>pfm_note</key>
			<string>EnableMail, EnableContacts, EnableCalendars, EnableReminders, and EnableNotes can't all be set to false. At least 1 must be enabled.</string>
			<key>pfm_title</key>
			<string>Enabled Services - Contacts</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables the Mail service for this account. The Mail service may be re-enabled in Settings unless 'EnableMailUserOverridable' is 'false'.
'EnableMail', 'EnableContacts', 'EnableCalendars', 'EnableReminders', and 'EnableNotes' can't all be set to 'false'.</string>
			<key>pfm_name</key>
			<string>EnableMail</string>
			<key>pfm_note</key>
			<string>EnableMail, EnableContacts, EnableCalendars, EnableReminders, and EnableNotes can't all be set to false. At least 1 must be enabled.</string>
			<key>pfm_title</key>
			<string>Enabled Services - Mail</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables the Notes service for this account. The Notes service may be re-enabled in Settings unless 'EnableNotesUserOverridable' is 'false'.
'EnableMail', 'EnableContacts', 'EnableCalendars', 'EnableReminders', and 'EnableNotes' can't all be set to 'false'.</string>
			<key>pfm_name</key>
			<string>EnableNotes</string>
			<key>pfm_note</key>
			<string>EnableMail, EnableContacts, EnableCalendars, EnableReminders, and EnableNotes can't all be set to false. At least 1 must be enabled.</string>
			<key>pfm_title</key>
			<string>Enabled Services - Notes</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables the Reminders service for this account. The Reminders service may be re-enabled in Settings unless 'EnableRemindersUserOverridable' is false.
'EnableMail', 'EnableContacts', 'EnableCalendars', 'EnableReminders', and 'EnableNotes' can't all be set to 'false'.</string>
			<key>pfm_name</key>
			<string>EnableReminders</string>
			<key>pfm_note</key>
			<string>EnableMail, EnableContacts, EnableCalendars, EnableReminders, and EnableNotes can't all be set to false. At least 1 must be enabled.</string>
			<key>pfm_title</key>
			<string>Enabled Services - Reminders</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prevents the user from changing the state of the Calendars service for this account in Settings.</string>
			<key>pfm_name</key>
			<string>EnableCalendarsUserOverridable</string>
			<key>pfm_title</key>
			<string>Account Modification - Calendars</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prevents the user from changing the state of the Contacts service for this account in Settings.</string>
			<key>pfm_name</key>
			<string>EnableContactsUserOverridable</string>
			<key>pfm_title</key>
			<string>Account Modification - Contacts</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prevents the user from changing the state of the Mail service for this account in Settings.</string>
			<key>pfm_name</key>
			<string>EnableMailUserOverridable</string>
			<key>pfm_title</key>
			<string>Account Modification - Mail</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prevents the user from changing the state of the Notes service for this account in Settings.</string>
			<key>pfm_name</key>
			<string>EnableNotesUserOverridable</string>
			<key>pfm_title</key>
			<string>Account Modification - Notes</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prevents the user from changing the state of the Reminders service for this account in Settings.</string>
			<key>pfm_name</key>
			<string>EnableRemindersUserOverridable</string>
			<key>pfm_title</key>
			<string>Account Modification - Reminders</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', excludes this account from Recent Addresses syncing.</string>
			<key>pfm_description_reference</key>
			<string>If true, this account is excluded from address Recents syncing. This defaults to false.
Availability: Available only in iOS 6.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>6.0</string>
			<key>pfm_name</key>
			<string>disableMailRecentsSyncing</string>
			<key>pfm_title</key>
			<string>Exclude this account from address recents syncing</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>7</integer>
			<key>pfm_description</key>
			<string>The number of days in the past to sync mail on the device.</string>
			<key>pfm_name</key>
			<string>MailNumberOfPastDaysToSync</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>3</integer>
				<integer>7</integer>
				<integer>14</integer>
				<integer>31</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>No Limit</string>
				<string>1</string>
				<string>3</string>
				<string>7</string>
				<string>14</string>
				<string>31</string>
			</array>
			<key>pfm_title</key>
			<string>Number of days to sync</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfmx_comment</key>
			<string>The No Limit option is only mentioned in https://support.apple.com/en-al/guide/deployment/depa9c22f8c/web. No vaule is given for it in the document, however a value of zero was provided by a user of the manifest who tested it to work.</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The communication service handler rules for this account.</string>
			<key>pfm_name</key>
			<string>CommunicationServiceRules</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The default handlers to be used for contacts from this account.</string>
					<key>pfm_name</key>
					<string>DefaultServiceHandlers</string>
					<key>pfm_required</key>
					<true/>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The bundle identifier of the default application to use for audio calls made to contacts from this account.</string>
							<key>pfm_name</key>
							<string>AudioCall</string>
							<key>pfm_title</key>
							<string>BundleIdentifier</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfmx_supported_oses</key>
							<dict>
								<key>iOS</key>
								<dict>
									<key>pfmx_introduced</key>
									<string>10.0</string>
								</dict>
							</dict>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Default Service Handlers</string>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.0</string>
						</dict>
					</dict>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Communication Service Rules</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The VPNUUID of the per-app VPN the account uses for network communication.
Available in iOS 14 and later.</string>
			<key>pfm_ios_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>VPNUUID</string>
			<key>pfm_title</key>
			<string>Per-App VPN Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>14.0</string>
				</dict>
			</dict>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Exchange (iOS)</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>5</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>iOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>4.0</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_shared_ipad</key>
			<dict>
				<key>pfmx_device_channel</key>
				<true/>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
