<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Energy Saver settings</string>
	<key>pfm_domain</key>
	<string>com.apple.MCX</string>
	<key>pfm_subdomain</key>
	<string>EnergySaver</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2018-07-18T08:58:49Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Energy Saver settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Energy Saver</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.MCX</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.MCX</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Desktop</string>
				<string>Portable</string>
				<string>Schedule</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Desktop</key>
				<array>
					<string>com.apple.EnergySaver.desktop.ACPower</string>
				</array>
				<key>Portable</key>
				<array>
					<string>PFC_SegmentedControl_Portable</string>
					<string>com.apple.EnergySaver.portable.BatteryPower</string>
					<string>com.apple.EnergySaver.portable.ACPower</string>
				</array>
				<key>Schedule</key>
				<array>
					<string>com.apple.EnergySaver.desktop.Schedule</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Managed settings for the desktop energy profile.</string>
			<key>pfm_hidden</key>
			<string>container</string>
			<key>pfm_name</key>
			<string>com.apple.EnergySaver.desktop.ACPower</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<integer>-1</integer>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_hidden</key>
					<string>all</string>
					<key>pfm_name</key>
					<string>com.apple.EnergySaver.desktop.ACPower-ProfileNumber</string>
					<key>pfm_title</key>
					<string>Desktop Energy Saver Profile</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Display Sleep Timer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
						<integer>2</integer>
						<integer>3</integer>
						<integer>5</integer>
						<integer>10</integer>
						<integer>20</integer>
						<integer>30</integer>
						<integer>45</integer>
						<integer>60</integer>
						<integer>75</integer>
						<integer>90</integer>
						<integer>105</integer>
						<integer>120</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Never</string>
						<string>1 Minute</string>
						<string>2 Minutes</string>
						<string>3 Minutes</string>
						<string>5 Minutes</string>
						<string>10 Minutes</string>
						<string>20 Minutes</string>
						<string>30 Minutes</string>
						<string>45 Minutes</string>
						<string>1 Hour</string>
						<string>1 Hour 15 Minutes</string>
						<string>1 Hour 30 Minutes</string>
						<string>1 Hour 45 Minutes</string>
						<string>2 Hours</string>
					</array>
					<key>pfm_title</key>
					<string>Put the display(s) to sleep after:</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>System Sleep Timer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
						<integer>2</integer>
						<integer>3</integer>
						<integer>5</integer>
						<integer>10</integer>
						<integer>20</integer>
						<integer>30</integer>
						<integer>45</integer>
						<integer>60</integer>
						<integer>75</integer>
						<integer>90</integer>
						<integer>105</integer>
						<integer>120</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Never</string>
						<string>1 Minute</string>
						<string>2 Minutes</string>
						<string>3 Minutes</string>
						<string>5 Minutes</string>
						<string>10 Minutes</string>
						<string>20 Minutes</string>
						<string>30 Minutes</string>
						<string>45 Minutes</string>
						<string>1 Hour</string>
						<string>1 Hour 15 Minutes</string>
						<string>1 Hour 30 Minutes</string>
						<string>1 Hour 45 Minutes</string>
						<string>2 Hours</string>
					</array>
					<key>pfm_title</key>
					<string>Put the computer to sleep after:</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Disk Sleep Timer-boolean</string>
					<key>pfm_title</key>
					<string>Put the hard disk(s) to sleep whenever possible</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Wake On LAN</string>
					<key>pfm_title</key>
					<string>Wake for Ethernet network administrator access</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Sleep On Power Button</string>
					<key>pfm_title</key>
					<string>Allow power button to sleep the computer</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Automatic Restart On Power Loss</string>
					<key>pfm_title</key>
					<string>Start up automatically after a power failure</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Desktop Energy Saver Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_Portable</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Battery</string>
				<string>Power Adapter</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Battery</key>
				<array>
					<string>com.apple.EnergySaver.portable.BatteryPower</string>
				</array>
				<key>Power Adapter</key>
				<array>
					<string></string>
					<string>com.apple.EnergySaver.portable.ACPower</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Managed settings for the portable battery power energy profile</string>
			<key>pfm_hidden</key>
			<string>container</string>
			<key>pfm_name</key>
			<string>com.apple.EnergySaver.portable.BatteryPower</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<integer>-1</integer>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_hidden</key>
					<string>all</string>
					<key>pfm_name</key>
					<string>com.apple.EnergySaver.portable.BatteryPower-ProfileNumber</string>
					<key>pfm_title</key>
					<string>Portable on Battery Power Energy Saver Profile</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Display Sleep Timer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
						<integer>2</integer>
						<integer>3</integer>
						<integer>5</integer>
						<integer>10</integer>
						<integer>20</integer>
						<integer>30</integer>
						<integer>45</integer>
						<integer>60</integer>
						<integer>75</integer>
						<integer>90</integer>
						<integer>105</integer>
						<integer>120</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Never</string>
						<string>1 Minute</string>
						<string>2 Minutes</string>
						<string>3 Minutes</string>
						<string>5 Minutes</string>
						<string>10 Minutes</string>
						<string>20 Minutes</string>
						<string>30 Minutes</string>
						<string>45 Minutes</string>
						<string>1 Hour</string>
						<string>1 Hour 15 Minutes</string>
						<string>1 Hour 30 Minutes</string>
						<string>1 Hour 45 Minutes</string>
						<string>2 Hours</string>
					</array>
					<key>pfm_title</key>
					<string>Put the display(s) to sleep after:</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>System Sleep Timer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
						<integer>2</integer>
						<integer>3</integer>
						<integer>5</integer>
						<integer>10</integer>
						<integer>20</integer>
						<integer>30</integer>
						<integer>45</integer>
						<integer>60</integer>
						<integer>75</integer>
						<integer>90</integer>
						<integer>105</integer>
						<integer>120</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Never</string>
						<string>1 Minute</string>
						<string>2 Minutes</string>
						<string>3 Minutes</string>
						<string>5 Minutes</string>
						<string>10 Minutes</string>
						<string>20 Minutes</string>
						<string>30 Minutes</string>
						<string>45 Minutes</string>
						<string>1 Hour</string>
						<string>1 Hour 15 Minutes</string>
						<string>1 Hour 30 Minutes</string>
						<string>1 Hour 45 Minutes</string>
						<string>2 Hours</string>
					</array>
					<key>pfm_title</key>
					<string>Put the computer to sleep after:</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Disk Sleep Timer-boolean</string>
					<key>pfm_title</key>
					<string>Put the hard disk(s) to sleep whenever possible</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Wake On LAN</string>
					<key>pfm_title</key>
					<string>Wake for Ethernet network administrator access</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Automatic Restart On Power Loss</string>
					<key>pfm_title</key>
					<string>Start up automatically after a power failure</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Portable Energy Saver Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Managed settings for the portable AC power energy profile.</string>
			<key>pfm_hidden</key>
			<string>container</string>
			<key>pfm_name</key>
			<string>com.apple.EnergySaver.portable.ACPower</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<integer>-1</integer>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_hidden</key>
					<string>all</string>
					<key>pfm_name</key>
					<string>com.apple.EnergySaver.portable.ACPower-ProfileNumber</string>
					<key>pfm_title</key>
					<string>Portable AC Power Energy Saver Profile</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Display Sleep Timer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
						<integer>2</integer>
						<integer>3</integer>
						<integer>5</integer>
						<integer>10</integer>
						<integer>20</integer>
						<integer>30</integer>
						<integer>45</integer>
						<integer>60</integer>
						<integer>75</integer>
						<integer>90</integer>
						<integer>105</integer>
						<integer>120</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Never</string>
						<string>1 Minute</string>
						<string>2 Minutes</string>
						<string>3 Minutes</string>
						<string>5 Minutes</string>
						<string>10 Minutes</string>
						<string>20 Minutes</string>
						<string>30 Minutes</string>
						<string>45 Minutes</string>
						<string>1 Hour</string>
						<string>1 Hour 15 Minutes</string>
						<string>1 Hour 30 Minutes</string>
						<string>1 Hour 45 Minutes</string>
						<string>2 Hours</string>
					</array>
					<key>pfm_title</key>
					<string>Put the display(s) to sleep after:</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>System Sleep Timer</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
						<integer>2</integer>
						<integer>3</integer>
						<integer>5</integer>
						<integer>10</integer>
						<integer>20</integer>
						<integer>30</integer>
						<integer>45</integer>
						<integer>60</integer>
						<integer>75</integer>
						<integer>90</integer>
						<integer>105</integer>
						<integer>120</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Never</string>
						<string>1 Minute</string>
						<string>2 Minutes</string>
						<string>3 Minutes</string>
						<string>5 Minutes</string>
						<string>10 Minutes</string>
						<string>20 Minutes</string>
						<string>30 Minutes</string>
						<string>45 Minutes</string>
						<string>1 Hour</string>
						<string>1 Hour 15 Minutes</string>
						<string>1 Hour 30 Minutes</string>
						<string>1 Hour 45 Minutes</string>
						<string>2 Hours</string>
					</array>
					<key>pfm_title</key>
					<string>Put the computer to sleep after:</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Disk Sleep Timer-boolean</string>
					<key>pfm_title</key>
					<string>Put the hard disk(s) to sleep whenever possible</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Wake On LAN</string>
					<key>pfm_title</key>
					<string>Wake for Ethernet network administrator access</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Automatic Restart On Power Loss</string>
					<key>pfm_title</key>
					<string>Start up automatically after a power failure</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Portable Energy Saver Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Use this key to manage scheduled power on and power off events.</string>
			<key>pfm_hidden</key>
			<string>container</string>
			<key>pfm_name</key>
			<string>com.apple.EnergySaver.desktop.Schedule</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Use this key to describe a repeating start up/wake time.</string>
					<key>pfm_name</key>
					<string>RepeatingPowerOn</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>wakepoweron</string>
							<key>pfm_description</key>
							<string>The type of action to take at the scheduled time.</string>
							<key>pfm_name</key>
							<string>eventtype</string>
							<key>pfm_range_list</key>
							<array>
								<string>wake</string>
								<string>wakepoweron</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Wake</string>
								<string>Start Up/Wake</string>
							</array>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>31</integer>
							<key>pfm_description</key>
							<string>The days on which the scheduled event occurs.</string>
							<key>pfm_name</key>
							<string>weekdays</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string></string>
									<key>pfm_name</key>
									<string>weekday</string>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
										<integer>2</integer>
										<integer>4</integer>
										<integer>8</integer>
										<integer>16</integer>
										<integer>32</integer>
										<integer>64</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Monday</string>
										<string>Tuesday</string>
										<string>Wednesday</string>
										<string>Thursday</string>
										<string>Friday</string>
										<string>Saturday</string>
										<string>Sunday</string>
									</array>
									<key>pfm_title</key>
									<string>Weekday</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Days to execute</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_type_input</key>
							<string>array</string>
							<key>pfm_value_processor</key>
							<string>weekdaysBitmask2Int</string>
						</dict>
						<dict>
							<key>pfm_date_style</key>
							<string>time</string>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>The time of day to perform the action.</string>
							<key>pfm_name</key>
							<string>time</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Time of day</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_type_input</key>
							<string>date</string>
							<key>pfm_value_processor</key>
							<string>time2minutes</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Start up or wake</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Use this key to describe a repeating shut down, sleep or restart.</string>
					<key>pfm_name</key>
					<string>RepeatingPowerOff</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The type of action to take at the scheduled time.</string>
							<key>pfm_name</key>
							<string>eventtype</string>
							<key>pfm_range_list</key>
							<array>
								<string>sleep</string>
								<string>restart</string>
								<string>shutdown</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Sleep</string>
								<string>Restart</string>
								<string>Shut Down</string>
							</array>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>31</integer>
							<key>pfm_description</key>
							<string>The days on which the scheduled event occurs.</string>
							<key>pfm_name</key>
							<string>weekdays</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string></string>
									<key>pfm_name</key>
									<string>weekday</string>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
										<integer>2</integer>
										<integer>4</integer>
										<integer>8</integer>
										<integer>16</integer>
										<integer>32</integer>
										<integer>64</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Monday</string>
										<string>Tuesday</string>
										<string>Wednesday</string>
										<string>Thursday</string>
										<string>Friday</string>
										<string>Saturday</string>
										<string>Sunday</string>
									</array>
									<key>pfm_title</key>
									<string>Weekday</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Days to execute</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_type_input</key>
							<string>array</string>
							<key>pfm_value_processor</key>
							<string>weekdaysBitmask2Int</string>
						</dict>
						<dict>
							<key>pfm_date_style</key>
							<string>time</string>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>The time of day to perform the action.</string>
							<key>pfm_name</key>
							<string>time</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Time of day</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_type_input</key>
							<string>date</string>
							<key>pfm_value_processor</key>
							<string>time2minutes</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Shut down, sleep or restart</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Power Schedule</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Energy Saver</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
