<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Accessibility Settings</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/accessibility</string>
	<key>pfm_domain</key>
	<string>com.apple.universalaccess</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2023-11-23T13:57:28Z</date>
	<key>pfm_macos_min</key>
	<string>10.9</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Universal Access settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Universal Access</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.universalaccess</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.universalaccess</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables 'Use scroll gesture' in the Zoom options.</string>
			<key>pfm_name</key>
			<string>closeViewScrollWheelToggle</string>
			<key>pfm_title</key>
			<string>Enable Zoom via ScrollWheel</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables 'Use keyboard shortcuts' in the Zoom options.</string>
			<key>pfm_name</key>
			<string>closeViewHotkeysEnabled</string>
			<key>pfm_title</key>
			<string>Enable Zoom via Keyboard</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The maximum zoom level in the Zoom options.</string>
			<key>pfm_name</key>
			<string>closeViewNearPoint</string>
			<key>pfm_range_max</key>
			<integer>40</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Maximum Zoom</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The minimum zoom level in the Zoom options.</string>
			<key>pfm_name</key>
			<string>closeViewFarPoint</string>
			<key>pfm_range_max</key>
			<integer>40</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Minimum Zoom</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables 'Show preview rectangle' in the Zoom options. Only available in macOS 10.15 and earlier.</string>
			<key>pfm_macos_deprecated</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>closeViewShowPreview</string>
			<key>pfm_title</key>
			<string>Show preview rectangle when zoomed out</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_deprecated</key>
					<string>10.15</string>
					<key>pfmx_introduced</key>
					<string>10.9</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables 'Smooth images' in the Zoom options.</string>
			<key>pfm_name</key>
			<string>closeViewSmoothImages</string>
			<key>pfm_title</key>
			<string>Smooth images</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables Invert Colors in Display Accommodations.</string>
			<key>pfm_name</key>
			<string>whiteOnBlack</string>
			<key>pfm_title</key>
			<string>Invert colors</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables 'Use grayscale' in the Display options.
This option is deprecated in macOS 11.</string>
			<key>pfm_macos_deprecated</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>grayscale</string>
			<key>pfm_title</key>
			<string>Use Grayscale</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_deprecated</key>
					<string>11.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>0.0</real>
			<key>pfm_description</key>
			<string>The contrast value in the Display options.</string>
			<key>pfm_name</key>
			<string>contrast</string>
			<key>pfm_range_max</key>
			<real>1</real>
			<key>pfm_range_min</key>
			<real>0.0</real>
			<key>pfm_title</key>
			<string>Display Contrast</string>
			<key>pfm_type</key>
			<string>real</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>1</real>
			<key>pfm_description</key>
			<string>The size of the cursor.</string>
			<key>pfm_name</key>
			<string>mouseDriverCursorSize</string>
			<key>pfm_range_max</key>
			<real>4</real>
			<key>pfm_range_min</key>
			<real>1</real>
			<key>pfm_title</key>
			<string>Cursor Size</string>
			<key>pfm_type</key>
			<string>real</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables Voice Over.</string>
			<key>pfm_name</key>
			<string>voiceOverOnOffKey</string>
			<key>pfm_title</key>
			<string>Enable VoiceOver</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables 'Flash the screen' in the Audio options.</string>
			<key>pfm_name</key>
			<string>flashScreen</string>
			<key>pfm_title</key>
			<string>Flash screen on alert sound</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', plays stereo audio as mono.</string>
			<key>pfm_name</key>
			<string>stereoAsMono</string>
			<key>pfm_title</key>
			<string>Play stereo audio as mono</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables Sticky Keys in the Keyboard options.</string>
			<key>pfm_name</key>
			<string>stickyKey</string>
			<key>pfm_title</key>
			<string>Enable Sticky Keys</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables 'Display pressed keys on screen' for Sticky Keys.</string>
			<key>pfm_name</key>
			<string>stickyKeyShowWindow</string>
			<key>pfm_title</key>
			<string>Display pressed keys on screen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables the beep when a modifier key is set for Sticky Keys.</string>
			<key>pfm_name</key>
			<string>stickyKeyBeepOnModifier</string>
			<key>pfm_title</key>
			<string>Beep when a modifier key is set</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables 'Slow Keys' in the Keyboard options.</string>
			<key>pfm_name</key>
			<string>slowKey</string>
			<key>pfm_title</key>
			<string>Enable Slow Keys</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables 'click key sounds' for Slow Keys.</string>
			<key>pfm_name</key>
			<string>slowKeyBeepOn</string>
			<key>pfm_title</key>
			<string>Use click key sounds</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>250</integer>
			<key>pfm_description</key>
			<string>The acceptance delay, in milliseconds, for Slow Keys.</string>
			<key>pfm_name</key>
			<string>slowKeyDelay</string>
			<key>pfm_title</key>
			<string>Acceptance delay</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>milliseconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables Mouse Keys in the Mouse &amp; Trackpad options.</string>
			<key>pfm_name</key>
			<string>mouseDriver</string>
			<key>pfm_title</key>
			<string>Enable Mouse Keys</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>1</real>
			<key>pfm_description</key>
			<string>The initial delay before moving the mouse with Mouse Keys.</string>
			<key>pfm_name</key>
			<string>mouseDriverInitialDelay</string>
			<key>pfm_title</key>
			<string>Initial delay</string>
			<key>pfm_type</key>
			<string>real</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The maximum speed for the cursor when using Mouse Keys.</string>
			<key>pfm_name</key>
			<string>mouseDriverMaxSpeed</string>
			<key>pfm_range_max</key>
			<integer>32</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Maximum speed</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', ignores the built-in trackpad.</string>
			<key>pfm_name</key>
			<string>mouseDriverIgnoreTrackpad</string>
			<key>pfm_title</key>
			<string>Ignore built-in trackpad</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Accessibility</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>macOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_device_channel</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>10.9</string>
			<key>pfmx_multiple</key>
			<false/>
			<key>pfmx_requires_dep</key>
			<false/>
			<key>pfmx_user_approved_mdm</key>
			<false/>
			<key>pfmx_user_channel</key>
			<true/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>forbidden</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
