<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define restrictions settings</string>
	<key>pfm_description_reference</key>
	<string>The Restrictions payload is designated by specifying com.apple.applicationaccess as the PayloadType value. A Restrictions payload allows the administrator to restrict the user from doing certain things with the device, such as using the camera. The Restrictions payload is supported in iOS; some keys are also supported in macOS, as noted below.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/restrictions</string>
	<key>pfm_domain</key>
	<string>com.apple.applicationaccess</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_ios_min</key>
	<string>4.0</string>
	<key>pfm_last_modified</key>
	<date>2024-12-13T08:49:11Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
	</array>
	<key>pfm_subdomain</key>
	<string>iOS</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Use this section to define restrictions settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Restrictions</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.applicationaccess</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.applicationaccess</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>AI and Siri</string>
				<string>AirDrop</string>
				<string>AirPlay</string>
				<string>AirPrint</string>
				<string>Apps</string>
				<string>Classroom</string>
				<string>iCloud</string>
				<string>Media</string>
				<string>Passwords / Unlock</string>
				<string>Updates</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>AI and Siri</key>
				<array>
					<string>allowAssistant</string>
					<string>allowAssistantUserGeneratedContent</string>
					<string>allowAssistantWhileLocked</string>
					<string>allowSiriServerLogging</string>
					<string>allowSpotlightInternetResults</string>
					<string>forceAssistantProfanityFilter</string>
					<string>allowGenmoji</string>
					<string>allowImagePlayground</string>
					<string>allowImageWand</string>
					<string>allowWritingTools</string>
					<string>allowPersonalizedHandwritingResults</string>
					<string>allowMailSummary</string>
					<string>allowExternalIntelligenceIntegrations</string>
					<string>allowExternalIntelligenceIntegrationsSignIn</string>
				</array>
				<key>AirDrop</key>
				<array>
					<string>allowAirDrop</string>
					<string>forceAirDropUnmanaged</string>
				</array>
				<key>AirPlay</key>
				<array>
					<string>forceAirPlayOutgoingRequestsPairingPassword</string>
				</array>
				<key>AirPrint</key>
				<array>
					<string>allowAirPrint</string>
					<string>allowAirPrintCredentialsStorage</string>
					<string>allowAirPrintiBeaconDiscovery</string>
					<string>forceAirPrintTrustedTLSRequirement</string>
				</array>
				<key>Apps</key>
				<array>
					<string>allowAddingGameCenterFriends</string>
					<string>allowAppClips</string>
					<string>allowAppInstallation</string>
					<string>allowAppRemoval</string>
					<string>allowAutomaticAppDownloads</string>
					<string>allowBookstore</string>
					<string>allowChat</string>
					<string>allowGameCenter</string>
					<string>allowInAppPurchases</string>
					<string>allowListedAppBundleIDs</string>
					<string>allowMultiplayerGaming</string>
					<string>allowMusicService</string>
					<string>allowNews</string>
					<string>allowPodcasts</string>
					<string>allowRadioService</string>
					<string>allowSafari</string>
					<string>allowSystemAppRemoval</string>
					<string>allowUIAppInstallation</string>
					<string>allowMarketplaceAppInstallation</string>
					<string>allowWebDistributionAppInstallation</string>
					<string>allowYouTube</string>
					<string>allowiTunes</string>
					<string>allowAppsToBeHidden</string>
					<string>allowAppsToBeLocked</string>
					<string>blacklistedAppBundleIDs</string>
					<string>blockedAppBundleIDs</string>
					<string>safariAcceptCookies</string>
					<string>safariAllowAutoFill</string>
					<string>safariAllowJavaScript</string>
					<string>safariAllowPopups</string>
					<string>safariForceFraudWarning</string>
					<string>whitelistedAppBundleIDs</string>
					<string>autonomousSingleAppModePermittedAppIDs</string>
				</array>
				<key>Classroom</key>
				<array>
					<string>forceClassroomAutomaticallyJoinClasses</string>
					<string>forceClassroomRequestPermissionToLeaveClasses</string>
					<string>forceClassroomUnpromptedAppAndDeviceLock</string>
					<string>forceClassroomUnpromptedScreenObservation</string>
					<string>forceUnpromptedManagedClassroomScreenObservation</string>
				</array>
				<key>General</key>
				<array>
					<string>allowAccountModification</string>
					<string>allowActivityContinuation</string>
					<string>allowAppCellularDataModification</string>
					<string>allowApplePersonalizedAdvertising</string>
					<string>allowAutoCorrection</string>
					<string>allowBluetoothModification</string>
					<string>allowCamera</string>
					<string>allowCellularPlanModification</string>
					<string>allowContinuousPathKeyboard</string>
					<string>allowDefinitionLookup</string>
					<string>allowDeprecatedWebKitTLS</string>
					<string>allowDeviceNameModification</string>
					<string>allowDiagnosticSubmission</string>
					<string>allowDiagnosticSubmissionModification</string>
					<string>allowDictation</string>
					<string>allowESIMModification</string>
					<string>allowEnablingRestrictions</string>
					<string>allowEnterpriseAppTrust</string>
					<string>allowEraseContentAndSettings</string>
					<string>allowFindMyDevice</string>
					<string>allowFindMyFriends</string>
					<string>allowFindMyFriendsModification</string>
					<string>allowGlobalBackgroundFetchWhenRoaming</string>
					<string>allowHostPairing</string>
					<string>allowiPhoneWidgetsOnMac</string>
					<string>allowKeyboardShortcuts</string>
					<string>allowLiveVoicemail</string>
					<string>allowLockScreenControlCenter</string>
					<string>allowLockScreenNotificationsView</string>
					<string>allowLockScreenTodayView</string>
					<string>allowMailPrivacyProtection</string>
					<string>allowAutoDim</string>
					<string>allowManagedToWriteUnmanagedContacts</string>
					<string>allowNFC</string>
					<string>allowNotificationsModification</string>
					<string>allowOTAPKIUpdates</string>
					<string>allowOpenFromManagedToUnmanaged</string>
					<string>allowOpenFromUnmanagedToManaged</string>
					<string>allowPairedWatch</string>
					<string>allowPassbookWhileLocked</string>
					<string>allowPersonalHotspotModification</string>
					<string>allowPredictiveKeyboard</string>
					<string>allowProximitySetupToNewDevice</string>
					<string>allowRemoteScreenObservation</string>
					<string>allowScreenshot</string>
					<string>allowSharedDeviceTemporarySession</string>
					<string>allowSpellCheck</string>
					<string>allowUIConfigurationProfileInstallation</string>
					<string>allowUSBRestrictedMode</string>
					<string>allowUnmanagedToReadManagedContacts</string>
					<string>allowUnpairedExternalBootToRecovery</string>
					<string>allowUntrustedTLSPrompt</string>
					<string>allowVPNCreation</string>
					<string>allowVideoConferencing</string>
					<string>allowVoiceDialing</string>
					<string>allowWallpaperModification</string>
					<string>forceAuthenticationBeforeAutoFill</string>
					<string>forceAutomaticDateAndTime</string>
					<string>forceEncryptedBackup</string>
					<string>forceITunesStorePasswordEntry</string>
					<string>forceLimitAdTracking</string>
					<string>forceOnDeviceOnlyDictation</string>
					<string>forceOnDeviceOnlyTranslation</string>
					<string>forceWatchWristDetection</string>
					<string>forceWiFiPowerOn</string>
					<string>forceWiFiToAllowedNetworksOnly</string>
					<string>forceWiFiWhitelisting</string>
					<string>requireManagedPasteboard</string>
					<string>allowESIMOutgoingTransfers</string>
					<string>allowiPhoneMirroring</string>
					<string>allowCallRecording</string>
					<string>allowRCSMessaging</string>
					<string>allowDefaultBrowserModification</string>
					<string>allowSatelliteConnection</string>
				</array>
				<key>Media</key>
				<array>
					<string>allowBookstoreErotica</string>
					<string>allowExplicitContent</string>
					<string>allowFilesNetworkDriveAccess</string>
					<string>allowFilesUSBDriveAccess</string>
					<string>ratingApps</string>
					<string>ratingMovies</string>
					<string>ratingRegion</string>
					<string>ratingTVShows</string>
				</array>
				<key>Passwords / Unlock</key>
				<array>
					<string>allowAutoUnlock</string>
					<string>allowFingerprintForUnlock</string>
					<string>allowFingerprintModification</string>
					<string>allowPasscodeModification</string>
					<string>allowPasswordAutoFill</string>
					<string>allowPasswordProximityRequests</string>
					<string>allowPasswordSharing</string>
				</array>
				<key>Updates</key>
				<array>
					<string>enforcedSoftwareUpdateDelay</string>
					<string>forceDelayedSoftwareUpdates</string>
					<string>allowRapidSecurityResponseInstallation</string>
					<string>allowRapidSecurityResponseRemoval</string>
				</array>
				<key>iCloud</key>
				<array>
					<string>allowCloudBackup</string>
					<string>allowCloudDocumentSync</string>
					<string>allowCloudKeychainSync</string>
					<string>allowCloudPhotoLibrary</string>
					<string>allowCloudPrivateRelay</string>
					<string>allowEnterpriseBookBackup</string>
					<string>allowEnterpriseBookMetadataSync</string>
					<string>allowManagedAppsCloudSync</string>
					<string>allowPhotoStream</string>
					<string>allowSharedStream</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the camera and removes its icon from the Home screen, and users are unable to take photographs. Available in iOS 4 and later, macOS 10.11 and later, and tvOS 17 and later. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>allowCamera</string>
			<key>pfm_title</key>
			<string>Allow Camera</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system hides the FaceTime app. Available in iOS 4 and later. Requires a supervised device in iOS 13 and later.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>allowVideoConferencing</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow FaceTime</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables backing up the device to iCloud. Available in iOS 5 and later. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>allowCloudBackup</string>
			<key>pfm_title</key>
			<string>Allow iCloud Backup</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iCloud Photo Library. The system removes any photos from local storage that aren't fully downloaded from iCloud Photo Library to the device. Available in iOS 9 and later, and macOS 10.12 and later. Support for this restriction on unsupervised devices and with Managed Apple Accounts is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>9.0</string>
			<key>pfm_name</key>
			<string>allowCloudPhotoLibrary</string>
			<key>pfm_title</key>
			<string>Allow iCloud Photo Library</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Photo Stream. Available in iOS 5 and later. This restriction is deprecated and will be removed in a future release.</string>
			<key>pfm_ios_deprecated</key>
			<string>17.0</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>allowPhotoStream</string>
			<key>pfm_title</key>
			<string>Allow Photo Stream</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Shared Photo Stream. Available in iOS 6 and later. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>6.0</string>
			<key>pfm_name</key>
			<string>allowSharedStream</string>
			<key>pfm_title</key>
			<string>Allow iCloud Photo Sharing</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables:
* The AutoFill Passwords feature in iOS, with Keychain and third-party password managers
* Prompting the user to use a saved password in Safari or in apps
* Automatic strong passwords
* Suggesting strong passwords to users
However, if 'false', the system doesn't prevent AutoFill for contact info and credit cards in Safari.
Available in iOS 12 and later, and macOS 10.14 and later. Requires a supervised device in iOS.</string>
			<key>pfm_ios_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>allowPasswordAutoFill</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow password AutoFill</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disallows auto unlock. Available in macOS 10.12 and later, and iOS 14.5 and later. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>14.5</string>
			<key>pfm_name</key>
			<string>allowAutoUnlock</string>
			<key>pfm_title</key>
			<string>Allow Apple Watch to auto unlock device</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents Touch ID or Face ID from unlocking a device. Available in iOS 7 and later, and macOS 10.12.4 and later. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowFingerprintForUnlock</string>
			<key>pfm_title</key>
			<string>Allow Touch ID / Face ID to unlock device</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system removes the Book Store tab from the Books app. Requires a supervised device. Available in iOS 6 and later and macOS 15 and later.</string>
			<key>pfm_ios_min</key>
			<string>6.0</string>
			<key>pfm_name</key>
			<string>allowBookstore</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Bookstore</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the use of iMessage with supervised devices. If the device supports text messaging, the user can still send and receive text messages. Requires a supervised device. Available in iOS 5 and later.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>allowChat</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow iMessage</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the iTunes Music Store, and the system removes its icon from the Home screen. Users can't preview, purchase, or download content. Available in iOS 4 and later. Requires a supervised device in iOS 13 and later.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>allowiTunes</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow iTunes Store</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the Music service, and the Music app reverts to classic mode. Requires a supervised device. Available in iOS 9.3 and later, and macOS 10.12 and later.</string>
			<key>pfm_ios_min</key>
			<string>9.3</string>
			<key>pfm_name</key>
			<string>allowMusicService</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Apple Music</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables News. Requires a supervised device. Available in iOS 9 and later.</string>
			<key>pfm_ios_min</key>
			<string>9.0</string>
			<key>pfm_name</key>
			<string>allowNews</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow News</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables podcasts. Requires a supervised device. Available in iOS 8 and later.</string>
			<key>pfm_ios_min</key>
			<string>8.0</string>
			<key>pfm_name</key>
			<string>allowPodcasts</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Podcasts</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Apple Music Radio. Requires a supervised device. Available in iOS 9.3 and later.</string>
			<key>pfm_ios_min</key>
			<string>9.3</string>
			<key>pfm_name</key>
			<string>allowRadioService</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow iTunes Radio</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>This key is ignored on iOS 6 and later because the YouTube app is no longer built in.</string>
			<key>pfm_description_reference</key>
			<string>Optional. When false, the YouTube application is disabled and its icon is removed from the Home screen. This key is ignored in iOS 6 and later because the YouTube app is not provided.</string>
			<key>pfm_ios_deprecated</key>
			<string>6.0</string>
			<key>pfm_name</key>
			<string>allowYouTube</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Apple's YouTube</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables the ability for the user to hide apps. It doesn't affect the user's ability to leave it in the App Library, while removing it from the home screen. Available in iOS 18 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.0</string>
			<key>pfm_name</key>
			<string>allowAppsToBeHidden</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Hiding Apps</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables the ability for the user to lock apps. Because hiding apps also requires locking them, disallowing locking also disallows hiding. Available in iOS 18 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.0</string>
			<key>pfm_name</key>
			<string>allowAppsToBeLocked</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Locking Apps</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables document and key-value syncing to iCloud. Available in iOS 5 and later, and macOS 10.11 and later. Requires a supervised device in iOS 13 and later, and Shared iPad doesn't support it. Support for this restriction on unsupervised devices and with Managed Apple Accounts is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>allowCloudDocumentSync</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow iCloud Document Sync</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iCloud keychain synchronization. Available in iOS 7 and later, and macOS 10.12 and later. Support for this restriction on unsupervised devices and with Managed Apple Accounts is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowCloudKeychainSync</string>
			<key>pfm_title</key>
			<string>Allow iCloud Keychain</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables definition lookup. Available in iOS 8.1.3 and later, and macOS 10.11 and later. Requires a supervised device on iOS.</string>
			<key>pfm_ios_min</key>
			<string>8.1.3</string>
			<key>pfm_name</key>
			<string>allowDefinitionLookup</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow definition lookup</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Allow websites that use TLS 1.0 and TLS 1.1 to be accessed using Safari.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jamf.com/10.20.0/jamf-pro/release-notes/What%27s_New.html</string>
			<key>pfm_ios_min</key>
			<string>13.4</string>
			<key>pfm_name</key>
			<string>allowDeprecatedWebKitTLS</string>
			<key>pfm_title</key>
			<string>Allow accessing websites using TLS 1.0 and 1.1</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables AirPrint. Requires a supervised device. Available in iOS 11 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>allowAirPrint</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow AirPrint</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iBeacon discovery of AirPrint printers, which prevents spurious AirPrint Bluetooth beacons from phishing for network traffic. Requires a supervised device. Available in iOS 11 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>allowAirPrintiBeaconDiscovery</string>
			<key>pfm_note</key>
			<string>Apple documentation does not indicate that this preference is supported on macOS, but Jamf includes it with a min macOS of 10.13.</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow discovery of AirPrint printers using iBeacons</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system requires trusted certificates for TLS printing communication. Requires a supervised device. Available in iOS 11 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>forceAirPrintTrustedTLSRequirement</string>
			<key>pfm_note</key>
			<string>Apple documentation does not indicate that this preference is supported on macOS, but Jamf includes it with a min macOS of 10.13.</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Disallow AirPrint to destinations with untrusted certificates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables saving a screenshot of the display and capturing a screen recording. It also disables the Classroom app from observing remote screens. Available in iOS 4 and later, and macOS 10.14.4 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>3.1</string>
			<key>pfm_name</key>
			<string>allowScreenShot</string>
			<key>pfm_title</key>
			<string>Allow Screenshots and Screen Recording</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables remote screen observation by the Classroom app. Nest this key beneath 'allowScreenShot' as a subrestriction. If 'allowScreenShot' is 'false', the Classroom app doesn't observe remote screens. Available in iOS 12 and later, and macOS 10.14.4 and later. Requires a supervised device until iOS 13 and macOS 10.15. Allowed for user enrollments in macOS 12 and later.</string>
			<key>pfm_ios_min</key>
			<string>9.3</string>
			<key>pfm_name</key>
			<string>allowRemoteScreenObservation</string>
			<key>pfm_title</key>
			<string>Allow Remote Screen Observation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true' and 'ScreenObservationPermissionModificationAllowed' is also 'true' in the Education payload, a student enrolled in a managed course through the Classroom app automatically gives permission to that course teacher's requests to observe the student's screen without prompting the student. Requires a supervised device. Available in iOS 11 and later, and macOS 10.14.4 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_domain</key>
							<string>com.apple.education</string>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>ScreenObservationPermissionModificationAllowed</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>forceClassroomUnpromptedScreenObservation</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Classroom app to perform AirPlay and View Screen without prompting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Deprecated in iOS 11. Use forceClassroomUnpromptedScreenObservation instead.</string>
			<key>pfm_description_reference</key>
			<string>Deprecated in iOS 11. Use forceClassroomUnpromptedScreenObservation instead.</string>
			<key>pfm_ios_deprecated</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>forceUnpromptedManagedClassroomScreenObservation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables voice dialing if the device is locked with a passcode. Available in iOS 4 and later.</string>
			<key>pfm_ios_deprecated</key>
			<string>17.0</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>allowVoiceDialing</string>
			<key>pfm_title</key>
			<string>Allow Voice Dialing While Device is Locked</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Siri. Available in iOS 5 and later, and macOS 14 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>allowAssistant</string>
			<key>pfm_title</key>
			<string>Allow Siri</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Siri when the device is locked. The system ignores this restriction if the device doesn't have a passcode set. Available in iOS 5.1 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>5.1</string>
			<key>pfm_name</key>
			<string>allowAssistantWhileLocked</string>
			<key>pfm_title</key>
			<string>Allow Siri While Locked</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system forces the use of the profanity filter for Siri and dictation. Available in iOS 11 and later, and macOS 10.13 and later. Requires a supervised device in iOS.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>forceAssistantProfanityFilter</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Enable Siri Profanity Filter</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents Siri from querying user-generated content from the web. Requires a supervised device. Available in iOS 7 and later, and watchOS 10 and later.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowAssistantUserGeneratedContent</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Show user-generated content in Siri</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Allow server-side logging of Siri commands</string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jamf.com/10.11.0/jamf-pro/release-notes/What's_New.html</string>
			<key>pfm_ios_min</key>
			<string>12.2</string>
			<key>pfm_name</key>
			<string>allowSiriServerLogging</string>
			<key>pfm_title</key>
			<string>Allow server-side logging of Siri commands</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Spotlight Internet search results in Siri Suggestions. Available in iOS 8 and later, and macOS 10.11 and later. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>8.0</string>
			<key>pfm_name</key>
			<string>allowSpotlightInternetResults</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Siri Suggestions</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the App Store, and the system removes its icon from the Home screen. Users are unable to install or update their apps. This applies to App Store apps, marketplace apps, and locally installed apps (using Configurator, Xcode, etc).
In iOS 10 and later, MDM commands can override this restriction. Available in iOS 4 and later, and watchOS 10 and later. Requires a supervised device in iOS 13 and later, and watchOS.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>allowAppInstallation</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow App Installation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the App Store, and the systems removes its icon from the Home screen. However, users may continue to install or update their apps either locally (via Configurator, Xcode, etc), or using alternative marketplace apps.
In iOS 10 and later, MDM commands can override this restriction. Requires a supervised device. Available in iOS 9 and later, and watchOS 10 and later.</string>
			<key>pfm_ios_min</key>
			<string>9.0</string>
			<key>pfm_name</key>
			<string>allowUIAppInstallation</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow App Installation from App Store</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents automatic downloading of apps purchased on other devices. This setting doesn't affect updates to existing apps. Requires a supervised device. Available in iOS 9 and later, and watchOS 10 and later.</string>
			<key>pfm_ios_min</key>
			<string>9.0</string>
			<key>pfm_name</key>
			<string>allowAutomaticAppDownloads</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Automatic App Downloads</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents installation of alternative marketplace apps from the web and prevents any installed alternative marketplace apps from installing apps. Available in iOS 17.4 and later. Requires a supervised device.</string>
			<key>pfm_ios_min</key>
			<string>17.4</string>
			<key>pfm_name</key>
			<string>allowMarketplaceAppInstallation</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow App Installation from alternative marketplaces</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the device prevents installation of apps directly from the web. Available in iOS 17.5 and later.</string>
			<key>pfm_ios_min</key>
			<string>17.5</string>
			<key>pfm_name</key>
			<string>allowWebDistributionAppInstallation</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow App Installation from web sites</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables removal of apps from an iOS device. This applies to App Store apps, marketplace apps, and locally installed apps (using Configurator, Xcode, etc).
Requires a supervised device. Available in iOS 4.2.1 and later, and watchOS 10 and later.</string>
			<key>pfm_ios_min</key>
			<string>4.2.1</string>
			<key>pfm_name</key>
			<string>allowAppRemoval</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow App Removal</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents a user from adding any App Clips, and removes any existing App Clips on the device. Requires a supervised device. Available in iOS 14.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowAppClips</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow App Clips</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the removal of system apps from the device. Requires a supervised device. Available in iOS 11 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>allowSystemAppRemoval</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow removing system apps</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prohibits in-app purchasing. Available in iOS 4 and later. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>allowInAppPurchases</string>
			<key>pfm_title</key>
			<string>Allow In App Purchases</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system forces the user to enter their iTunes password for each transaction. Available in iOS 6 and later.</string>
			<key>pfm_ios_deprecated</key>
			<string>17.0</string>
			<key>pfm_ios_min</key>
			<string>6.0</string>
			<key>pfm_name</key>
			<string>forceITunesStorePasswordEntry</string>
			<key>pfm_title</key>
			<string>Require iTunes password for all purchases</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents managed apps from using iCloud sync. Available in iOS 8 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>8.0</string>
			<key>pfm_name</key>
			<string>allowManagedAppsCloudSync</string>
			<key>pfm_title</key>
			<string>Allow iCloud Sync for Managed Apps</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables backup of Enterprise books. Available in iOS 8 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>8.0</string>
			<key>pfm_name</key>
			<string>allowEnterpriseBookBackup</string>
			<key>pfm_title</key>
			<string>Allow Enterprise Books Backup</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables sync of Enterprise books, notes, and highlights. Available in iOS 8 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>8.0</string>
			<key>pfm_name</key>
			<string>allowEnterpriseBookMetadataSync</string>
			<key>pfm_title</key>
			<string>Allow Enterprise Books Notes and Highlights Sync</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iCloud Private Relay. Available in iOS 15 and later, and in macOS 12 and later. Requires a supervised device in iOS. Support for this restriction on unsupervised devices and with Managed Apple Accounts is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>allowCloudPrivateRelay</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow iCloud Private Relay</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables global background fetch activity when an iOS phone is roaming. Available in iOS 4 and later. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>allowGlobalBackgroundFetchWhenRoaming</string>
			<key>pfm_title</key>
			<string>Allow Automatic Sync While Roaming</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system encrypts all backups. Available in iOS 4 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>forceEncryptedBackup</string>
			<key>pfm_title</key>
			<string>Force Encrypted Backups</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the Erase All Content and Settings option in the Reset UI. Available in iOS 8 and later, and macOS 12 and later. Requires a supervised device in iOS.</string>
			<key>pfm_ios_min</key>
			<string>8.0</string>
			<key>pfm_name</key>
			<string>allowEraseContentAndSettings</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Erase All Content and Settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system preserves eSIM when it erases the device due to too many failed password attempts or the Erase All Content and Settings option in Settings &gt; General &gt; Reset. Requires a supervised device. Available in iOS 17.2 and later.
The system doesn't preserve eSIM if Find My initiates erasing the device.</string>
			<key>pfm_ios_min</key>
			<string>17.2</string>
			<key>pfm_name</key>
			<string>forcePreserveESIMOnErase</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Force Preserve ESIM on Erase</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system automatically rejects untrusted HTTPS certificates without prompting the user. Available in iOS 5 and later.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>allowUntrustedTLSPrompt</string>
			<key>pfm_title</key>
			<string>Allow user to accept untrusted TLS certificates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system removes the Trust Developer button in Settings &gt; General &gt; VPN &amp; Device Management, which prevents provisioning apps by universal provisioning profiles. This restriction applies to both free developer accounts and enterprise app developers that are not implicitly trusted by apps installed through MDM. This restriction does not revoke previously granted trust. Available in iOS 9 and later.</string>
			<key>pfm_ios_min</key>
			<string>9.0</string>
			<key>pfm_name</key>
			<string>allowEnterpriseAppTrust</string>
			<key>pfm_title</key>
			<string>Allow Trusting Enterprise Apps</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables over-the-air PKI updates. Setting this restriction to 'false' doesn't disable CRL and OCSP checks. Available in iOS 7 and later.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowOTAPKIUpdates</string>
			<key>pfm_title</key>
			<string>Allow automatic updates to certificate trust settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prohibits the user from installing configuration profiles and certificates interactively. Available in iOS 6 and later, and macOS 13 and later. Requires a supervised device in iOS.</string>
			<key>pfm_ios_min</key>
			<string>6.0</string>
			<key>pfm_name</key>
			<string>allowUIConfigurationProfileInstallation</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow UI Configuration Profile Installation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the creation of VPN configurations. Requires a supervised device. Available in iOS 11 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>allowVPNCreation</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Adding VPN Configurations (Supervised devices only)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the Set Automatically feature in Date &amp; Time and the user can't disable it. The system updates the device's time zone only when the device can determine its location using a cellular connection or Wi-Fi with location services enabled. Requires a supervised device. Available in iOS 12 and later, and tvOS 12.2 and later.</string>
			<key>pfm_ios_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>forceAutomaticDateAndTime</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Force automatic date and time</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system allows the teacher to lock apps or the device without prompting the student. Requires a supervised device. Available in iOS 11 and later, and macOS 10.14.4 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>forceClassroomUnpromptedAppAndDeviceLock</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Classroom to lock apps or the device without prompting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system automatically gives permission to the teacher's requests without prompting the student. Requires a supervised device. Available in iOS 11 and later, and macOS 10.14.4 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>forceClassroomAutomaticallyJoinClasses</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Automatically join Classroom classes without prompting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', a student enrolled in an unmanaged course through Classroom needs to request permission from the teacher to leave the course. Requires a supervised device. Available in iOS 11.3 and later, and macOS 10.14.4 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.3</string>
			<key>pfm_name</key>
			<string>forceClassroomRequestPermissionToLeaveClasses</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Require teacher permission to leave Classroom app unmanaged classes</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables modification of accounts such as Apple Accounts and Internet-based accounts such as Mail, Contacts, and Calendar. Available in iOS 7 and later, macOS 14 and later, and watchOS 10 and later. Requires a supervised device in iOS and watchOS.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowAccountModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow modifying account settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents modification of Bluetooth settings. Requires a supervised device. Available in iOS 11 and later, and macOS 13.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>allowBluetoothModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow modifying Bluetooth settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables changing settings for cellular data usage for apps. Requires a supervised device. Available in iOS 7 and later.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowAppCellularDataModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Modifying Cellular Data Usage for Apps Settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents users from changing settings related to their cellular plan (only available on select carriers). Requires a supervised device. Available in iOS 11 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>allowCellularPlanModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow modifying celluar plan settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables modifications of eSIMs. Requires a supervised device. Available in iOS 12.1 and later.</string>
			<key>pfm_ios_min</key>
			<string>12.1</string>
			<key>pfm_name</key>
			<string>allowESIMModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow eSIM Modification</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables changes to Find My Friends. Requires a supervised device. Available in iOS 7 and later.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowFindMyFriendsModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow modifying Find My Friends settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables modification of notification settings. Requires a supervised device. Available in iOS 9.3 and later.</string>
			<key>pfm_ios_min</key>
			<string>9.3</string>
			<key>pfm_name</key>
			<string>allowNotificationsModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Modifying Notifications Settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables NFC. Requires a supervised device. Available in iOS 14.2 and later.</string>
			<key>pfm_ios_min</key>
			<string>14.2</string>
			<key>pfm_name</key>
			<string>allowNFC</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow NFC</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents adding, changing, or removing the passcode. The system ignores this restriction on Shared iPad. Available in iOS 9 and later, and macOS 10.13 and later. Requires a supervised device in iOS.</string>
			<key>pfm_ios_min</key>
			<string>9.0</string>
			<key>pfm_name</key>
			<string>allowPasscodeModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Modifying Passcode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents the user from modifying Touch ID or Face ID. Available in iOS 8.3 and later, and macOS 14 and later. Requires a supervised device in iOS.</string>
			<key>pfm_ios_min</key>
			<string>8.3</string>
			<key>pfm_name</key>
			<string>allowFingerprintModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow modifying Touch ID / Face ID</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the Enable Restrictions option in the Restrictions UI in Settings. If 'false' in iOS 12 and later, the system disables the Enable ScreenTime option in the ScreenTime UI in Settings and disables ScreenTime if already enabled. Requires a supervised device. Available in iOS 8 and later.</string>
			<key>pfm_ios_min</key>
			<string>8.0</string>
			<key>pfm_name</key>
			<string>allowEnablingRestrictions</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Configuring Restrictions or ScreenTime</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents changing the wallpaper. Available in iOS 9 and later, and macOS 10.13 and later. Requires a supervised device in iOS.</string>
			<key>pfm_ios_min</key>
			<string>9.0</string>
			<key>pfm_name</key>
			<string>allowWallpaperModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Modifying Wallpaper</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system allows iOS devices to always connect to USB accessories while locked. On macOS, allows new USB and Thunderbolt accessories and SD cards to connect without authorization. If the system has Lockdown mode enabled, it ignores this value. Available in iOS 11.4.1 and later, and macOS 13 and later. Requires a supervised device in iOS.</string>
			<key>pfm_ios_min</key>
			<string>11.4.1</string>
			<key>pfm_name</key>
			<string>allowUSBRestrictedMode</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow USB Restricted Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables host pairing with the exception of the supervision host. If there's no configured supervision host certificate, the system disables all pairing. Host pairing lets the administrator control if an iOS device can pair with a host Mac or PC. Requires a supervised device. Available in iOS 7 and later.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowHostPairing</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow pairing with non-Configurator hosts</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disallows iPhone widgets on a Mac that has signed in the same Apple Account for iCloud. Requires a supervised device. Available on iOS 17 and later.</string>
			<key>pfm_ios_min</key>
			<string>17.0</string>
			<key>pfm_name</key>
			<string>allowiPhoneWidgetsOnMac</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow iPhone widget on Mac</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system allows unpaired devices to boot devices into recovery. Requires a supervised device. Available in iOS 14.5 and later.</string>
			<key>pfm_ios_min</key>
			<string>14.5</string>
			<key>pfm_name</key>
			<string>allowUnpairedExternalBootToRecovery</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow booting into recovery by unpaired devices</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', documents in managed apps and accounts only open in other managed apps and accounts. Available in iOS 7 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowOpenFromManagedToUnmanaged</string>
			<key>pfm_title</key>
			<string>Enable allow open from managed to unmanaged</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', documents in unmanaged apps and accounts only open in other unmanaged apps and accounts. Available in iOS 7 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowOpenFromUnmanagedToManaged</string>
			<key>pfm_title</key>
			<string>Enable allow open from unmanaged to managed</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system allows unmanaged apps to read from managed contacts accounts. If 'allowOpenFromManagedToUnmanaged' is 'true', this restriction has no effect. Available in iOS 12 and later.
Use MDM to install profiles that contain this restriction.</string>
			<key>pfm_ios_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>allowUnmanagedToReadManagedContacts</string>
			<key>pfm_title</key>
			<string>Allow unmanaged apps to read managed contacts accounts</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system allows managed apps to write contacts to unmanaged accounts. If 'allowOpenFromManagedToUnmanaged' is 'true', this restriction has no effect. Available in iOS 12 and later.
Use MDM to install profiles that contain this restriction.</string>
			<key>pfm_ios_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>allowManagedToWriteUnmanagedContacts</string>
			<key>pfm_title</key>
			<string>Allow managed apps to write to managed contacts accounts</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', copy and paste functionality is limited by the 'allowOpenFromManagedToUnmanaged' and 'allowOpenFromUnmanagedToManaged' restrictions. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>requireManagedPasteboard</string>
			<key>pfm_title</key>
			<string>Require managed pasteboard</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables AirDrop. Requires a supervised device. Available in iOS 7 and later, and macOS 10.13 and later.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowAirDrop</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow AirDrop</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system considers AirDrop to be an unmanaged drop target. Available in iOS 9 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>9.0</string>
			<key>pfm_name</key>
			<string>forceAirDropUnmanaged</string>
			<key>pfm_title</key>
			<string>Treat AirDrop as Unmanaged Destination</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables activity continuation. Available in iOS 8 and later, and macOS 10.15 and later. Support for this restriction on unsupervised devices and with Managed Apple Accounts is deprecated. In a future release, this restriction will begin requiring supervision and will apply to personal Apple Accounts only.</string>
			<key>pfm_ios_min</key>
			<string>8.0</string>
			<key>pfm_name</key>
			<string>allowActivityContinuation</string>
			<key>pfm_title</key>
			<string>Allow Handoff</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents the device from automatically submitting diagnostic reports to Apple. Available in iOS 6 and later, and macOS 10.13 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>6.0</string>
			<key>pfm_name</key>
			<string>allowDiagnosticSubmission</string>
			<key>pfm_title</key>
			<string>Allow diagnostic submission</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables changing the diagnostic submission and app analytics settings in the Diagnostics &amp; Usage UI in Settings. Requires a supervised device. Available in iOS 9.3.2 and later.</string>
			<key>pfm_ios_min</key>
			<string>9.3.2</string>
			<key>pfm_name</key>
			<string>allowDiagnosticSubmissionModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow modifying diagnostics settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the user needs to authenticate before the system can autofill passwords or credit card information in Safari and apps. If this restriction isn't enforced, the user can toggle this feature in Settings. Only supported on devices with Face ID or Touch ID. Requires a supervised device. Available in iOS 11 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>forceAuthenticationBeforeAutoFill</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Require Touch ID / Face ID authentication before Autofill</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables pairing with an Apple Watch, and the system unpairs any currently paired Apple Watch and erases its content. Requires a supervised device. Available in iOS 9 and later.</string>
			<key>pfm_ios_min</key>
			<string>9.0</string>
			<key>pfm_name</key>
			<string>allowPairedWatch</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Pairing With Apple Watch</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system forces a paired Apple Watch to use Wrist Detection. Available in iOS 8.2 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>8.2</string>
			<key>pfm_name</key>
			<string>forceWatchWristDetection</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Force Apple Watch Wrist Detection</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system prevents turning off Wi-Fi in Settings or Control Center, even by entering or leaving Airplane Mode. It doesn't prevent selecting which Wi-Fi network to use. Requires a supervised device. Available in iOS 13.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>forceWiFiPowerOn</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Disallow Wi-Fi from being turned off</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system limits the device to only join Wi-Fi networks set up through a configuration profile. Requires a supervised device. Available in iOS 14.5 and later.</string>
			<key>pfm_ios_min</key>
			<string>14.5</string>
			<key>pfm_name</key>
			<string>forceWiFiToAllowedNetworksOnly</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Join only Wi-Fi networks installed by a Wi-Fi payload</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Use 'forceWiFiToAllowedNetworksOnly' instead.</string>
			<key>pfm_ios_deprecated</key>
			<string>14.5</string>
			<key>pfm_ios_min</key>
			<string>10.3</string>
			<key>pfm_name</key>
			<string>forceWiFiWhitelisting</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Only join Wi-Fi networks installed by profiles</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables the prompt to set up new devices that are nearby. Requires a supervised device. Available in iOS 11 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>allowProximitySetupToNewDevice</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow setting up new nearby iOS devices</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables predictive keyboards. Requires a supervised device. Available in iOS 8.1.3 and later.</string>
			<key>pfm_ios_min</key>
			<string>8.1.3</string>
			<key>pfm_name</key>
			<string>allowPredictiveKeyboard</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Predictive Keyboard</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables keyboard shortcuts. Requires a supervised device. Available in iOS 9 and later.</string>
			<key>pfm_ios_min</key>
			<string>9.0</string>
			<key>pfm_name</key>
			<string>allowKeyboardShortcuts</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Keyboard Shortcuts</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables keyboard autocorrection. Requires a supervised device. Available in iOS 8.1.3 and later.</string>
			<key>pfm_ios_min</key>
			<string>8.1.3</string>
			<key>pfm_name</key>
			<string>allowAutoCorrection</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Auto Correction</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables QuickPath keyboard. Requires a supervised device. Available in iOS 13 and later.</string>
			<key>pfm_ios_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>allowContinuousPathKeyboard</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Continuous Path Keyboard</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the keyboard spell checker. Requires a supervised device. Available in iOS 8.1.3 and later.</string>
			<key>pfm_ios_min</key>
			<string>8.1.3</string>
			<key>pfm_name</key>
			<string>allowSpellCheck</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Spell Check</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system makes temporary sessions unavailable on Shared iPad. Available in iOS 13.4 and later.</string>
			<key>pfm_ios_min</key>
			<string>13.4</string>
			<key>pfm_name</key>
			<string>allowSharedDeviceTemporarySession</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Shared iPad temporary session</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disallows dictation input. Available in iOS 10.3 and later, and macOS 10.13 and later. Requires a supervised device in iOS.</string>
			<key>pfm_ios_min</key>
			<string>10.3</string>
			<key>pfm_name</key>
			<string>allowDictation</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow dictation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system disables connections to Siri servers for the purposes of dictation. Available in iOS 14.5 and later, macOS 14 and later, and watchOS 10 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>14.5</string>
			<key>pfm_name</key>
			<string>forceOnDeviceOnlyDictation</string>
			<key>pfm_title</key>
			<string>Force on-device only dictation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the device won't connect to Siri servers for the purposes of translation. Available in iOS 15 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>forceOnDeviceOnlyTranslation</string>
			<key>pfm_title</key>
			<string>Force on-device only translation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system hides Passbook notifications from the lock screen. Available in iOS 6 and later.</string>
			<key>pfm_ios_min</key>
			<string>6.0</string>
			<key>pfm_name</key>
			<string>allowPassbookWhileLocked</string>
			<key>pfm_title</key>
			<string>Allow Wallet While Locked</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables modifications of the personal hotspot setting. Requires a supervised device. Available in iOS 12.2 and later.</string>
			<key>pfm_ios_min</key>
			<string>12.2</string>
			<key>pfm_name</key>
			<string>allowPersonalHotspotModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow modifying Personal Hotspot settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables live voicemail on the device.
Requires a supervised device. Available in iOS 17.2 and later.</string>
			<key>pfm_ios_min</key>
			<string>17.2</string>
			<key>pfm_name</key>
			<string>allowLiveVoicemail</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Live Voicemail</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents Control Center from appearing on the Lock screen. Available in iOS 7 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowLockScreenControlCenter</string>
			<key>pfm_title</key>
			<string>Show Control Center on Lock screen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the Notifications history view on the lock screen, so users can't view past notifications. However, they can still see notifications when they arrive. Available in iOS 7 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowLockScreenNotificationsView</string>
			<key>pfm_title</key>
			<string>Show Notification Center on Lock screen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the Today view in Notification Center on the lock screen. Available in iOS 7 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>allowLockScreenTodayView</string>
			<key>pfm_title</key>
			<string>Show Today view on Lock screen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system forces all devices receiving AirPlay requests from this device to use a pairing password. Available in iOS 7.1 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>7.1</string>
			<key>pfm_name</key>
			<string>forceAirPlayOutgoingRequestsPairingPassword</string>
			<key>pfm_note</key>
			<string>Apple documentation indicates only this preference is needed. However, Apple Configurator 2 enables and disables both this preference and forceAirPlayIncomingRequestsPairingPassword preferences despite documentation saying forceAirPlayIncomingRequestsPairingPassword is deprecated for tvOS.</string>
			<key>pfm_title</key>
			<string>Require passcode on first AirPlay pairing</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables keychain storage of user name and password for AirPrint. Requires a supervised device. Available in iOS 11 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>allowAirPrintCredentialsStorage</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow storage of AirPrint credentials in Keychain</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system limits ad tracking. Additionally, it disables app tracking and the Allow Apps to Request to Track setting. Available in iOS 7 and later.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>forceLimitAdTracking</string>
			<key>pfm_title</key>
			<string>Force limited ad tracking</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system limits Apple personalized advertising. Available in iOS 14 and later, and macOS 12 and later.</string>
			<key>pfm_ios_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowApplePersonalizedAdvertising</string>
			<key>pfm_title</key>
			<string>Allow Apple-personalized advertizing</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Mail Privacy Protection on the device. Requires a supervised device. Available in iOS 15.2 and later.</string>
			<key>pfm_ios_min</key>
			<string>15.2</string>
			<key>pfm_name</key>
			<string>allowMailPrivacyProtection</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow mail privacy protection</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables auto dim on iPads with OLED displays. Requires a supervised device in iOS. Available in iOS 17.4 and later.</string>
			<key>pfm_ios_min</key>
			<string>17.4</string>
			<key>pfm_name</key>
			<string>allowAutoDim</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Auto Dim</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Game Center, and the system removes its icon from the Home screen. Available in iOS 6 and later, and macOS 10.13 and later. Requires a supervised device in iOS.</string>
			<key>pfm_ios_min</key>
			<string>6.0</string>
			<key>pfm_name</key>
			<string>allowGameCenter</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Game Center</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prohibits adding friends to Game Center. Available in iOS 4.2.1 and later, and macOS 10.13 and later. Requires a supervised device in iOS 13 and later.</string>
			<key>pfm_ios_min</key>
			<string>4.2.1</string>
			<key>pfm_name</key>
			<string>allowAddingGameCenterFriends</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Adding Game Center Friends</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prohibits multiplayer gaming. Available in iOS 4.1 and later, and macOS 10.13 and later. Requires a supervised device in iOS.</string>
			<key>pfm_ios_min</key>
			<string>4.1</string>
			<key>pfm_name</key>
			<string>allowMultiplayerGaming</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Multiplayer Gaming</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the Safari web browser app, and the system removes its icon from the Home screen. This setting also prevents users from opening web clips. As of iOS 13, requires a supervised device. Available in iOS 4 and later.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>allowSafari</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow use of Safari</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Safari AutoFill for passwords, contact info, and credit cards and also prevents using the Keychain for AutoFill. As of iOS 13, requires a supervised device. Available in iOS 4 and later, and macOS 10.13 and later.
The system still allows third-party password managers, and apps can use AutoFill.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>safariAllowAutoFill</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow AutoFill in Safari</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables Safari fraud warning. Available in iOS 4 and later. Also available for user enrollment.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>safariForceFraudWarning</string>
			<key>pfm_title</key>
			<string>Enable Fraud Warning</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', Safari doesn't execute JavaScript. Available in iOS 4 and later. This restriction will require supervision in a future release.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>safariAllowJavaScript</string>
			<key>pfm_title</key>
			<string>Allow JavaScript</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', Safari doesn't allow pop-up windows. Available in iOS 4 and later. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>safariAllowPopups</string>
			<key>pfm_title</key>
			<string>Allow Pop-ups</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>2</real>
			<key>pfm_description</key>
			<string>Defines the conditions under which the device accepts cookies. The user-facing settings changed in iOS 11, although the possible values remain the same. Available in iOS 4 and later. Support for this restriction on unsupervised devices is deprecated. Allowed values:

* '0': Enables Prevent Cross-Site Tracking and Block All Cookies, and the user canʼt disable either setting.
* '1' or '1.5': Enables Prevent Cross-Site Tracking, and the user canʼt disable it. Doesn't enable Block All Cookies, but the user can enable it.
* '2': Enables Prevent Cross-Site Tracking but doesn't enable Block All Cookies. The user can toggle either setting.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>safariAcceptCookies</string>
			<key>pfm_range_list</key>
			<array>
				<real>0.0</real>
				<real>1</real>
				<real>1.5</real>
				<real>2</real>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Never / Prevent Cross-Site Tracking &amp; Block All Cookies (User Restricted)</string>
				<string>Allow from current website only / Prevent Cross-Site Tracking (User Restricted)</string>
				<string>Allow from websites visited (iOS 10 &amp; earlier)</string>
				<string>Always / Prevent Cross-Site Tracking</string>
			</array>
			<key>pfm_title</key>
			<string>Accept Cookies in Safari</string>
			<key>pfm_type</key>
			<string>real</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents the user from changing the device name. Available in iOS 9 and later, macOS 14 and later, and tvOS 11.0 and later. Requires a supervised device in iOS and tvOS.</string>
			<key>pfm_ios_min</key>
			<string>9.0</string>
			<key>pfm_name</key>
			<string>allowDeviceNameModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Modifying Device Name</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If present, the system prevents showing or launching apps with bundle IDs in the array. Include the value 'com.apple.webapp' to restrict all webclips. This applies to App Store apps, marketplace apps, and locally installed apps (using Configurator, Xcode, etc).
Requires a supervised device. Available in iOS 15 and later, and tvOS 15 and later.
Denying system apps may disable other functionality. For example, denying the App Store app may prevent users from accepting the terms and conditions for the user-based Volume Purchase Program (VPP).</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>allowListedAppBundleIDs</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>blockedAppBundleIDs</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>appBlockedBundleID</string>
					<key>pfm_title</key>
					<string>Bundle ID</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>com.domainname.applicationname</string>
				</dict>
			</array>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Blocked Apps</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Use 'blockedAppBundleIDs' instead.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>whitelistedAppBundleIDs</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_deprecated</key>
			<string>15.0</string>
			<key>pfm_ios_min</key>
			<string>9.3</string>
			<key>pfm_name</key>
			<string>blacklistedAppBundleIDs</string>
			<key>pfm_note</key>
			<string>Use blockedAppBundleIDs instead.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>appBlacklistedBundleID</string>
					<key>pfm_title</key>
					<string>iOS / tvOS Bundle ID</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>com.apple.tv</string>
				</dict>
			</array>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Restrict App Usage - Denylist</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If present, the system only shows or can launch apps with bundle IDs in the array. Include the value 'com.apple.webapp' to allow all webclips. This applies to App Store apps, marketplace apps, and locally installed apps (using Configurator, Xcode, etc).
Requires a supervised device. Available in iOS 15 and later, and tvOS 15 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>blockedAppBundleIDs</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>allowListedAppBundleIDs</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>appAllowlistedBundleID</string>
					<key>pfm_title</key>
					<string>Bundle ID</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>com.domainname.applicationname</string>
				</dict>
			</array>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Listed Apps</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Use 'allowListedAppBundleIDs' instead.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>blacklistedAppBundleIDs</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_deprecated</key>
			<string>15.0</string>
			<key>pfm_ios_min</key>
			<string>9.3</string>
			<key>pfm_name</key>
			<string>whitelistedAppBundleIDs</string>
			<key>pfm_note</key>
			<string>Use allowListedAppBundleIDs instead of this deprecated key.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>appWhitelistedBundleID</string>
					<key>pfm_title</key>
					<string>iOS / tvOS Bundle ID</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>com.apple.tv</string>
				</dict>
			</array>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Restrict App Usage - Allowlist</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If present, the system allows apps identified by the bundle IDs listed in the array to autonomously enter Single App Mode. Requires a supervised device. Available in iOS 7 and later.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>autonomousSingleAppModePermittedAppIDs</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>appAutonomousSingleAppModePermittedID</string>
					<key>pfm_title</key>
					<string>Apps allow list for Autonomous Single App Mode</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Autonomous Single App Mode Permitted App IDs</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>us</string>
			<key>pfm_description</key>
			<string>The two-letter key that profile tools use to display the proper ratings for the given region. The client doesn't recognize or report this data. Available in iOS 4.0 and later, macOS 10.7 and later, and tvOS 9 and later.</string>
			<key>pfm_ios_min</key>
			<string>11.3</string>
			<key>pfm_name</key>
			<string>ratingRegion</string>
			<key>pfm_range_list</key>
			<array>
				<string>us</string>
				<string>au</string>
				<string>ca</string>
				<string>de</string>
				<string>fr</string>
				<string>ie</string>
				<string>jp</string>
				<string>nz</string>
				<string>gb</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>United States</string>
				<string>Australia</string>
				<string>Canada</string>
				<string>Germany</string>
				<string>France</string>
				<string>Ireland</string>
				<string>Japan</string>
				<string>New Zealand</string>
				<string>United Kingdom</string>
			</array>
			<key>pfm_title</key>
			<string>Ratings region</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1000</integer>
			<key>pfm_description</key>
			<string>The maximum level of app content allowed on the device. Preinstalled (first party) apps ignore this restriction. Available in iOS 4.0 and later, macOS 15 and later, and tvOS 11.3 and later.  Support for this restriction on unsupervised devices is deprecated.
Possible values, with the US description of the rating level:

* '1000': All
* '600': 17+
* '300': 12+
* '200': 9+
* '100': 4+
* '0': None</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>ratingApps</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1000</integer>
				<integer>900</integer>
				<integer>800</integer>
				<integer>700</integer>
				<integer>600</integer>
				<integer>500</integer>
				<integer>400</integer>
				<integer>300</integer>
				<integer>200</integer>
				<integer>100</integer>
				<integer>0</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Allow All Apps</string>
				<string>900</string>
				<string>800</string>
				<string>700</string>
				<string>600</string>
				<string>500</string>
				<string>400</string>
				<string>300</string>
				<string>200</string>
				<string>100</string>
				<string>Don't Allow Apps</string>
			</array>
			<key>pfm_range_max</key>
			<integer>1000</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Apps Ranking Number</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1000</integer>
			<key>pfm_description</key>
			<string>The maximum level of movie content allowed on the device. Available in iOS 4.0 and later, macOS 15 and later, and tvOS 11.3 and later.  Support for this restriction on unsupervised devices is deprecated.
Possible values, with the US description of the rating level:

* '1000': All
* '500': NC-17
* '400': R
* '300': PG-13
* '200': PG
* '100': G
* '0': None</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>ratingMovies</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1000</integer>
				<integer>900</integer>
				<integer>800</integer>
				<integer>700</integer>
				<integer>600</integer>
				<integer>500</integer>
				<integer>400</integer>
				<integer>300</integer>
				<integer>200</integer>
				<integer>100</integer>
				<integer>0</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Allow All Movies</string>
				<string>900</string>
				<string>800</string>
				<string>700</string>
				<string>600</string>
				<string>500</string>
				<string>400</string>
				<string>300</string>
				<string>200</string>
				<string>100</string>
				<string>Don't Allow Movies</string>
			</array>
			<key>pfm_range_max</key>
			<integer>1000</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Allowed content ratings - Movies</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1000</integer>
			<key>pfm_description</key>
			<string>The maximum level of TV content allowed on the device. Available in iOS 4.0 and later, macOS 15 and later, and tvOS 11.3 and later. Support for this restriction on unsupervised devices is deprecated.
Possible values, with the US description of the rating level:

* '1000': All
* '600': TV-MA
* '500': TV-14
* '400': TV-PG
* '300': TV-G
* '200': TV-Y7
* '100': TV-Y
* '0': None</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>ratingTVShows</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1000</integer>
				<integer>900</integer>
				<integer>800</integer>
				<integer>700</integer>
				<integer>600</integer>
				<integer>500</integer>
				<integer>400</integer>
				<integer>300</integer>
				<integer>200</integer>
				<integer>100</integer>
				<integer>0</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Allow All TV Shows</string>
				<string>900</string>
				<string>800</string>
				<string>700</string>
				<string>600</string>
				<string>500</string>
				<string>400</string>
				<string>300</string>
				<string>200</string>
				<string>100</string>
				<string>Don't Allow TV Shows</string>
			</array>
			<key>pfm_range_max</key>
			<integer>1000</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Allowed content ratings - TV Shows</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system hides explicit music or video content purchased from the iTunes Store. The system marks explicit content as such by content providers, such as record labels, when sold through the iTunes Store. Available in iOS 4 and later, and tvOS 11.3 and later. Requires a supervised device in iOS 13 and later. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>allowExplicitContent</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Explicit Content</string>
			<key>pfm_tvos_min</key>
			<string>11.3</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents connecting to any connected USB devices in the Files app. Requires a supervised device. Available in iOS 13.1 and later.</string>
			<key>pfm_ios_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>allowFilesUSBDriveAccess</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Files USB Drive Access</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents the user from downloading Apple Books media that's tagged as erotica. Available in iOS 4.0 and later, macOS 15 and later, and tvOS 17 and later. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_ios_min</key>
			<string>6.0</string>
			<key>pfm_name</key>
			<string>allowBookstoreErotica</string>
			<key>pfm_title</key>
			<string>Allow Bookstore Erotica</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables sharing passwords with the Airdrop Passwords feature. Available in iOS 12 and later, and macOS 10.14 and later. Requires a supervised device in iOS.</string>
			<key>pfm_ios_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>allowPasswordSharing</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow password sharing</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables requesting passwords from nearby devices. Available in iOS 12 and later, macOS 10.14 and later, and tvOS 12 and later. Requires a supervised device in iOS and tvOS.</string>
			<key>pfm_ios_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>allowPasswordProximityRequests</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow proximity based password sharing requests</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system delays user visibility of software updates. In macOS, the system allows seed build updates without delay. The delay is 30 days unless you set 'enforcedSoftwareUpdateDelay' to another value. Available in iOS 11.3 and later, macOS 10.13 and later, and tvOS 12.2 and later. Requires a supervised device in iOS and tvOS.</string>
			<key>pfm_ios_min</key>
			<string>11.3</string>
			<key>pfm_name</key>
			<string>forceDelayedSoftwareUpdates</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Defer Software Updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>30</integer>
			<key>pfm_description</key>
			<string>How many days to delay a software update on the device. With this restriction in place, the user doesn't see a software update until the specified number of days after the software update release date. The restrictions 'forceDelayedAppSoftwareUpdates' and 'forceDelayedSoftwareUpdates' use this value. Available in iOS 11.3 and later, macOS 10.13.4 and later, and tvOS 12.2 and later. Requires a supervised device in iOS and tvOS.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>forceDelayedSoftwareUpdates</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>11.3</string>
			<key>pfm_name</key>
			<string>enforcedSoftwareUpdateDelay</string>
			<key>pfm_range_max</key>
			<integer>90</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Deferred Software Updates Delay</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prohibits installation of rapid security responses. Available in iOS 16 and later, and macOS 13 and later.</string>
			<key>pfm_ios_min</key>
			<string>16.0</string>
			<key>pfm_name</key>
			<string>allowRapidSecurityResponseInstallation</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Rapid Security Response Installation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prohibits removal of rapid security responses. Available in iOS 16 and later, and macOS 13 and later.</string>
			<key>pfm_ios_min</key>
			<string>16.0</string>
			<key>pfm_name</key>
			<string>allowRapidSecurityResponseRemoval</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Rapid Security Response Removal</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Find My Device in the Find My app. Requires a supervised device. Available in iOS 13 and later, and macOS 10.15 and later.</string>
			<key>pfm_ios_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>allowFindMyDevice</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Find My Devices</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Find My Friends in the Find My app. Requires a supervised device. Available in iOS 13 and later, and macOS 10.15 and later.</string>
			<key>pfm_ios_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>allowFindMyFriends</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Find My Friends</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents connecting to network drives in the Files app. Requires a supervised device. Available in iOS 13.1 and later.</string>
			<key>pfm_ios_min</key>
			<string>13.1</string>
			<key>pfm_name</key>
			<string>allowFilesNetworkDriveAccess</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Files Network Drive Access</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prevents the transfer of an eSIM from the device on which the restriction is installed to a different device. Requires a supervised device. Available in iOS 18 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.0</string>
			<key>pfm_name</key>
			<string>allowESIMOutgoingTransfers</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow eSIM Outgoing Transfers</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prohibits creating new Genmoji. Requires a supervised device. Available in iOS 18 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.0</string>
			<key>pfm_name</key>
			<string>allowGenmoji</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Genmoji</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prohibits the use of image generation. Requires a supervised device. Available in iOS 18 and later and macOS 15 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.0</string>
			<key>pfm_name</key>
			<string>allowImagePlayground</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Image Playground</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prohibits the use of Image Wand. Requires a supervised device. Available in iOS 18 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.0</string>
			<key>pfm_name</key>
			<string>allowImageWand</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Image Wand</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prohibits the use of iPhone Mirroring. When used on macOS, this prevents the Mac from mirroring any iPhone. When used on iOS, this prevents the iPhone from mirroring to any Mac. Requires a supervised device. Available in iOS 18 and later and macOS 15 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.0</string>
			<key>pfm_name</key>
			<string>allowiPhoneMirroring</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow iPhone mirroring</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If false, prevents the system from generating text in the user's handwriting. Requires a supervised device. Available in iOS 18 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.0</string>
			<key>pfm_name</key>
			<string>allowPersonalizedHandwritingResults</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow personalized handwriting results</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables Apple Intelligence writing tools. Requires a supervised device. Available in iOS 18 and later and macOS 15 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.0</string>
			<key>pfm_name</key>
			<string>allowWritingTools</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow writing tools</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables call recording. Available in iOS 18 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.1</string>
			<key>pfm_name</key>
			<string>allowCallRecording</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Call Recording</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables the ability to create summaries of email messages manually. This doesn't affect automatic summary generation. Available in iOS 18.1 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.1</string>
			<key>pfm_name</key>
			<string>allowMailSummary</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prevents the use of RCS messaging. Available in iOS 18.1 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.1</string>
			<key>pfm_name</key>
			<string>allowRCSMessaging</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables default browser preference modification. The MDM Settings command to set the default browser preference will still work when this is applied. Available in iOS 18.2 and later, and visionOS 2.2 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.2</string>
			<key>pfm_name</key>
			<string>allowDefaultBrowserModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow default browser modification</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables the use of external, cloud-based intelligence services with Siri. On iOS, this restriction is temporarily allowed on unsupervised and user enrollments. In a future release, this restriction will require supervision, and will be ignored on non-supervised devices. Available in iOS 18.2 and later, and macOS 15.2 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.2</string>
			<key>pfm_name</key>
			<string>allowExternalIntelligenceIntegrations</string>
			<key>pfm_title</key>
			<string>Allow external intelligence integrations</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', forces external intelligence providers into anonymous mode. If a user is already signed in to an external intelligence provider, applying this restriction will cause them to be signed out when the next request is attempted. Available in iOS 18.2 and later, and macOS 15.2 and later.</string>
			<key>pfm_ios_min</key>
			<string>18.2</string>
			<key>pfm_name</key>
			<string>allowExternalIntelligenceIntegrationsSignIn</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow external intelligence integrations sign-in</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If false, the connection to and use of satellite services is prohibited.</string>
			<key>pfm_ios_min</key>
			<string>18.2</string>
			<key>pfm_name</key>
			<string>allowSatelliteConnection</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow use of satellite connectivity</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Restrictions (iOS)</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>16</integer>
</dict>
</plist>
