<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Software Update Managed Settings</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/softwareupdate</string>
	<key>pfm_domain</key>
	<string>com.apple.SoftwareUpdate</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2023-08-21T10:35:00Z</date>
	<key>pfm_macos_min</key>
	<string>10.7</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Software Update settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Software Update</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.SoftwareUpdate</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.SoftwareUpdate</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The URL of the software update catalog. This property is not supported in macOS 11 and later.</string>
			<key>pfm_macos_deprecated</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>CatalogURL</string>
			<key>pfm_title</key>
			<string>Catalog URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This option was needed during Mojave betas which required https.</string>
			<key>pfm_macos_min</key>
			<string>10.14</string>
			<key>pfm_name</key>
			<string>SUDisableEVCheck</string>
			<key>pfm_title</key>
			<string>Disable Extended Validation check of TLS certificate.</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', deselects the 'Check for updates' option and prevents the user from changing the option.</string>
			<key>pfm_name</key>
			<string>AutomaticCheckEnabled</string>
			<key>pfm_title</key>
			<string>Automatically check for updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', deselects the 'Download new updates when available from the App Store' option and prevents the user from changing the option.</string>
			<key>pfm_name</key>
			<string>AutomaticDownload</string>
			<key>pfm_title</key>
			<string>Download newly available updates in the background</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', restricts the 'Install macOS Updates' option and prevents the user from changing the option.</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>AutomaticallyInstallMacOSUpdates</string>
			<key>pfm_title</key>
			<string>Automatically install macOS updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', deselects the 'Install app updates from the App Store' option and prevents the user from changing the option.</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>AutomaticallyInstallAppUpdates</string>
			<key>pfm_title</key>
			<string>Automatically install App Store app updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', restricts the automatic installation of configuration data.</string>
			<key>pfm_name</key>
			<string>ConfigDataInstall</string>
			<key>pfm_title</key>
			<string>Install XProtect, MRT, &amp; Gatekeeper updates automatically</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables the automatic installation of critical updates and prevents the user from changing the 'Install system data files and security updates' option.</string>
			<key>pfm_name</key>
			<string>CriticalUpdateInstall</string>
			<key>pfm_title</key>
			<string>Install security updates automatically</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', prerelease software can be installed on this computer.</string>
			<key>pfm_name</key>
			<string>AllowPreReleaseInstallation</string>
			<key>pfm_title</key>
			<string>Allow installation of macOS beta releases</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Software updates will be delayed by the duration defined by ManagedDeferredInstallDelay.</string>
			<key>pfm_name</key>
			<string>forceDelayedSoftwareUpdates</string>
			<key>pfm_title</key>
			<string>Force Update Delay</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', restrict app installations to admin users. This key has the same function as the  'restrict-store-require-admin-to-install' key in the 'com.apple.appstore' payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If true, restrict app installations to admin users. This key has the same function as the key restrict-store-require-admin-to-install in the com.apple.appstore payload.
Availability: Available in macOS 10.14 and later.</string>
			<key>pfm_macos_min</key>
			<string>10.14</string>
			<key>pfm_name</key>
			<string>restrict-software-update-require-admin-to-install</string>
			<key>pfm_title</key>
			<string>Restrict app installations to admin users</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>forceDelayedSoftwareUpdates</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<integer>30</integer>
			<key>pfm_description</key>
			<string>The duration that software updates will be delayed.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>forceDelayedSoftwareUpdates</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_macos_min</key>
			<string>10.13.4</string>
			<key>pfm_name</key>
			<string>ManagedDeferredInstallDelay</string>
			<key>pfm_title</key>
			<string>Update Delay</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>Days</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Software Update</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>7</integer>
</dict>
</plist>
