<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_description</key>
        <string>FileVault Recovery Key Escrow settings</string>
		<key>pfm_description_reference</key>
		<string>FileVault Full Disk Encryption (FDE) recovery keys are, by default, sent to Apple if the user requests it. Starting with ma-
cOS 10.13, recovery key escrow payloads are designated by specifying com.apple.security.FDERecoveryKeyEscrow as the PayloadType value. Only one payload of this type is allowed per system.
If FileVault is enabled after this payload is installed on the system, the FileVault PRK will be encrypted with the specified certificate, wrapped with a CMS envelope and stored at /var/db/FileVaultPRK.dat. The encrypted data will be made available to the MDM server as part of the SecurityInfo command. Alternatively, if a site uses its own administration software, it can extract the PRK from the foregoing location at any time. Because the PRK is encrypted using the certificate provided in the profile, only the author of the profile can extract the data.
Note these cautions:
• Thepayloadmustexistinasystem-scopedprofile.
• Installingmorethanonepayloadofthistypepermachinewillcauseanerror.
• Thepreviouspayload(com.apple.security.FDERecoveryRedirect)isnolongersupported.Itcanstill be installed, but it will be ignored. This lets servers send out the same profile to old and new clients.
• Ifonlyanold-styleredirectionpayloadisinstalledatthetimeFileVaultisturnedon(bymeansoftheSecurity Preferences pane), an error will be displayed and FileVault will not be enabled.
• No warning or error will be provided if FileVault is already enabled and an old-style payload is installed. In this case, itʼs assumed that the recovery key has already been escrowed with the server.</string>
        <key>pfm_title</key>
        <string>FileVault Recovery Key Escrow</string>
        <key>pfm_format_version</key>
        <integer>1</integer>
        <key>pfm_version</key>
        <integer>1</integer>
        <key>pfm_domain</key>
        <string>com.apple.security.FDERecoveryKeyEscrow</string>
        <key>pfm_macos_min</key>
        <string>10.13</string>
		<key>pfm_interaction</key>
		<string>exclusive</string>
		<key>pfm_last_modified</key>
		<date>2018-08-09T18:38:20Z</date>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_targets</key>
		<array>
			<string>system</string>
		</array>
		<key>pfm_unique</key>
		<true/>
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDescription</string>
                <key>pfm_title</key>
                <string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload.</string>
				<key>pfm_description_reference</key>
				<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>FileVault Recovery Key Escrow settings</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadDisplayName</string>
                <key>pfm_title</key>
                <string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload.</string>
				<key>pfm_description_reference</key>
				<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>FileVault Recovery Key Escrow</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadIdentifier</string>
                <key>pfm_title</key>
                <string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier.</string>
				<key>pfm_description_reference</key>
				<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.security.FDERecoveryKeyEscrow</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadType</string>
                <key>pfm_title</key>
                <string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string.</string>
				<key>pfm_description_reference</key>
				<string>The payload type.</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string>com.apple.security.FDERecoveryKeyEscrow</string>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadUUID</string>
                <key>pfm_title</key>
                <string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF).</string>
				<key>pfm_description_reference</key>
				<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_default</key>
                <string></string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadVersion</string>
                <key>pfm_title</key>
                <string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_description_reference</key>
				<string>The version number of the individual payload.
	A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
                <key>pfm_type</key>
                <string>integer</string>
                <key>pfm_default</key>
                <integer>1</integer>
                <key>pfm_require</key>
                <string>always</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>PayloadOrganization</string>
                <key>pfm_title</key>
                <string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user.</string>
				<key>pfm_description_reference</key>
				<string>Optional. A human-readable string containing the name of the organization that provided the profile.
	The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>Location</string>
                <key>pfm_title</key>
                <string>Location</string>
                <key>pfm_description</key>
                <string>A short description of the location where the recovery key will be escrowed. This text will be inserted into the message the user sees when enabling FileVault.</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_require</key>
                <string>always</string>
				<key>pfm_description_reference</key>
				<string>Required. A short description of the location where the recovery key will be escrowed. This text will be inserted into the message the user sees when enabling FileVault.</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>EncryptCertPayloadUUID</string>
                <key>pfm_title</key>
                <string>EncryptCertPayloadUUID</string>
                <key>pfm_description</key>
                <string>The UUID of a payload within the same profile that contains the certificate that will be used to encrypt the recovery key. The referenced payload must be of type com.apple.security.pkcs1.</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_require</key>
                <string>always</string>
				<key>pfm_description_reference</key>
				<string>Required. The UUID of a payload within the same profile that contains the certificate that will be used to encrypt the recovery key. The referenced payload must be of type com.apple.security.pkcs1.</string>
            </dict>
            <dict>
                <key>pfm_name</key>
                <string>DeviceKey</string>
                <key>pfm_title</key>
                <string>DeviceKey</string>
                <key>pfm_description</key>
                <string>An optional string that will be included in help text if the user appears to have forgotten the password. Can be used by a site admin to look up the escrowed key for the particular machine. Replaces the RecordNumber key used in previous escrow mechanism. If missing, the device serial number will be used instead.</string>
                <key>pfm_type</key>
                <string>string</string>
				<key>pfm_description_reference</key>
				<string>Optional. An optional string that will be included in help text if the user appears to have forgotten the password. Can be used by a site admin to look up the escrowed key for the particular machine. Replaces the RecordNumber key used in previous escrow mechanism. If missing, the device serial number will be used instead.</string>
            </dict>
        </array>
    </dict>
</plist>