<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Energy Saver settings</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/energysaver</string>
	<key>pfm_domain</key>
	<string>com.apple.MCX</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2023-11-30T15:08:23Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subdomain</key>
	<string>EnergySaver</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Energy Saver settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Energy Saver</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.MCX</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.MCX</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Desktop</string>
				<string>Portable</string>
				<string>Schedule</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Desktop</key>
				<array>
					<string>com.apple.EnergySaver.desktop.ACPower</string>
				</array>
				<key>General</key>
				<array>
					<string>SleepDisabled</string>
				</array>
				<key>Portable</key>
				<array>
					<string>PFC_SegmentedControl_Portable</string>
					<string>com.apple.EnergySaver.portable.BatteryPower</string>
					<string>com.apple.EnergySaver.portable.ACPower</string>
				</array>
				<key>Schedule</key>
				<array>
					<string>com.apple.EnergySaver.desktop.Schedule</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Managed settings for the desktop energy profile.</string>
			<key>pfm_hidden</key>
			<string>container</string>
			<key>pfm_name</key>
			<string>com.apple.EnergySaver.desktop.ACPower</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Minutes of inactivity before the display will be turned off, in an integer value where 0 means never</string>
					<key>pfm_name</key>
					<string>Display Sleep Timer</string>
					<key>pfm_range_max</key>
					<integer>180</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Display Sleep Timer</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>minutes</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Minutes of inactivity before the system will enter sleep mode, in an integer value where 0 means never</string>
					<key>pfm_name</key>
					<string>System Sleep Timer</string>
					<key>pfm_range_max</key>
					<integer>180</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>System Sleep Timer</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>minutes</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>10</integer>
					<key>pfm_description</key>
					<string>Minutes of inactivity before the disks(s) will be powered down, in an integer value where 0 means never</string>
					<key>pfm_name</key>
					<string>Disk Sleep Timer</string>
					<key>pfm_range_max</key>
					<integer>180</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Disk(s) Sleep Timer</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>minutes</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Wake the system for network access</string>
					<key>pfm_name</key>
					<string>Wake On LAN</string>
					<key>pfm_title</key>
					<string>Wake on LAN</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Wake On Modem Ring</string>
					<key>pfm_title</key>
					<string>Wake On Modem Ring</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Automatic Restart On Power Loss</string>
					<key>pfm_title</key>
					<string>Start up Automatically After a Power Failure</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>May not be available on all systems</string>
					<key>pfm_name</key>
					<string>Dynamic Power Step</string>
					<key>pfm_title</key>
					<string>Dynamic Power Step</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>May not be available on all systems</string>
					<key>pfm_name</key>
					<string>Reduce Processor Speed</string>
					<key>pfm_title</key>
					<string>Reduce Processor Speed</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Desktop Energy Saver Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_Portable</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Battery</string>
				<string>Power Adapter</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Battery</key>
				<array>
					<string>com.apple.EnergySaver.portable.BatteryPower</string>
				</array>
				<key>Power Adapter</key>
				<array>
					<string></string>
					<string>com.apple.EnergySaver.portable.ACPower</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Managed settings for the portable battery power energy profile</string>
			<key>pfm_hidden</key>
			<string>container</string>
			<key>pfm_name</key>
			<string>com.apple.EnergySaver.portable.BatteryPower</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Minutes of inactivity before the display will be turned off, in an integer value where 0 means never</string>
					<key>pfm_name</key>
					<string>Display Sleep Timer</string>
					<key>pfm_range_max</key>
					<integer>180</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Display Sleep Timer</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>minutes</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Minutes of inactivity before the system will enter sleep mode, in an integer value where 0 means never</string>
					<key>pfm_name</key>
					<string>System Sleep Timer</string>
					<key>pfm_range_max</key>
					<integer>180</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>System Sleep Timer</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>minutes</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>10</integer>
					<key>pfm_description</key>
					<string>Minutes of inactivity before the disks(s) will be powered down, in an integer value where 0 means never</string>
					<key>pfm_name</key>
					<string>Disk Sleep Timer</string>
					<key>pfm_range_max</key>
					<integer>180</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Disk(s) Sleep Timer</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>minutes</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Wake the system for network access</string>
					<key>pfm_name</key>
					<string>Wake On LAN</string>
					<key>pfm_title</key>
					<string>Wake on LAN</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Wake On Modem Ring</string>
					<key>pfm_title</key>
					<string>Wake On Modem Ring</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Automatic Restart On Power Loss</string>
					<key>pfm_title</key>
					<string>Start up Automatically After a Power Failure</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>May not be available on all systems</string>
					<key>pfm_name</key>
					<string>Dynamic Power Step</string>
					<key>pfm_title</key>
					<string>Dynamic Power Step</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>May not be available on all systems</string>
					<key>pfm_name</key>
					<string>Reduce Processor Speed</string>
					<key>pfm_title</key>
					<string>Reduce Processor Speed</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Portable Energy Saver Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Managed settings for the portable AC power energy profile.</string>
			<key>pfm_hidden</key>
			<string>container</string>
			<key>pfm_name</key>
			<string>com.apple.EnergySaver.portable.ACPower</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Minutes of inactivity before the display will be turned off, in an integer value where 0 means never</string>
					<key>pfm_name</key>
					<string>Display Sleep Timer</string>
					<key>pfm_range_max</key>
					<integer>180</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Display Sleep Timer</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>minutes</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Minutes of inactivity before the system will enter sleep mode, in an integer value where 0 means never</string>
					<key>pfm_name</key>
					<string>System Sleep Timer</string>
					<key>pfm_range_max</key>
					<integer>180</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>System Sleep Timer</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>minutes</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>10</integer>
					<key>pfm_description</key>
					<string>Minutes of inactivity before the disks(s) will be powered down, in an integer value where 0 means never</string>
					<key>pfm_name</key>
					<string>Disk Sleep Timer</string>
					<key>pfm_range_max</key>
					<integer>180</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Disk(s) Sleep Timer</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>minutes</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Wake the system for network access</string>
					<key>pfm_name</key>
					<string>Wake On LAN</string>
					<key>pfm_title</key>
					<string>Wake on LAN</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Wake On Modem Ring</string>
					<key>pfm_title</key>
					<string>Wake On Modem Ring</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>Automatic Restart On Power Loss</string>
					<key>pfm_title</key>
					<string>Start up Automatically After a Power Failure</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>May not be available on all systems</string>
					<key>pfm_name</key>
					<string>Dynamic Power Step</string>
					<key>pfm_title</key>
					<string>Dynamic Power Step</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>May not be available on all systems</string>
					<key>pfm_name</key>
					<string>Reduce Processor Speed</string>
					<key>pfm_title</key>
					<string>Reduce Processor Speed</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Portable Energy Saver Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Use this key to manage scheduled power on and power off events.</string>
			<key>pfm_hidden</key>
			<string>container</string>
			<key>pfm_name</key>
			<string>com.apple.EnergySaver.desktop.Schedule</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Use this key to describe a repeating start up/wake time.</string>
					<key>pfm_name</key>
					<string>RepeatingPowerOn</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>wakepoweron</string>
							<key>pfm_description</key>
							<string>The type of action to take at the scheduled time.</string>
							<key>pfm_name</key>
							<string>eventtype</string>
							<key>pfm_range_list</key>
							<array>
								<string>wake</string>
								<string>wakepoweron</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Wake</string>
								<string>Start Up/Wake</string>
							</array>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>31</integer>
							<key>pfm_description</key>
							<string>The days on which the scheduled event occurs.</string>
							<key>pfm_name</key>
							<string>weekdays</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string></string>
									<key>pfm_name</key>
									<string>weekday</string>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
										<integer>2</integer>
										<integer>4</integer>
										<integer>8</integer>
										<integer>16</integer>
										<integer>32</integer>
										<integer>64</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Monday</string>
										<string>Tuesday</string>
										<string>Wednesday</string>
										<string>Thursday</string>
										<string>Friday</string>
										<string>Saturday</string>
										<string>Sunday</string>
									</array>
									<key>pfm_title</key>
									<string>Weekday</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Days to execute</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_type_input</key>
							<string>array</string>
							<key>pfm_value_processor</key>
							<string>weekdaysBitmask2Int</string>
						</dict>
						<dict>
							<key>pfm_date_style</key>
							<string>time</string>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>The time of day to perform the action.</string>
							<key>pfm_name</key>
							<string>time</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Time of day</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_type_input</key>
							<string>date</string>
							<key>pfm_value_processor</key>
							<string>time2minutes</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Start up or wake</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Use this key to describe a repeating shut down, sleep or restart.</string>
					<key>pfm_name</key>
					<string>RepeatingPowerOff</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The type of action to take at the scheduled time.</string>
							<key>pfm_name</key>
							<string>eventtype</string>
							<key>pfm_range_list</key>
							<array>
								<string>sleep</string>
								<string>restart</string>
								<string>shutdown</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Sleep</string>
								<string>Restart</string>
								<string>Shut Down</string>
							</array>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>31</integer>
							<key>pfm_description</key>
							<string>The days on which the scheduled event occurs.</string>
							<key>pfm_name</key>
							<string>weekdays</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string></string>
									<key>pfm_name</key>
									<string>weekday</string>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
										<integer>2</integer>
										<integer>4</integer>
										<integer>8</integer>
										<integer>16</integer>
										<integer>32</integer>
										<integer>64</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Monday</string>
										<string>Tuesday</string>
										<string>Wednesday</string>
										<string>Thursday</string>
										<string>Friday</string>
										<string>Saturday</string>
										<string>Sunday</string>
									</array>
									<key>pfm_title</key>
									<string>Weekday</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Days to execute</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_type_input</key>
							<string>array</string>
							<key>pfm_value_processor</key>
							<string>weekdaysBitmask2Int</string>
						</dict>
						<dict>
							<key>pfm_date_style</key>
							<string>time</string>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>The time of day to perform the action.</string>
							<key>pfm_name</key>
							<string>time</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Time of day</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_type_input</key>
							<string>date</string>
							<key>pfm_value_processor</key>
							<string>time2minutes</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Shut down, sleep or restart</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Power Schedule</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>SleepDisabled</string>
			<key>pfm_title</key>
			<string>Sleep Disabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Energy Saver</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>
