<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define enabled or disabled Preference Panes in System Preferences.</string>
	<key>pfm_domain</key>
	<string>com.apple.systempreferences</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2018-09-02T18:26:10Z</date>
	<key>pfm_name</key>
	<string>SystemPreferences</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures System Preferences settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>System Preferences</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.systempreferences</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.systempreferences</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Enabled Preference Panes</string>
				<string>Disabled Preference Panes</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Disabled Preference Panes</key>
				<array>
					<string>DisabledPreferencePanes</string>
				</array>
				<key>Enabled Preference Panes</key>
				<array>
					<string>EnabledPreferencePanes</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allowed Preference Panes within the System Preferences application.</string>
			<key>pfm_name</key>
			<string>EnabledPreferencePanes</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>PreferencePanes</string>
					<key>pfm_range_list</key>
					<array>
						<string>com.apple.preferences.users</string>
						<string>com.apple.preferences.appstore</string>
						<string>com.apple.preference.general</string>
						<string>com.apple.preferences.Bluetooth</string>
						<string>com.apple.preference.datetime</string>
						<string>com.apple.preference.desktopscreeneffect</string>
						<string>com.apple.preference.digihub.discs</string>
						<string>com.apple.preference.displays</string>
						<string>com.apple.preference.dock</string>
						<string>com.apple.preference.energysaver</string>
						<string>com.apple.preference.expose</string>
						<string>com.apple.preferences.extensions</string>
						<string>com.apple.prefpanel.fibrechannel</string>
						<string>com.apple.preference.ink</string>
						<string>com.apple.preferences.internetaccounts</string>
						<string>com.apple.preference.keyboard</string>
						<string>com.apple.Localization</string>
						<string>com.apple.preference.internet</string>
						<string>com.apple.preference.mouse</string>
						<string>com.apple.preference.network</string>
						<string>com.apple.preference.notifications</string>
						<string>com.apple.preferences.parentalcontrols</string>
						<string>com.apple.preference.printfax</string>
						<string>com.apple.preferences.configurationprofiles</string>
						<string>com.apple.preference.security</string>
						<string>com.apple.preferences.sharing</string>
						<string>com.apple.preferences.softwareupdate</string>
						<string>com.apple.preference.sound</string>
						<string>com.apple.preference.speech</string>
						<string>com.apple.preference.spotlight</string>
						<string>com.apple.preference.startupdisk</string>
						<string>com.apple.prefs.backup</string>
						<string>com.apple.preferences.password</string>
						<string>com.apple.preference.trackpad</string>
						<string>com.apple.preference.universalaccess</string>
						<string>com.apple.preferences.wallet</string>
						<string>com.apple.preferences.icloud</string>
						<string>com.apple.Xsan</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Users &amp; Groups</string>
						<string>App Store</string>
						<string>General</string>
						<string>Bluetooth</string>
						<string>Date &amp; Time</string>
						<string>Desktop &amp; Screen Saver</string>
						<string>CDs &amp; DVDs</string>
						<string>Displays</string>
						<string>Dock</string>
						<string>Energy Saver</string>
						<string>Mission Control</string>
						<string>Extensions</string>
						<string>Fibre Channel</string>
						<string>Ink</string>
						<string>Internet Accounts</string>
						<string>Keyboard</string>
						<string>Language &amp; Region</string>
						<string>MobileMe</string>
						<string>Mouse</string>
						<string>Network</string>
						<string>Notifications</string>
						<string>Parental Controls</string>
						<string>Printers &amp; Scanners</string>
						<string>Profiles</string>
						<string>Security &amp; Privacy</string>
						<string>Sharing</string>
						<string>Software Update</string>
						<string>Sound</string>
						<string>Siri</string>
						<string>Spotlight</string>
						<string>Startup Disk</string>
						<string>Time Machine</string>
						<string>Touch ID</string>
						<string>Trackpad</string>
						<string>Accessibility</string>
						<string>Wallet &amp; Apple Pay</string>
						<string>iCloud</string>
						<string>Xsan</string>
					</array>
					<key>pfm_title</key>
					<string></string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_type_input</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disabled Preference Panes within the System Preferences application.</string>
			<key>pfm_name</key>
			<string>DisabledPreferencePanes</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>PreferencePanes</string>
					<key>pfm_range_list</key>
					<array>
						<string>com.apple.preferences.users</string>
						<string>com.apple.preferences.appstore</string>
						<string>com.apple.preference.general</string>
						<string>com.apple.preferences.Bluetooth</string>
						<string>com.apple.preference.datetime</string>
						<string>com.apple.preference.desktopscreeneffect</string>
						<string>com.apple.preference.digihub.discs</string>
						<string>com.apple.preference.displays</string>
						<string>com.apple.preference.dock</string>
						<string>com.apple.preference.energysaver</string>
						<string>com.apple.preference.expose</string>
						<string>com.apple.preferences.extensions</string>
						<string>com.apple.prefpanel.fibrechannel</string>
						<string>com.apple.preference.ink</string>
						<string>com.apple.preferences.internetaccounts</string>
						<string>com.apple.preference.keyboard</string>
						<string>com.apple.Localization</string>
						<string>com.apple.preference.internet</string>
						<string>com.apple.preference.mouse</string>
						<string>com.apple.preference.network</string>
						<string>com.apple.preference.notifications</string>
						<string>com.apple.preferences.parentalcontrols</string>
						<string>com.apple.preference.printfax</string>
						<string>com.apple.preferences.configurationprofiles</string>
						<string>com.apple.preference.security</string>
						<string>com.apple.preferences.sharing</string>
						<string>com.apple.preferences.softwareupdate</string>
						<string>com.apple.preference.sound</string>
						<string>com.apple.preference.speech</string>
						<string>com.apple.preference.spotlight</string>
						<string>com.apple.preference.startupdisk</string>
						<string>com.apple.prefs.backup</string>
						<string>com.apple.preferences.password</string>
						<string>com.apple.preference.trackpad</string>
						<string>com.apple.preference.universalaccess</string>
						<string>com.apple.preferences.wallet</string>
						<string>com.apple.preferences.icloud</string>
						<string>com.apple.Xsan</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Users &amp; Groups</string>
						<string>App Store</string>
						<string>General</string>
						<string>Bluetooth</string>
						<string>Date &amp; Time</string>
						<string>Desktop &amp; Screen Saver</string>
						<string>CDs &amp; DVDs</string>
						<string>Displays</string>
						<string>Dock</string>
						<string>Energy Saver</string>
						<string>Mission Control</string>
						<string>Extensions</string>
						<string>Fibre Channel</string>
						<string>Ink</string>
						<string>Internet Accounts</string>
						<string>Keyboard</string>
						<string>Language &amp; Region</string>
						<string>MobileMe</string>
						<string>Mouse</string>
						<string>Network</string>
						<string>Notifications</string>
						<string>Parental Controls</string>
						<string>Printers &amp; Scanners</string>
						<string>Profiles</string>
						<string>Security &amp; Privacy</string>
						<string>Sharing</string>
						<string>Software Update</string>
						<string>Sound</string>
						<string>Siri</string>
						<string>Spotlight</string>
						<string>Startup Disk</string>
						<string>Time Machine</string>
						<string>Touch ID</string>
						<string>Trackpad</string>
						<string>Accessibility</string>
						<string>Wallet &amp; Apple Pay</string>
						<string>iCloud</string>
						<string>Xsan</string>
					</array>
					<key>pfm_title</key>
					<string></string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_type_input</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>System Preferences</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>
