<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define settings for virtual private networks.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/vpn</string>
	<key>pfm_domain</key>
	<string>com.apple.vpn.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_ios_min</key>
	<string>4.0</string>
	<key>pfm_last_modified</key>
	<date>2020-08-05T00:00:00Z</date>
	<key>pfm_macos_min</key>
	<string>10.7</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures VPN settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>VPN</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.vpn.managed</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.vpn.managed</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The description of the VPN connection displayed on the device</string>
			<key>pfm_name</key>
			<string>UserDefinedName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>User Defined Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>L2TP</string>
			<key>pfm_description</key>
			<string>Indicates the VPN service type and the setting fields that it requires</string>
			<key>pfm_name</key>
			<string>VPNType</string>
			<key>pfm_range_list</key>
			<array>
				<string>IKEv2</string>
				<string>AlwaysOn</string>
				<string>IPSec</string>
				<string>L2TP</string>
				<string>PPTP</string>
				<string>VPN</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>IKEv2</string>
				<string>IKEv2 Always-On (supervised only)</string>
				<string>IPSec</string>
				<string>L2TP</string>
				<string>PPTP</string>
				<string>Vendor-Specific VPN</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>VPN</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Bundle ID of a VPN plugin or of an app containing a network extension provider, for use in vendor specific VPN configurations.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>VPN</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>VPNSubType</string>
			<!-- <key>pfm_range_list_allow_custom_value</key>
			<true/>
			<key>pfm_range_list</key>
			<array>
				<string>com.cisco.anyconnect</string>
				<string>com.cisco.anyconnect.applevpn.plugin</string>
				<string>net.juniper.sslvpn</string>
				<string>net.pulsesecure.PulseSecure.vpnplugin</string>
				<string>com.f5.F5-Edge-Client.vpnplugin</string>
				<string>com.sonicwall.SonicWALL-SSLVPN.vpnplugin</string>
				<string>com.arubanetworks.aruba-via.vpnplugin</string>
				<string>com.checkpoint.CheckPoint-VPN.vpnplugin</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Cisco AnyConnect</string>
				<string>Cisco Legacy AnyConnect</string>
				<string>Juniper SSL</string>
				<string>Pulse Secure</string>
				<string>F5 SSL</string>
				<string>SonicWALL Mobile Connect</string>
				<string>Aruba VIA</string>
				<string>Check Point Mobile VPN</string>
			</array> -->
			<key>pfm_note</key>
			<string>In addition to a custom option, there are several known providers:

- Cisco AnyConnect: com.cisco.anyconnect
- Cisco Legacy AnyConnect: com.cisco.anyconnect.applevpn.plugin
- Juniper SSL: net.juniper.sslvpn
- Pulse Secure: net.pulsesecure.PulseSecure.vpnplugin
- F5 SSL: com.f5.F5-Edge-Client.vpnplugin
- SonicWALL Mobile Connect: com.sonicwall.SonicWALL-SSLVPN.vpnplugin
- Aruba VIA: com.arubanetworks.aruba-via.vpnplugin
- Check Point Mobile VPN: com.checkpoint.CheckPoint-VPN.vpnplugin</string>
			<key>pfm_title</key>
			<string>VPN Subtype</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Examples: com.cisco.anyconnect.applevpn.plugin, net.juniper.sslvpn, com.f5.F5-Edge-Client.vpnplugin</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<string>PPTP</string>
								<string>L2TP</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>PPP Settings for L2TP and PPTP VPN types</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_contains_any</key>
							<array>
								<string>PPTP</string>
								<string>L2TP</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>PPP</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>IP address or hostname of the VPN server</string>
					<key>pfm_name</key>
					<string>CommRemoteAddress</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Server</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Username for the VPN account</string>
					<key>pfm_name</key>
					<string>AuthName</string>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_title</key>
					<string>Account</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Password for the VPN account. Setting this disables the authentication plugin (AuthEAPPlugins) and the authentication protocol (AuthProtocol) fields</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>PPP.AuthEAPPlugins</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>PPP.AuthProtocol</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AuthPassword</string>
					<key>pfm_title</key>
					<string>Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>PPP.AuthProtocol</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>When using RSA SecurID, this array should contain the sole value of EAP-RSA. Setting this disables the password field (AuthPassword)</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>PPP.AuthPassword</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AuthEAPPlugins</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>EAP-RSA</string>
							<key>pfm_name</key>
							<string>EAPPluginElement</string>
							<key>pfm_range_list</key>
							<array>
								<string>EAP-RSA</string>
							</array>
							<key>pfm_repetition_max</key>
							<integer>1</integer>
							<key>pfm_repetition_min</key>
							<integer>1</integer>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Authentication Plugin</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>PPP.AuthEAPPlugins</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>When using RSA SecurID, this array should contain the sole value of EAP. Setting this disables the password field (AuthPassword)</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>PPP.AuthPassword</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AuthProtocol</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>EAP</string>
							<key>pfm_name</key>
							<string>AuthProtocolElement</string>
							<key>pfm_range_list</key>
							<array>
								<string>EAP</string>
							</array>
							<key>pfm_repetition_max</key>
							<integer>1</integer>
							<key>pfm_repetition_min</key>
							<integer>1</integer>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Authentication Protocol</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Sets the VPN connection to use a token card (e.gß. RSA SecurID) for authentication</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>L2TP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>TokenCard</string>
					<key>pfm_title</key>
					<string>Use Token Card</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Enables encryption on the connection in conjunciton with either CCPMPPE40Enabled or CCPMPPE128Enabled</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>PPTP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>CCPEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Encryption</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>In conjunction with Enable Encryption (CCPEnabled), enables CCPMPPE40 encryption on the connection. Enabling this disables the CCPMPPE128 encryption field</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>PPTP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>PPP.CCPEnabled</string>
								</dict>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>PPP.CCPMPPE128Enabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>CCPMPPE40Enabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable CCPMPPE40 Encryption</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>In conjunction with Enable Encryption (CCPEnabled), enables CCPMPPE128 encryption on the connection. Enabling this disables the CCPMPPE40 encryption field</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>PPTP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>PPP.CCPEnabled</string>
								</dict>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>PPP.CCPMPPE40Enabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>CCPMPPE128Enabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable CCPMPPE128 Encryption</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Disconnect an on demand connection after it becomes idle</string>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Time interval between a connection becoming idle and when it is finally disconnected, when Enable Disconnect on Idle (DisconnectOnIdle) is enabled. The value is an integer number representing seconds</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>PPP.DisconnectOnIdle</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Disconnect on Idle Interval</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>PPP</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>IKEv2</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Settings for IKEv2 VPN types</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>IKEv2</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>IKEv2</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>IP address or hostname of the VPN server</string>
					<key>pfm_name</key>
					<string>RemoteAddress</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Server</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>FQDN, UserFQDN, Address, or ASN1DN of the IKEv2 server</string>
					<key>pfm_name</key>
					<string>RemoteIdentifier</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Remote Identifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>FQDN, UserFQDN, Address, or ASN1DN of the IKEv2 client</string>
					<key>pfm_name</key>
					<string>LocalIdentifier</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Local Identifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>SharedSecret</string>
					<key>pfm_description</key>
					<string>Type of authentication method for use with the VPN connection. Set to None when enabling EAP (ExtendedAuthEnabled)</string>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_range_list</key>
					<array>
						<string>None</string>
						<string>SharedSecret</string>
						<string>Certificate</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>None</string>
						<string>Shared Secret</string>
						<string>Certificate</string>
					</array>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Authentication Method</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Enables extended authentication</string>
					<key>pfm_name</key>
					<string>ExtendedAuthEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable EAP-only authentication</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Username for EAP-only authentication</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.ExtendedAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AuthName</string>
					<key>pfm_title</key>
					<string>Authentication Name</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Password used for EAP-only  authentication</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.ExtendedAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AuthPassword</string>
					<key>pfm_title</key>
					<string>Authentication Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>1.0</string>
					<key>pfm_description</key>
					<string>The minimum TLS version to be used in EAP-only authentication</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.ExtendedAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>11.0</string>
					<key>pfm_macos_min</key>
					<string>10.13</string>
					<key>pfm_name</key>
					<string>TLSMinimumVersion</string>
					<key>pfm_range_list</key>
					<array>
						<string>1.0</string>
						<string>1.1</string>
						<string>1.2</string>
					</array>
					<key>pfm_title</key>
					<string>Minimum TLS</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>1.2</string>
					<key>pfm_description</key>
					<string>The maximum TLS version to be used in EAP-only authentication</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.ExtendedAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>11.0</string>
					<key>pfm_macos_min</key>
					<string>10.13</string>
					<key>pfm_name</key>
					<string>TLSMaximumVersion</string>
					<key>pfm_range_list</key>
					<array>
						<string>1.0</string>
						<string>1.1</string>
						<string>1.2</string>
					</array>
					<key>pfm_title</key>
					<string>Maximum TLS</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Shared secret string for the VPN connection</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>SharedSecret</string>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>SharedSecret</string>
					<key>pfm_title</key>
					<string>Shared Secret</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>UUID of a certificate payload in this profile that will be used for authentication</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.ExtendedAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>Certificate</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>RSA</string>
					<key>pfm_description</key>
					<string>Type of certificate used for authentication</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>CertificateType</string>
					<key>pfm_range_list</key>
					<array>
						<string>RSA</string>
						<string>ECDSA256</string>
						<string>ECDSA384</string>
						<string>ECDSA512</string>
						<string>Ed25519</string>
					</array>
					<key>pfm_title</key>
					<string>Certificate Type</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>IKEv2.CertificateType</string>
								</dict>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.ExtendedAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Common name of the server certificate issuer</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>ServerCertificateIssuerCommonName</string>
					<key>pfm_title</key>
					<string>Server Certificate Issuer Common Name</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Common name of the server certificate</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>ServerCertificateCommonName</string>
					<key>pfm_title</key>
					<string>Server Certificate Common Name</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Disconnect an on demand connection after it becomes idle</string>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Time interval between a connection becoming idle and when it is finally disconnected, when Enable Disconnect on Idle (DisconnectOnIdle) is enabled. The value is an integer number representing seconds</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.DisconnectOnIdle</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Disconnect on Idle Interval</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>Medium</string>
					<key>pfm_description</key>
					<string>Sets the frequency of sending a keepalive signal</string>
					<key>pfm_name</key>
					<string>DeadPeerDetectionRate</string>
					<key>pfm_range_list</key>
					<array>
						<string>None</string>
						<string>Low</string>
						<string>Medium</string>
						<string>High</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>None - keepalive not sent</string>
						<string>Low - keepalive sent every 30 minutes</string>
						<string>Medium - keepalive sent every 10 minutes</string>
						<string>High - keepalive sent every minute</string>
					</array>
					<key>pfm_title</key>
					<string>Dead Peer Detection Rate</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Disables connection redirection by redirect requests from VPN server</string>
					<key>pfm_name</key>
					<string>DisableRedirect</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Enable</string>
						<string>Disable</string>
					</array>
					<key>pfm_title</key>
					<string>Disable Redirects</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Disables mobility and multihoming (MOBIKE)</string>
					<key>pfm_name</key>
					<string>DisableMOBIKE</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Enable</string>
						<string>Disable</string>
					</array>
					<key>pfm_title</key>
					<string>Disable Mobility and Multihoming</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Enables the use of IKEv2 Configuration Attributes INTERNAL_IP4_SUBNET and INTERNAL_IP6_SUBNET in connection negotiation</string>
					<key>pfm_name</key>
					<string>UseConfigurationAttributeInternalIPSubnet</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable IPv4 / IPv6 Internal Subnet Attributes</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Enables Perfect Forward Secrecy for the VPN connection</string>
					<key>pfm_name</key>
					<string>EnablePFS</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Perfect Forward Secrecy</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Enables certificate revocation checks for the VPN connection</string>
					<key>pfm_name</key>
					<string>EnableCertificateRevocationCheck</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Certificate Revocation Check</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Enables Wi-Fi assist for the VPN connection</string>
					<key>pfm_name</key>
					<string>EnableFallback</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Wi-Fi Assist (Cellular Fallback)</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Parameters for IKE Security Association</string>
					<key>pfm_name</key>
					<string>IKESecurityAssociationParameters</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>AES-256</string>
							<key>pfm_name</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_range_list</key>
							<array>
								<string>DES</string>
								<string>3DES</string>
								<string>AES-128</string>
								<string>AES-256</string>
								<string>AES-128-GCM</string>
								<string>AES-256-GCM</string>
								<string>ChaCha20Poly1305</string>
							</array>
							<key>pfm_title</key>
							<string>IKE SA Encryption Algorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<string>SHA2-256</string>
							<key>pfm_name</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_range_list</key>
							<array>
								<string>SHA1-96</string>
								<string>SHA1-160</string>
								<string>SHA2-256</string>
								<string>SHA2-384</string>
								<string>SHA2-512</string>
							</array>
							<key>pfm_title</key>
							<string>IKE SA Integrity Algorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>14</integer>
							<key>pfm_name</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_range_list</key>
							<array>
								<integer>1</integer>
								<integer>2</integer>
								<integer>5</integer>
								<integer>14</integer>
								<integer>15</integer>
								<integer>16</integer>
								<integer>17</integer>
								<integer>18</integer>
								<integer>19</integer>
								<integer>20</integer>
								<integer>21</integer>
								<integer>31</integer>
							</array>
							<key>pfm_title</key>
							<string>IKE SA Diffie Hellman Group</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>1440</integer>
							<key>pfm_description</key>
							<string>SA lifetime (interval for rekey interval). The value is an integer number representing minutes</string>
							<key>pfm_name</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_range_max</key>
							<integer>1440</integer>
							<key>pfm_range_min</key>
							<integer>10</integer>
							<key>pfm_title</key>
							<string>IKE SA Lifetime</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>IKE Security Association Parameters</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Parameters for Child Security Association</string>
					<key>pfm_name</key>
					<string>ChildSecurityAssociationParameters</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>AES-256</string>
							<key>pfm_name</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_range_list</key>
							<array>
								<string>DES</string>
								<string>3DES</string>
								<string>AES-128</string>
								<string>AES-256</string>
								<string>AES-128-GCM</string>
								<string>AES-256-GCM</string>
								<string>ChaCha20Poly1305</string>
							</array>
							<key>pfm_title</key>
							<string>Child SA Encryption Algorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<string>SHA2-256</string>
							<key>pfm_name</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_range_list</key>
							<array>
								<string>SHA1-96</string>
								<string>SHA1-160</string>
								<string>SHA2-256</string>
								<string>SHA2-384</string>
								<string>SHA2-512</string>
							</array>
							<key>pfm_title</key>
							<string>Child SA Integrity Algorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>14</integer>
							<key>pfm_name</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_range_list</key>
							<array>
								<integer>1</integer>
								<integer>2</integer>
								<integer>5</integer>
								<integer>14</integer>
								<integer>15</integer>
								<integer>16</integer>
								<integer>17</integer>
								<integer>18</integer>
								<integer>19</integer>
								<integer>20</integer>
								<integer>21</integer>
								<integer>31</integer>
							</array>
							<key>pfm_title</key>
							<string>Child SA Diffie Hellman Group</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>1440</integer>
							<key>pfm_description</key>
							<string>SA lifetime (interval for rekey interval). The value is an integer number representing minutes</string>
							<key>pfm_name</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_range_max</key>
							<integer>1440</integer>
							<key>pfm_range_min</key>
							<integer>10</integer>
							<key>pfm_title</key>
							<string>Child SA Lifetime</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Child Security Association Parameters</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1280</integer>
					<key>pfm_name</key>
					<string>MTU</string>
					<key>pfm_title</key>
					<string>MTU</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>IKEv2</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>AlwaysOn</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Settings for always-on IKEv2 VPN type</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>AlwaysOn</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>AlwaysOn</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Allows traffic from all captive networking apps outside the VPN tunnel. Alternatively, specify apps in Allowed Captive Network Plugins (AllowedCaptiveNetworkPlugins)</string>
					<key>pfm_name</key>
					<string>AllowAllCaptiveNetworkPlugins</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disallow</string>
						<string>Allow</string>
					</array>
					<key>pfm_title</key>
					<string>Allow All Captive Network Plugins</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Allows traffic from captive web portal outside the VPN tunnel</string>
					<key>pfm_name</key>
					<string>AllowCaptiveWebSheet</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disallow</string>
						<string>Allow</string>
					</array>
					<key>pfm_title</key>
					<string>Allow Captive Web Sheet</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Bundle ID list of specific approved captive networking apps, for use when not allowing all captive network plugins (AllowAllCaptiveNetworkPlugins)</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>AllowAllCaptiveNetworkPlugins</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AllowedCaptiveNetworkPlugins</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>BundleIdentifier</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Allowed Captive Network Plugins</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>ServiceExceptions</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>ServiceExceptionsElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>Services to exmept from Always-On VPN</string>
									<key>pfm_name</key>
									<string>ServiceName</string>
									<key>pfm_range_list</key>
									<array>
										<string>VoiceMail</string>
										<string>AirPrint</string>
										<string>CellularServices</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Voice Mail</string>
										<string>AirPrint</string>
										<string>Cellular Services</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Exempt Services</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Defines treatment of network connections from from specified services</string>
									<key>pfm_name</key>
									<string>Action</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Drop</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Action</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Service Exceptions Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Service Exceptions</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Per-interface always-on IKEv2 VPN connection settings</string>
					<key>pfm_name</key>
					<string>TunnelConfigurations</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>TunnelConfiguration</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>Interfaces</string>
									<key>pfm_range_list</key>
									<array>
										<string>Cellular</string>
										<string>Wifi</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Cellular</string>
										<string>Wi-Fi</string>
									</array>
									<key>pfm_title</key>
									<string>Interfaces</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>IKEv2</string>
									<key>pfm_description</key>
									<string>Must be set to "IKEv2" when configuring always-on VPN connections</string>
									<key>pfm_name</key>
									<string>ProtocolType</string>
									<key>pfm_range_list</key>
									<array>
										<string>IKEv2</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Protocol Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>IP address or hostname of the VPN server</string>
									<key>pfm_name</key>
									<string>RemoteAddress</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Server</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>FQDN, UserFQDN, Address, or ASN1DN of the IKEv2 server</string>
									<key>pfm_name</key>
									<string>RemoteIdentifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Remote Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>FQDN, UserFQDN, Address, or ASN1DN of the IKEv2 client</string>
									<key>pfm_name</key>
									<string>LocalIdentifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Local Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>SharedSecret</string>
									<key>pfm_description</key>
									<string>Type of authentication method for use with the VPN connection. Set to None when enabling EAP (ExtendedAuthEnabled)</string>
									<key>pfm_name</key>
									<string>AuthenticationMethod</string>
									<key>pfm_range_list</key>
									<array>
										<string>None</string>
										<string>SharedSecret</string>
										<string>Certificate</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>None</string>
										<string>Shared Secret</string>
										<string>Certificate</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Authentication Method</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Enables extended authentication</string>
									<key>pfm_name</key>
									<string>ExtendedAuthEnabled</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Disable</string>
										<string>Enable</string>
									</array>
									<key>pfm_title</key>
									<string>Enable EAP-only authentication</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Username for EAP-only authentication</string>
									<key>pfm_name</key>
									<string>AuthName</string>
									<key>pfm_title</key>
									<string>Authentication Name</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Password used for EAP-only  authentication</string>
									<key>pfm_name</key>
									<string>AuthPassword</string>
									<key>pfm_title</key>
									<string>Authentication Password</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>1.0</string>
									<key>pfm_description</key>
									<string>The minimum TLS version to be used in EAP-only authentication</string>
									<key>pfm_ios_min</key>
									<string>11.0</string>
									<key>pfm_macos_min</key>
									<string>10.13</string>
									<key>pfm_name</key>
									<string>TLSMinimumVersion</string>
									<key>pfm_range_list</key>
									<array>
										<string>1.0</string>
										<string>1.1</string>
										<string>1.2</string>
									</array>
									<key>pfm_title</key>
									<string>Minimum TLS</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>1.2</string>
									<key>pfm_description</key>
									<string>The maximum TLS version to be used in EAP-only authentication</string>
									<key>pfm_ios_min</key>
									<string>11.0</string>
									<key>pfm_macos_min</key>
									<string>10.13</string>
									<key>pfm_name</key>
									<string>TLSMaximumVersion</string>
									<key>pfm_range_list</key>
									<array>
										<string>1.0</string>
										<string>1.1</string>
										<string>1.2</string>
									</array>
									<key>pfm_title</key>
									<string>Maximum TLS</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Shared secret string for the VPN connection</string>
									<key>pfm_name</key>
									<string>SharedSecret</string>
									<key>pfm_title</key>
									<string>Shared Secret</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>UUID of a certificate payload in this profile that will be used for authentication</string>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_range_list</key>
													<array>
														<true/>
													</array>
													<key>pfm_target</key>
													<string>AlwaysOn.ExtendedAuthEnabled</string>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_name</key>
									<string>PayloadCertificateUUID</string>
									<key>pfm_title</key>
									<string>Certificate</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>RSA</string>
									<key>pfm_description</key>
									<string>Type of certificate used for authentication</string>
									<key>pfm_name</key>
									<string>CertificateType</string>
									<key>pfm_range_list</key>
									<array>
										<string>RSA</string>
										<string>ECDSA256</string>
										<string>ECDSA384</string>
										<string>ECDSA512</string>
										<string>Ed25519</string>
									</array>
									<key>pfm_title</key>
									<string>Certificate Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Common name of the server certificate issuer</string>
									<key>pfm_name</key>
									<string>ServerCertificateIssuerCommonName</string>
									<key>pfm_title</key>
									<string>Server Certificate Issuer Common Name</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Common name of the server certificate</string>
									<key>pfm_name</key>
									<string>ServerCertificateCommonName</string>
									<key>pfm_title</key>
									<string>Server Certificate Common Name</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Disconnect an on demand connection after it becomes idle</string>
									<key>pfm_name</key>
									<string>DisconnectOnIdle</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Disable</string>
										<string>Enable</string>
									</array>
									<key>pfm_title</key>
									<string>Enable Disconnect on Idle</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Time interval between a connection becoming idle and when it is finally disconnected, when Enable Disconnect on Idle (DisconnectOnIdle) is enabled. The value is an integer number representing seconds</string>
									<key>pfm_name</key>
									<string>DisconnectOnIdleTimer</string>
									<key>pfm_range_min</key>
									<integer>0</integer>
									<key>pfm_title</key>
									<string>Disconnect on Idle Interval</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>Medium</string>
									<key>pfm_description</key>
									<string>Sets the frequency of sending a keepalive signal</string>
									<key>pfm_name</key>
									<string>DeadPeerDetectionRate</string>
									<key>pfm_range_list</key>
									<array>
										<string>None</string>
										<string>Low</string>
										<string>Medium</string>
										<string>High</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>None - keepalive not sent</string>
										<string>Low - keepalive sent every 30 minutes</string>
										<string>Medium - keepalive sent every 10 minutes</string>
										<string>High - keepalive sent every minute</string>
									</array>
									<key>pfm_title</key>
									<string>Dead Peer Detection Rate</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Disables connection redirection by redirect requests from VPN server</string>
									<key>pfm_name</key>
									<string>DisableRedirect</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Enable</string>
										<string>Disable</string>
									</array>
									<key>pfm_title</key>
									<string>Disable Redirects</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Disables mobility and multihoming (MOBIKE)</string>
									<key>pfm_name</key>
									<string>DisableMOBIKE</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Enable</string>
										<string>Disable</string>
									</array>
									<key>pfm_title</key>
									<string>Disable Mobility and Multihoming</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Enables the use of IKEv2 Configuration Attributes INTERNAL_IP4_SUBNET and INTERNAL_IP6_SUBNET in connection negotiation</string>
									<key>pfm_name</key>
									<string>UseConfigurationAttributeInternalIPSubnet</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Disable</string>
										<string>Enable</string>
									</array>
									<key>pfm_title</key>
									<string>Enable IPv4 / IPv6 Internal Subnet Attributes</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Enables Perfect Forward Secrecy for the VPN connection</string>
									<key>pfm_name</key>
									<string>EnablePFS</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Disable</string>
										<string>Enable</string>
									</array>
									<key>pfm_title</key>
									<string>Enable Perfect Forward Secrecy</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Enables certificate revocation checks for the VPN connection</string>
									<key>pfm_name</key>
									<string>EnableCertificateRevocationCheck</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Disable</string>
										<string>Enable</string>
									</array>
									<key>pfm_title</key>
									<string>Enable Certificate Revocation Check</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Enables Wi-Fi assist for the VPN connection</string>
									<key>pfm_name</key>
									<string>EnableFallback</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Disable</string>
										<string>Enable</string>
									</array>
									<key>pfm_title</key>
									<string>Enable Wi-Fi Assist (Cellular Fallback)</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Parameters for IKE Security Association</string>
									<key>pfm_name</key>
									<string>IKESecurityAssociationParameters</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_default</key>
											<string>AES-256</string>
											<key>pfm_name</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_range_list</key>
											<array>
												<string>DES</string>
												<string>3DES</string>
												<string>AES-128</string>
												<string>AES-256</string>
												<string>AES-128-GCM</string>
												<string>AES-256-GCM</string>
												<string>ChaCha20Poly1305</string>
											</array>
											<key>pfm_title</key>
											<string>IKE SA Encryption Algorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_default</key>
											<string>SHA2-256</string>
											<key>pfm_name</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_range_list</key>
											<array>
												<string>SHA1-96</string>
												<string>SHA1-160</string>
												<string>SHA2-256</string>
												<string>SHA2-384</string>
												<string>SHA2-512</string>
											</array>
											<key>pfm_title</key>
											<string>IKE SA Integrity Algorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_default</key>
											<integer>14</integer>
											<key>pfm_name</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_range_list</key>
											<array>
												<integer>1</integer>
												<integer>2</integer>
												<integer>5</integer>
												<integer>14</integer>
												<integer>15</integer>
												<integer>16</integer>
												<integer>17</integer>
												<integer>18</integer>
												<integer>19</integer>
												<integer>20</integer>
												<integer>21</integer>
												<integer>31</integer>
											</array>
											<key>pfm_title</key>
											<string>IKE SA Diffie Hellman Group</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
										<dict>
											<key>pfm_default</key>
											<integer>1440</integer>
											<key>pfm_description</key>
											<string>SA lifetime (interval for rekey interval). The value is an integer number representing minutes</string>
											<key>pfm_name</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_range_max</key>
											<integer>1440</integer>
											<key>pfm_range_min</key>
											<integer>10</integer>
											<key>pfm_title</key>
											<string>IKE SA Lifetime</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>IKE Security Association Parameters</string>
									<key>pfm_type</key>
									<string>dictionary</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Parameters for Child Security Association</string>
									<key>pfm_name</key>
									<string>ChildSecurityAssociationParameters</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_default</key>
											<string>AES-256</string>
											<key>pfm_name</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_range_list</key>
											<array>
												<string>DES</string>
												<string>3DES</string>
												<string>AES-128</string>
												<string>AES-256</string>
												<string>AES-128-GCM</string>
												<string>AES-256-GCM</string>
												<string>ChaCha20Poly1305</string>
											</array>
											<key>pfm_title</key>
											<string>Child SA Encryption Algorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_default</key>
											<string>SHA2-256</string>
											<key>pfm_name</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_range_list</key>
											<array>
												<string>SHA1-96</string>
												<string>SHA1-160</string>
												<string>SHA2-256</string>
												<string>SHA2-384</string>
												<string>SHA2-512</string>
											</array>
											<key>pfm_title</key>
											<string>Child SA Integrity Algorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_default</key>
											<integer>14</integer>
											<key>pfm_name</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_range_list</key>
											<array>
												<integer>1</integer>
												<integer>2</integer>
												<integer>5</integer>
												<integer>14</integer>
												<integer>15</integer>
												<integer>16</integer>
												<integer>17</integer>
												<integer>18</integer>
												<integer>19</integer>
												<integer>20</integer>
												<integer>21</integer>
												<integer>31</integer>
											</array>
											<key>pfm_title</key>
											<string>Child SA Diffie Hellman Group</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
										<dict>
											<key>pfm_default</key>
											<integer>1440</integer>
											<key>pfm_description</key>
											<string>SA lifetime (interval for rekey interval). The value is an integer number representing minutes</string>
											<key>pfm_name</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_range_max</key>
											<integer>1440</integer>
											<key>pfm_range_min</key>
											<integer>10</integer>
											<key>pfm_title</key>
											<string>Child SA Lifetime</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>Child Security Association Parameters</string>
									<key>pfm_type</key>
									<string>dictionary</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>1280</integer>
									<key>pfm_name</key>
									<string>MTU</string>
									<key>pfm_title</key>
									<string>MTU</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>1</integer>
									<key>pfm_description</key>
									<string>Set to 1 to enable NAT Keepalive offload for Always-on VPN IKEv2 connections</string>
									<key>pfm_name</key>
									<string>NATKeepAliveOffloadEnable</string>
									<key>pfm_title</key>
									<string>Enable NAT keepalive while the device is asleep</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>110</integer>
									<key>pfm_description</key>
									<string>NAT Keepalive interval for Always-on VPN IKEv2 connections. This value controls the interval over which Keepalive offload packets are sent by the device. The minimum value is 20 seconds. If no key is specified, the default is 20 seconds over Wi-Fi and 110 seconds over Cellular interface.</string>
									<key>pfm_name</key>
									<string>NATKeepAliveInterval</string>
									<key>pfm_title</key>
									<string>NAT Keepalive Interval</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Tunnel Configuration</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Tunnel Configurations</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Permits the user to toggle the VPN configuration via the UI</string>
					<key>pfm_name</key>
					<string>UIToggleEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Allow User Toggle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>IKEv2 Always-On</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>IKEv2</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>DNS settings for IKEv2 VPN types</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>IKEv2</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>10</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>DNS</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The primary domain of the VPN connection. Use when defining DNS settings</string>
					<key>pfm_name</key>
					<string>DomainName</string>
					<key>pfm_title</key>
					<string>Domain Name</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>DNS server addresses. Can contain both IPv4 and IPv6 addresses</string>
					<key>pfm_name</key>
					<string>ServerAddresses</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>ServerAddressesElement</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Server Addresses</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>List of domain names used when qualifying single-label hostnames</string>
					<key>pfm_name</key>
					<string>SearchDomains</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>SearchDomainsElement</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Search Domains</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Domains to be looked up using DNS servers listed in the Server Addresses (ServerAddresses) field</string>
					<key>pfm_name</key>
					<string>SupplementalMatchDomains</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>SupplementalMatchDomainsElement</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Supplemental Match Domains</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_name</key>
					<string>SupplementalMatchDomainsNoSearch</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Append</string>
						<string>Do not append</string>
					</array>
					<key>pfm_title</key>
					<string>Append Supplemental Match Domains to Search Domains</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>DNS</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>IPSec</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Settings for IPSec VPN type</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>IPSec</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>IPSec</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>IP address or hostname of the VPN server</string>
					<key>pfm_name</key>
					<string>RemoteAddress</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Server</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Enables XAUTH for a Cisco IPSec VPN connection</string>
					<key>pfm_name</key>
					<string>XAuthEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable XAUTH</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Username for the VPN account</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.XAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>XAuthName</string>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_title</key>
					<string>Account</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Password for the VPN account</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.XAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>XAuthPassword</string>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_title</key>
					<string>Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Determines if the user shall be prompted for an XAUTH password for a Cisco IPsec VPN connection</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.XAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>XAuthPasswordEncryption</string>
					<key>pfm_range_list</key>
					<array>
						<string>Prompt</string>
					</array>
					<key>pfm_title</key>
					<string>Prompt for XAUTH Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>SharedSecret</string>
					<key>pfm_description</key>
					<string>Type of authentication method for use with the VPN connection</string>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_range_list</key>
					<array>
						<string>SharedSecret</string>
						<string>Certificate</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Shared Secret</string>
						<string>Certificate</string>
					</array>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Authentication Method</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The name of the group for Cisco IPSec. To enable Hybrid Authentication append "[hybrid]" to this value</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>SharedSecret</string>
									</array>
									<key>pfm_target</key>
									<string>IPSec.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>LocalIdentifier</string>
					<key>pfm_title</key>
					<string>Group Name</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>KeyID</string>
					<key>pfm_description</key>
					<string>Value can only be "KeyID". Preference is excluded if Authentication Method (AuthenticationMethod) is not "SharedSecret"</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>SharedSecret</string>
									</array>
									<key>pfm_target</key>
									<string>IPSec.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>LocalIdentifierType</string>
					<key>pfm_range_list</key>
					<array>
						<string>KeyID</string>
					</array>
					<key>pfm_title</key>
					<string>Local Identifier Type</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Shared secret string for a Cisco IPsec VPN connection</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>SharedSecret</string>
									</array>
									<key>pfm_target</key>
									<string>IPSec.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>SharedSecret</string>
					<key>pfm_title</key>
					<string>Shared Secret</string>
					<key>pfm_type</key>
					<string>data</string>
					<key>pfm_type_input</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>UUID of a certificate payload in this profile that will be used for authentication for a Cisco IPSec VPN connection</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>IPSec.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>Certificate</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Enables prompting the user for their PIN on connection to a Cisco IPSec VPN</string>
					<key>pfm_name</key>
					<string>PromptForVPNPIN</string>
					<key>pfm_title</key>
					<string>Prompt for User PIN</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Enables the VPN connection on-demand</string>
					<key>pfm_name</key>
					<string>OnDemandEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable VPN On-Demand</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Deprecated. List of domain names that will always establish a VPN connection on-demand</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_deprecated</key>
					<string>7</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsAlways</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainAlwaysElement</string>
							<key>pfm_title</key>
							<string>Match Domain Always Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Domains to Always Establish On-Demand VPN</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Deprecated. List of domain names that will never establish an on-demand VPN connection</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_deprecated</key>
					<string>7</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsNever</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainNeverElement</string>
							<key>pfm_title</key>
							<string>Match Domain Never Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Domains to Never Establish On-Demand VPN</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Deprecated. List of domain names that will establish a VPN connection on-demand if needed</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_deprecated</key>
					<string>7</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsOnRetry</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainOnRetryElement</string>
							<key>pfm_title</key>
							<string>Match Domain On Retry Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Domains to Establish On-Demand VPN If Needed</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Rules for establishing VPN connection on-demand</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OnDemandRules</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>OnDemandRulesElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>Action</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Connect</string>
										<string>Disconnect</string>
										<string>EvaluateConnection</string>
										<string>Ignore</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Allow</string>
										<string>Connect</string>
										<string>Disconnect</string>
										<string>Evaluate Connection</string>
										<string>Ignore</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>On Demand Action</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>DNSDomainMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSDomainMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Domain Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
											<key>pfm_value_placeholder</key>
											<string>*.example.com</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Domain Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>DNSServerAddressMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSServerAddressMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Server Address Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Server IP Address Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>URLStringProbe</string>
									<key>pfm_title</key>
									<string>Test URL</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>InterfaceTypeMatch</string>
									<key>pfm_range_list</key>
									<array>
										<string>Ethernet</string>
										<string>WiFi</string>
										<string>Cellular</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Ethernet</string>
										<string>Wi-Fi</string>
										<string>Cellular</string>
									</array>
									<key>pfm_title</key>
									<string>Primary Interface Type Match</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>ActionParameters</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DomainAction</string>
											<key>pfm_range_list</key>
											<array>
												<string>ConnectIfNeeded</string>
												<string>NeverConnect</string>
											</array>
											<key>pfm_range_list_titles</key>
											<array>
												<string>Connect If Needed</string>
												<string>Never Connect</string>
											</array>
											<key>pfm_require</key>
											<string>always</string>
											<key>pfm_title</key>
											<string>Per Connection Domain Action</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_name</key>
											<string>Domains</string>
											<key>pfm_require</key>
											<string>always</string>
											<key>pfm_subkeys</key>
											<array>
												<dict>
													<key>pfm_name</key>
													<string>DomainsElement</string>
													<key>pfm_title</key>
													<string>Per Connection Domain Matches Element</string>
													<key>pfm_type</key>
													<string>string</string>
												</dict>
											</array>
											<key>pfm_title</key>
											<string>Per Connection Domain Matches</string>
											<key>pfm_type</key>
											<string>array</string>
										</dict>
										<dict>
											<key>pfm_name</key>
											<string>RequiredDNSServers</string>
											<key>pfm_subkeys</key>
											<array>
												<dict>
													<key>pfm_name</key>
													<string>RequiredDNSServersElement</string>
													<key>pfm_title</key>
													<string>Per Connection Required DNS Servers Element</string>
													<key>pfm_type</key>
													<string>string</string>
												</dict>
											</array>
											<key>pfm_title</key>
											<string>Per Connection Required DNS Servers</string>
											<key>pfm_type</key>
											<string>array</string>
										</dict>
										<dict>
											<key>pfm_name</key>
											<string>RequiredURLStringProbe</string>
											<key>pfm_title</key>
											<string>Per Connection Required Test URL</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>Action Parameters</string>
									<key>pfm_type</key>
									<string>dictionary</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>On Demand Rules Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>VPN On-Demand Rules</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Disconnect an on demand connection after it becomes idle</string>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Time interval between a connection becoming idle and when it is finally disconnected, when Enable Disconnect on Idle (DisconnectOnIdle) is enabled. The value is an integer number representing seconds</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.DisconnectOnIdle</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Disconnect on Idle Interval</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>IPSec Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_range_list</key>
							<array>
								<string>VPN</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Filtering service vendor configuration dictionary</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>VPN</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>VPNSubType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>VendorConfig</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_contains_any</key>
									<array>
										<string>com.cisco.anyconnect</string>
										<string>com.cisco.anyconnect.applevpn.plugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Group on connection to a head end. Applicable for Cisco AnyConnect connections</string>
					<key>pfm_name</key>
					<string>Group</string>
					<key>pfm_title</key>
					<string>Vendor-Specific Group</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>com.sonicwall.SonicWALL-SSLVPN.vpnplugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>LoginGroupOrDomain</string>
					<key>pfm_title</key>
					<string>Vendor-Specific Login Group or Domain</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_contains_any</key>
									<array>
										<string>net.juniper.sslvpn</string>
										<string>net.pulsesecure.PulseSecure.vpnplugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Case-sensitive connected realm name for Kerberos</string>
					<key>pfm_name</key>
					<string>Realm</string>
					<key>pfm_title</key>
					<string>Vendor-Specific Kerberos Realm Name</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_contains_any</key>
									<array>
										<string>net.juniper.sslvpn</string>
										<string>net.pulsesecure.PulseSecure.vpnplugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Role on connection to a server. Applicable for Juniper SSL connections</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<string>net.juniper.sslvpn</string>
										<string>net.pulsesecure.PulseSecure.vpnplugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>Role</string>
					<key>pfm_note</key>
					<string>Due to how this preference is configured, if you happen to enter a VPNSubType value other than net.juniper.sslvpn or net.pulsesecure.PulseSecure.vpnplugin, which does not require this preference, it is still visually added automatically in the GUI. Note that despite this the exclusion rule will prevent the preference from being unnecessarily added to the profile.</string>
					<key>pfm_title</key>
					<string>Vendor-Specific Role</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Vendor Configuration</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>VPN</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>VPN Settings</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>VPN</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>VPN</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>IP address or hostname of the VPN server</string>
					<key>pfm_name</key>
					<string>RemoteAddress</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Server</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The VPN account username</string>
					<key>pfm_name</key>
					<string>AuthName</string>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_title</key>
					<string>Account Username</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>VPN</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_default</key>
					<string>Password</string>
					<key>pfm_description</key>
					<string>Type of authentication method for use with the VPN connection</string>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_range_list</key>
					<array>
						<string>Password</string>
						<string>Certificate</string>
						<string>Password+Certificate</string>
					</array>
					<key>pfm_title</key>
					<string>Authentication Method</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The VPN user password</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<string>Password</string>
										<string>Password+Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>VPN.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AuthPassword</string>
					<key>pfm_title</key>
					<string>Account Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>UUID of a certificate payload in this profile that will be used for authentication</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<string>Certificate</string>
										<string>Password+Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>VPN.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>Certificate</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Enables the VPN connection on-demand</string>
					<key>pfm_name</key>
					<string>OnDemandEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable VPN On-Demand</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Deprecated. List of domain names that will always establish a VPN connection on-demand</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_deprecated</key>
					<string>7</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsAlways</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainAlwaysElement</string>
							<key>pfm_title</key>
							<string>Match Domain Always Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Domains to Always Establish On-Demand VPN</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Deprecated. List of domain names that will never establish an on-demand VPN connection</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_deprecated</key>
					<string>7</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsNever</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainNeverElement</string>
							<key>pfm_title</key>
							<string>Match Domain Never Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Domains to Never Establish On-Demand VPN</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Deprecated. List of domain names that will establish a VPN connection on-demand if needed</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_deprecated</key>
					<string>7</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsOnRetry</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainOnRetryElement</string>
							<key>pfm_title</key>
							<string>Match Domain On Retry Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Domains to Establish On-Demand VPN If Needed</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Rules for establishing VPN connection on-demand</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OnDemandRules</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>OnDemandRulesElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>Action</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Connect</string>
										<string>Disconnect</string>
										<string>EvaluateConnection</string>
										<string>Ignore</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Allow</string>
										<string>Connect</string>
										<string>Disconnect</string>
										<string>Evaluate Connection</string>
										<string>Ignore</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>On Demand Action</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>DNSDomainMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSDomainMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Domain Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
											<key>pfm_value_placeholder</key>
											<string>*.example.com</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Domain Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>DNSServerAddressMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSServerAddressMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Server Address Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Server IP Address Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>URLStringProbe</string>
									<key>pfm_title</key>
									<string>Test URL</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>On Demand Rules Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>VPN On-Demand Rules</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OnDemandUserOverrideDisabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Enable</string>
						<string>Disable</string>
					</array>
					<key>pfm_title</key>
					<string>Disable On-Demand User Override</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Enables all network traffic to be sent over the VPN connection instead of over the primary network interface. To be set in conjunction with IPv4.OverridePrimary</string>
					<key>pfm_name</key>
					<string>IncludeAllNetworks</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Sending All Traffic Over VPN</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.IncludeAllNetworks</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>When sending all traffic over the VPN, exclude traffic destined exclusively for the local network</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.IncludeAllNetworks</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>ExcludeLocalNetworks</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Exclude Local Networks</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>packet-tunnel</string>
					<key>pfm_description</key>
					<string>Switches between </string>
					<key>pfm_name</key>
					<string>ProviderType</string>
					<key>pfm_range_list</key>
					<array>
						<string>packet-tunnel</string>
						<string>app-proxy</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Tunnel Traffic at IP Level</string>
						<string>Tunnel Traffic at Application Level</string>
					</array>
					<key>pfm_title</key>
					<string>Tunnel Provider Type</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Bundle ID for the VPN connection provider</string>
					<key>pfm_name</key>
					<string>ProviderBundleIdentifier</string>
					<key>pfm_title</key>
					<string>Provider Bundle Identifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Applicable when the VPN connection is provided by a system extension</string>
					<key>pfm_name</key>
					<string>ProviderDesignatedRequirement</string>
					<key>pfm_title</key>
					<string>Provider Designated Requirement</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Disconnect an on demand connection after it becomes idle</string>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disabled</string>
						<string>Enabled</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Time interval between a connection becoming idle and when it is finally disconnected, when Enable Disconnect on Idle (DisconnectOnIdle) is enabled. The value is an integer number representing seconds</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.DisconnectOnIdle</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Disconnect on Idle Interval</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Settings for Vendor-Specific VPN type</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<string>VPN</string>
								<string>L2TP</string>
								<string>PPTP</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Dictionary containing settings for VPN types L2TP, PPTP, and Vendor Specific VPN</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_contains_any</key>
							<array>
								<string>VPN</string>
								<string>L2TP</string>
								<string>PPTP</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>IPv4</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Enables all network traffic to be sent over the VPN connection instead of over the primary network interface</string>
					<key>pfm_name</key>
					<string>OverridePrimary</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Sending All Traffic Over VPN</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>IPv4 Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Proxy Settings for all VPN types</string>
			<key>pfm_name</key>
			<string>Proxies</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_name</key>
					<string>HTTPEnable</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable HTTP Proxy</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_name</key>
					<string>HTTPSEnable</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable HTTPS Proxy</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Proxy URL</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPProxy</string>
					<key>pfm_title</key>
					<string>HTTP Proxy Hostname</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>Proxies.HTTPProxy</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPPort</string>
					<key>pfm_range_max</key>
					<integer>65535</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>HTTP Proxy Port</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPSProxy</string>
					<key>pfm_title</key>
					<string>HTTPS Proxy Hostname</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>Proxies.HTTPSProxy</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPSPort</string>
					<key>pfm_range_max</key>
					<integer>65535</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>HTTPS Proxy Port</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPProxyUsername</string>
					<key>pfm_title</key>
					<string>HTTP/HTTPS Proxy Username</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPProxyPassword</string>
					<key>pfm_title</key>
					<string>HTTP/HTTPS Proxy Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_name</key>
					<string>ProxyAutoConfigEnable</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Proxy AutoConfig</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoConfigEnable</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoConfigURLString</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>ProxyAutoDiscoveryEnable</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Proxy Auto-Discovery</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoConfigEnable</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoDiscoveryEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>ProxyAutoConfigURLString</string>
					<key>pfm_title</key>
					<string>Proxy AutoConfig Server URL</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Host domains for which host proxy setting will be used</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>SupplementalMatchDomains</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>SupplementalMatchDomainsElement</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Proxy Applicable Hosts</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Proxies</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>VPN</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
