<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define settings for network relays.</string>
	<key>pfm_domain</key>
	<string>com.apple.relay.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_ios_min</key>
	<string>17.0</string>
	<key>pfm_last_modified</key>
	<date>2023-11-30T15:08:23Z</date>
	<key>pfm_macos_min</key>
	<string>14.0</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Use this section to define settings for network relays.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Relay</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.relay.managed</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.relay.managed</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of dictionaries that describes one or more relay servers that can be chained together.</string>
			<key>pfm_name</key>
			<string>Relays</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>Relay</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The URL or URI template (such as defined in RFC 9298) of a relay server that is reachable using HTTP/3 and supports proxying TCP and UDP using the CONNECT method. Each relay must have at least one URL, for either HTTP/3 or HTTP/2, and may support both.</string>
							<key>pfm_name</key>
							<string>HTTP3RelayURL</string>
							<key>pfm_title</key>
							<string>HTTP/3 Relay URL</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The URL or URI template (such as defined in RFC 9298) of a relay server that is reachable using HTTP/2 and supports proxying TCP and UDP using the CONNECT method. Each relay must have at least one URL, for either HTTP/3 or HTTP/2, and may support both.</string>
							<key>pfm_name</key>
							<string>HTTP2RelayURL</string>
							<key>pfm_title</key>
							<string>HTTP/2 Relay URL</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>A dictionary of custom HTTP header keys and values to add to each request to the relay. The dictionary key name represents the HTTP header field name to use, and the dictionary value is the string to use as the HTTP header field value.</string>
							<key>pfm_name</key>
							<string>AdditionalHTTPHeaderFields</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string></string>
									<key>pfm_name</key>
									<string>{{key}}</string>
									<key>pfm_repetition_min</key>
									<integer>1</integer>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_unique</key>
									<true/>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string></string>
									<key>pfm_name</key>
									<string>{{value}}</string>
									<key>pfm_repetition_min</key>
									<integer>1</integer>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Additional HTTP Header Fields</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>UUID pointing to an identity certificate payload. This identity will be used to authenticate the user to the relay server.</string>
							<key>pfm_name</key>
							<string>PayloadCertificateUUID</string>
							<key>pfm_title</key>
							<string>Certificate UUID</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>An array of raw public keys used to authenticate the server during a TLS handshake. The server must use one of the keys in the handshake in order to authenticate. If no keys are specified, default TLS trust evaluation is used.</string>
							<key>pfm_name</key>
							<string>RawPublicKeys</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>RawPublicKeysElement</string>
									<key>pfm_title</key>
									<string>Raw Public Key Element</string>
									<key>pfm_type</key>
									<string>data</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Raw Public Keys</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Network Relay</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Relays</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A list of domain strings used to determine which connection should be routed through the servers contained in Relays. Any connection that matches the domain exactly or is a subdomain of the listed domain will use the relay servers, unless they match an excluded domain. If no domains are listed, traffic to all domains, except those matching an excluded domain, will be routed to the relay servers.</string>
			<key>pfm_name</key>
			<string>MatchDomains</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>MatchDomainsElement</string>
					<key>pfm_title</key>
					<string>Match Domains Element</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Match Domains</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A list of domain strings that should not be routed through the servers contained in Relays. Any connection that matches the domain exactly or is a subdomain of the listed domain will not use the relay server.</string>
			<key>pfm_name</key>
			<string>ExcludedDomains</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>ExcludedDomainsElement</string>
					<key>pfm_title</key>
					<string>Excluded Domains Element</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Excluded Domains</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A globally-unique identifier for this relay configuration. This UUID is used to route managed apps through the servers contained in Relays.</string>
			<key>pfm_name</key>
			<string>RelayUUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Relay</string>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
