<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Firewall settings</string>
	<key>pfm_domain</key>
	<string>com.apple.security.firewall</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2023-11-23T13:57:28Z</date>
	<key>pfm_macos_min</key>
	<string>10.12</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Firewall settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Firewall</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.security.firewall</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.security.firewall</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If 'true', enables the firewall.</string>
			<key>pfm_name</key>
			<string>EnableFirewall</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Enable Firewall</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables blocking of all incoming connections.</string>
			<key>pfm_name</key>
			<string>BlockAllIncoming</string>
			<key>pfm_title</key>
			<string>Block All Incoming Connections</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables stealth mode.</string>
			<key>pfm_name</key>
			<string>EnableStealthMode</string>
			<key>pfm_title</key>
			<string>Enable Stealth Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_allowed_file_types</key>
			<array>
				<string>com.apple.application-bundle</string>
			</array>
			<key>pfm_description</key>
			<string>The list of apps with connections controlled by the firewall.</string>
			<key>pfm_name</key>
			<string>Applications</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A firewall application item-</string>
					<key>pfm_name</key>
					<string>ApplicationItem</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Identifies the application</string>
							<key>pfm_name</key>
							<string>BundleID</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Bundle ID</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Name of application (Undocumented)</string>
							<key>pfm_name</key>
							<string>Name</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Specifies whether or not incoming connections are allowed.</string>
							<key>pfm_name</key>
							<string>Allowed</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Allowed</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Application Item</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Applications</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_value_import_processor</key>
			<string>com.apple.security.firewall.Applications</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables logging.
Available in macOS 12 and later.</string>
			<key>pfm_macos_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>EnableLogging</string>
			<key>pfm_title</key>
			<string>Enable Logging</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>12.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This string specifies the type of logging.
Available in macOS 12 and later.</string>
			<key>pfm_macos_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>LoggingOption</string>
			<key>pfm_range_list</key>
			<array>
				<string>throttled</string>
				<string>brief</string>
				<string>detail</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Throttled</string>
				<string>Brief</string>
				<string>Detail</string>
			</array>
			<key>pfm_title</key>
			<string>Logging Option</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>12.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', allows built-in software to receive incoming connections.
Available in macOS 12.3 and later.</string>
			<key>pfm_macos_min</key>
			<string>12.3</string>
			<key>pfm_name</key>
			<string>AllowSigned</string>
			<key>pfm_title</key>
			<string>Allow Incoming Connections to macOS-Bundled Software</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>12.3</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', allows downloaded signed software to receive incoming connections.
Available in macOS 12.3 and later.</string>
			<key>pfm_macos_min</key>
			<string>12.3</string>
			<key>pfm_name</key>
			<string>AllowSignedApp</string>
			<key>pfm_title</key>
			<string>Allow Incoming Connections to Downloaded Signed Apps</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>12.3</string>
				</dict>
			</dict>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Firewall</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>4</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>macOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_device_channel</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>10.12</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_requires_dep</key>
			<false/>
			<key>pfmx_user_approved_mdm</key>
			<false/>
			<key>pfmx_user_channel</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>forbidden</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
