<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Accessibility Settings</string>
	<key>pfm_domain</key>
	<string>com.apple.universalaccess</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/accessibility</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2019-11-11T19:15:04Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_macos_min</key>
	<string>10.9</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Universal Access settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Universal Access</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.universalaccess</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.universalaccess</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Use scroll gesture with modifier keys to zoom" in the zoom options</string>
			<key>pfm_name</key>
			<string>closeViewScrollWheelToggle</string>
			<key>pfm_title</key>
			<string>Enable Zoom via ScrollWheel</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Use keyboard shortcuts to zoom" in the zoom options</string>
			<key>pfm_name</key>
			<string>closeViewHotkeysEnabled</string>
			<key>pfm_title</key>
			<string>Enable Zoom via Keyboard</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The maximal zoom magnification that can be set in the Zoom options in an integer value between 1 and 40</string>
			<key>pfm_name</key>
			<string>closeViewNearPoint</string>
			<key>pfm_range_max</key>
			<integer>40</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Maximum Zoom</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The minimal zoom magnification that can be set in the Zoom options in an integer value between 1 and 40</string>
			<key>pfm_name</key>
			<string>closeViewFarPoint</string>
			<key>pfm_range_max</key>
			<integer>40</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Minimum Zoom</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Show preview rectangle" in the Zoom options</string>
			<key>pfm_name</key>
			<string>closeViewShowPreview</string>
			<key>pfm_title</key>
			<string>Show preview rectangle when zoomed out</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Smooth images" in the Zoom options</string>
			<key>pfm_name</key>
			<string>closeViewSmoothImages</string>
			<key>pfm_title</key>
			<string>Smooth images</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Invert colors" in Display options</string>
			<key>pfm_name</key>
			<string>whiteOnBlack</string>
			<key>pfm_title</key>
			<string>Invert colors</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Use grayscale" in the Display options</string>
			<key>pfm_name</key>
			<string>grayscale</string>
			<key>pfm_title</key>
			<string>Use Grayscale</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>0</real>
			<key>pfm_description</key>
			<string>The amount of display contrast enhancement in a decimal value between 0 and 1, where 0 is none and 1 is the maximum</string>
			<key>pfm_name</key>
			<string>contrast</string>
			<key>pfm_range_min</key>
			<real>0</real>
			<key>pfm_range_max</key>
			<real>1</real>
			<key>pfm_title</key>
			<string>Display Contrast</string>
			<key>pfm_type</key>
			<string>real</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The size of the mouse cursor in a decimal value between 1 and 4, where 1 is normal and 4 is the maximum</string>
			<key>pfm_name</key>
			<string>mouseDriverCursorSize</string>
			<key>pfm_range_max</key>
			<real>4</real>
			<key>pfm_range_min</key>
			<real>1</real>
			<key>pfm_title</key>
			<string>Cursor Size</string>
			<key>pfm_type</key>
			<string>real</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>VoiceOver provides spoken and brailled descriptions of items on the computer screen and provides control of the computer through the user of the keyboard</string>
			<key>pfm_name</key>
			<string>voiceOverOnOffKey</string>
			<key>pfm_title</key>
			<string>Enable VoiceOver</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Flash the screen when an alert sound occurs" in the Audio options</string>
			<key>pfm_name</key>
			<string>flashScreen</string>
			<key>pfm_title</key>
			<string>Flash screen on alert sound</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Play stereo audio as mono" in the Audio options</string>
			<key>pfm_name</key>
			<string>stereoAsMono</string>
			<key>pfm_title</key>
			<string>Play stereo audio as mono</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Sticky Keys" in the Keyboard options. Sticky keys allows modifier keys to be set without having to hold the key down</string>
			<key>pfm_name</key>
			<string>stickyKey</string>
			<key>pfm_title</key>
			<string>Enable Sticky Keys</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Display pressed keys on screen" for Sticky Keys in Keyboard options</string>
			<key>pfm_name</key>
			<string>stickyKeyShowWindow</string>
			<key>pfm_title</key>
			<string>Display pressed keys on screen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Beep when a modifier key is set" for Sticky Keys in Keyboard options</string>
			<key>pfm_name</key>
			<string>stickyKeyBeepOnModifier</string>
			<key>pfm_title</key>
			<string>Beep when a modifier key is set</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Slow Keys" in the Keyboard options. Slow keys adjusts the amount of time between when a key is pressed and when it is activated</string>
			<key>pfm_name</key>
			<string>slowKey</string>
			<key>pfm_title</key>
			<string>Enable Slow Keys</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Use click key sounds" for Slow Keys in the Keyboard options</string>
			<key>pfm_name</key>
			<string>slowKeyBeepOn</string>
			<key>pfm_title</key>
			<string>Use click key sounds</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>250</integer>
			<key>pfm_description</key>
			<string>The acceptance delay for Slow Keys in miliseconds</string>
			<key>pfm_name</key>
			<string>slowKeyDelay</string>
			<key>pfm_title</key>
			<string>Acceptance delay</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>milliseconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Enable Mouse Keys" in the Pointer Control options. Mouse Keys allows the mouse pointer to be controlled using the keyboard number pad</string>
			<key>pfm_name</key>
			<string>mouseDriver</string>
			<key>pfm_title</key>
			<string>Enable Mouse Keys</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>1</real>
			<key>pfm_description</key>
			<string>The initial delay before moving the mouse cursor with Mouse Keys in a decimal value representing seconds</string>
			<key>pfm_name</key>
			<string>mouseDriverInitialDelay</string>
			<key>pfm_title</key>
			<string>Initial delay</string>
			<key>pfm_type</key>
			<string>real</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The maximum speed for the cursor when using Mouse Keys in an integer value between 1 and 32, where 1 is the slowest and 32 is the fastest</string>
			<key>pfm_name</key>
			<string>mouseDriverMaxSpeed</string>
			<key>pfm_range_max</key>
			<integer>32</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Maximum speed</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Turns on "Ignore built-in trackpad when mouse or wireless trackpad is present" in the Mouse &amp; Trackpad options</string>
			<key>pfm_name</key>
			<string>mouseDriverIgnoreTrackpad</string>
			<key>pfm_title</key>
			<string>Ignore built-in trackpad</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Accessibility</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>
