<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define Wi-Fi settings</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/wifi</string>
	<key>pfm_domain</key>
	<string>com.apple.wifi.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_ios_min</key>
	<string>4.0</string>
	<key>pfm_last_modified</key>
	<date>2024-03-14T09:10:36Z</date>
	<key>pfm_macos_min</key>
	<string>10.7</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
		<string>tvOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Wi-Fi settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Wi-Fi</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.wifi.managed</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.wifi.managed</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Type of network interface on the device.</string>
			<key>pfm_excluded</key>
			<true/>
			<key>pfm_name</key>
			<string>PFC_InterfaceSelector</string>
			<key>pfm_range_list</key>
			<array>
				<string>BuiltInWireless</string>
				<string>Hotspot</string>
				<string>Hotspot2</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Wi-Fi</string>
				<string>Legacy Hotspot</string>
				<string>Passpoint</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Network Interface</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<string>Hotspot</string>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the device treats the network as a hotspot.
Available in iOS 7.0 and later, and in macOS 10.9 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_contains_any</key>
							<array>
								<string>Hotspot</string>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>IsHotspot</string>
			<key>pfm_title</key>
			<string>Is Hotspot</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>7.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.9</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<string>BuiltInWireless</string>
								<string>Hotspot</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>DomainName</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The SSID of the Wi-Fi network to be used. In iOS 7.0 and later, the SSID is optional if a 'DomainName' value is provided.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>SSID_STR</string>
			<key>pfm_title</key>
			<string>Service Set Identifier (SSID)</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>7.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', defines this network as hidden.</string>
			<key>pfm_name</key>
			<string>HIDDEN_NETWORK</string>
			<key>pfm_title</key>
			<string>Hidden Network</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', the device joins the network automatically.
If 'false', the user must tap the network name to join it.
Available in iOS 5.0 and later, and in macOS 10.7 and later.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_macos_min</key>
			<string>10.7</string>
			<key>pfm_name</key>
			<string>AutoJoin</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Auto Join</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>5.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', Captive Network detection will be bypassed when the device connects to the network.
Available in iOS 10.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>10.0</string>
			<key>pfm_name</key>
			<string>CaptiveBypass</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
			</array>
			<key>pfm_title</key>
			<string>Disable Captive Network Detection</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true,' disables MAC address randomization for a Wi-Fi network while associated with that network. This feature also shows a privacy warning in Settings indicating that the network has reduced privacy protections.
This value is only locked when the profile is installed by MDM. If the profile is manually installed, the value is set but the user can change it.
Available in iOS 14 and later, and watchOS 7 and later.</string>
			<key>pfm_ios_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>DisableAssociationMACRandomization</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
			</array>
			<key>pfm_title</key>
			<string>Disable MAC Address Randomization</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>14.0</string>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>watchOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>7.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', enables IPv6 on this interface.</string>
			<key>pfm_name</key>
			<string>EnableIPv6</string>
			<key>pfm_title</key>
			<string>Enable IPv6</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>None</string>
			<key>pfm_description</key>
			<string>The proxy type, if any, to use. If you choose the manual proxy type, you need the proxy server address, including its port and optionally a user name and password into the proxy server. If you choose the auto proxy type, you can enter a proxy autoconfiguration (PAC) URL.
Available in iOS 5.0 and later, and on all versions of macOS.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>ProxyType</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_range_list</key>
			<array>
				<string>None</string>
				<string>Manual</string>
				<string>Auto</string>
			</array>
			<key>pfm_title</key>
			<string>Proxy Type</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Manual</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The proxy server's network address.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Manual</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ProxyServer</string>
			<key>pfm_title</key>
			<string>Proxy Server</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Manual</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The proxy server's port number.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Manual</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ProxyServerPort</string>
			<key>pfm_range_max</key>
			<integer>65535</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Proxy Server Port</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The user name used to authenticate to the proxy server.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Manual</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ProxyUsername</string>
			<key>pfm_title</key>
			<string>Proxy Username</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The password used to authenticate to the proxy server.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Manual</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ProxyPassword</string>
			<key>pfm_sensitive</key>
			<true/>
			<key>pfm_title</key>
			<string>Proxy Password</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The URL of the PAC file that defines the proxy configuration.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Auto</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ProxyPACURL</string>
			<key>pfm_title</key>
			<string>Proxy PAC URL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', allows connecting directly to the destination if the PAC file is unreachable.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Auto</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ProxyPACFallbackAllowed</string>
			<key>pfm_title</key>
			<string>Proxy PAC Fallback</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Any</string>
			<key>pfm_description</key>
			<string>The encryption type for the network.
If set to anything except 'None', the payload may contain the following three keys: 'Password', 'PayloadCertificateUUID', or 'EAPClientConfiguration'.
As of iOS 16, tvOS 16, watchOS 9, and macOS 13:
* 'WPA' allows joining WPA or WPA2 networks
* 'WPA2' allows joining WPA2 or WPA3 networks
* 'WPA3' allows joining WPA3 networks only
* 'Any' allows joining WPA, WPA2, WPA3, and WEP networks.
Prior to iOS 16, tvOS 16, and watchOS 9, specifying 'WPA', 'WPA2', and 'WPA3' were equivalent and would allow joining any WPA network.
Prior to macOS 13, the encryption type, if specified explicitly, needed to match the encryption type of the network exactly.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>EncryptionType</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_range_list</key>
			<array>
				<string>None</string>
				<string>WEP</string>
				<string>WPA</string>
				<string>WPA2</string>
				<string>WPA3</string>
				<string>Any</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>None</string>
				<string>WEP</string>
				<string>WPA and WPA2</string>
				<string>WPA2 and WPA3</string>
				<string>WPA3</string>
				<string>Any</string>
			</array>
			<key>pfm_title</key>
			<string>Encryption Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The password for the access point.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>None</string>
							</array>
							<key>pfm_target</key>
							<string>EncryptionType</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>EAPClientConfiguration</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>Password</string>
			<key>pfm_sensitive</key>
			<true/>
			<key>pfm_title</key>
			<string>Password</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The operator name to display when connected to this network. Used only with Wi-Fi Hotspot 2.0 access points.
Available in iOS 7.0 and later, and in macOS 10.9 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>IsHotspot</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>DisplayedOperatorName</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Provider Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>7.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.9</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The primary domain of the tunnel.
Available in iOS 7.0 and later, and in macOS 10.9 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>IsHotspot</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>DomainName</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Domain Name</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>7.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.9</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', allows connection to roaming service providers.
Available in iOS 7.0 and later, and in macOS 10.9 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>IsHotspot</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>DomainName</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>ServiceProviderRoamingEnabled</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Connect to roaming partner Passpoint networks</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>7.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.9</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of Roaming Consortium Organization Identifiers used for Wi-Fi Hotspot 2.0 negotiation.
Available in iOS 7.0 and later, and in macOS 10.9 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>IsHotspot</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>DomainName</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>RoamingConsortiumOIs</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_format</key>
					<string>^([0-9A-Za-z]{6})|([0-9A-Za-z]{9})$</string>
					<key>pfm_name</key>
					<string>RoamingConsortiumOI</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Roaming OIs</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>7.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.9</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of Network Access Identifier Realm names used for Wi-Fi Hotspot 2.0 negotiation.
Available in iOS 7.0 and later, and in macOS 10.9 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>IsHotspot</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>DomainName</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>NAIRealmNames</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>NAIRealmName</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Realm Names</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>7.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.9</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of Mobile Country Code/Mobile Network Code (MCC/MNC) pairs used for Wi-Fi Hotspot 2.0 negotiation. Each string must contain exactly six digits.
Available in iOS 7.0 and later. This feature is not supported in macOS.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>IsHotspot</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>DomainName</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>MCCAndMNCs</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_format</key>
					<string>^[0-9]{6}$</string>
					<key>pfm_name</key>
					<string>MCCAndMNC</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>MCC/MNCs</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>7.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of strings that contain the type of connection mode to be attached.</string>
			<key>pfm_name</key>
			<string>SetupModes</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>SetupMode</string>
					<key>pfm_range_list</key>
					<array>
						<string>System</string>
						<string>Loginwindow</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>System</string>
						<string>Login Window</string>
					</array>
					<key>pfm_title</key>
					<string>Setup Mode</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>EAP Setup Modes</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_type_input</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.7</string>
				</dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>watchOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The enterprise network configuration.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>None</string>
							</array>
							<key>pfm_target</key>
							<string>EncryptionType</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>Password</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>EAPClientConfiguration</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The system accepts the following EAP types:
13 = TLS
17 = LEAP
18 = EAP-SIM
21 = TTLS
23 = EAP-AKA
25 = PEAP
43 = EAP-FAST

For EAP-TLS authentication without a network payload, install the necessary identity certificates and have your users select EAP-TLS mode in the 802.1X credentials dialog that appears when they connect to the network. For other EAP types, a network payload is necessary and must specify the correct settings for the network.</string>
					<key>pfm_name</key>
					<string>AcceptEAPTypes</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>An integer representing an EAP type, inside of the Accept EAP Types array.</string>
							<key>pfm_name</key>
							<string>EAPType</string>
							<key>pfm_range_list</key>
							<array>
								<integer>13</integer>
								<integer>17</integer>
								<integer>21</integer>
								<integer>25</integer>
								<integer>43</integer>
								<integer>18</integer>
								<integer>23</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>TLS</string>
								<string>LEAP</string>
								<string>TTLS</string>
								<string>PEAP</string>
								<string>EAP-FAST</string>
								<string>EAP-SIM</string>
								<string>EAP-AKA</string>
							</array>
							<key>pfm_title</key>
							<string>EAP Type</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Accept EAP Types</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The user name for the account. If you don't specify a value, the system prompts the user during login.</string>
					<key>pfm_name</key>
					<string>UserName</string>
					<key>pfm_title</key>
					<string>Username</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_contains_any</key>
									<array>
										<integer>17</integer>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.OneTimeUserPassword</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>The user's password. If you don't specify a value, the system prompts the user during login.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.OneTimeUserPassword</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>17</integer>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>UserPassword</string>
					<key>pfm_sensitive</key>
					<true/>
					<key>pfm_title</key>
					<string>Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', the user receives a prompt for a password each time they connect to the network.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>17</integer>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>8.0</string>
					<key>pfm_macos_min</key>
					<string>10.8</string>
					<key>pfm_name</key>
					<string>OneTimeUserPassword</string>
					<key>pfm_title</key>
					<string>Per-Connection Password</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>8.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.8</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>7.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>An array of the UUID of a certificate payload to trust for authentication. Use this key to prevent the device from asking the user whether to trust the listed certificates. Dynamic trust (the certificate dialogue) is in a disabled state if you specify this property without also enabling  'TLSAllowTrustExceptions'.</string>
					<key>pfm_name</key>
					<string>PayloadCertificateAnchorUUID</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>A UUID for a trusted certificate</string>
							<key>pfm_format</key>
							<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
							<key>pfm_name</key>
							<string>CertificateAnchorUUID</string>
							<key>pfm_title</key>
							<string>Individual Certificate Anchor UUID</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Certificate Anchor UUID</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The list of accepted server certificate common names. If a server presents a certificate that isn't in this list, the system doesn't trust it.
If you specify this property, the system disables dynamic trust (the certificate dialog) unless you also specify 'TLSAllowTrustExceptions'  with the value 'true'.
If necessary, use wildcards to specify the name, such as 'wpa.*.example.com'.</string>
					<key>pfm_name</key>
					<string>TLSTrustedServerNames</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>An item in the TLS Trusted Server Names array representing a Common Name of a server certificate.</string>
							<key>pfm_name</key>
							<string>TLSTrustedServerName</string>
							<key>pfm_title</key>
							<string>Individual Trusted TLS Server Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Trusted Server Certificate Names</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If 'true', allows a dynamic trust decision by the user. The dynamic trust is the certificate dialogue that appears when the system doesn't trust a certificate.
If 'false', the authentication fails if the system doesn't already trust the certificate.
As of iOS 8, Apple no longer supports this key.</string>
					<key>pfm_ios_deprecated</key>
					<string>7.1.2</string>
					<key>pfm_ios_max</key>
					<string>7.1.2</string>
					<key>pfm_name</key>
					<string>TLSAllowTrustExceptions</string>
					<key>pfm_title</key>
					<string>Allow Trust Exceptions</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_removed</key>
							<string>8.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_contains_any</key>
									<array>
										<integer>21</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_default</key>
					<string>MSCHAPv2</string>
					<key>pfm_description</key>
					<string>The inner authentication that the TTLS module uses.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>TTLSInnerAuthentication</string>
					<key>pfm_range_list</key>
					<array>
						<string>PAP</string>
						<string>EAP</string>
						<string>CHAP</string>
						<string>MSCHAP</string>
						<string>MSCHAPv2</string>
					</array>
					<key>pfm_title</key>
					<string>Inner Authentication</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A name that hides the user's true name. The user's actual name appears only inside the encrypted tunnel. For example, you might set this to anonymous or anon, or anon@mycompany.net. It can increase security because an attacker can't see the authenticating user's name in the clear.

This key is only relevant to TTLS, PEAP, and EAP-FAST.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OuterIdentity</string>
					<key>pfm_title</key>
					<string>Outer Identity</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The minimum TLS version for EAP authentication.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>11.0</string>
					<key>pfm_macos_min</key>
					<string>10.13</string>
					<key>pfm_name</key>
					<string>TLSMinimumVersion</string>
					<key>pfm_range_list</key>
					<array>
						<string>1.0</string>
						<string>1.1</string>
						<string>1.2</string>
						<string>1.3</string>
					</array>
					<key>pfm_title</key>
					<string>TLS Minimum Version</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.13</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The maximum TLS version for EAP authentication.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>11.0</string>
					<key>pfm_macos_min</key>
					<string>10.13</string>
					<key>pfm_name</key>
					<string>TLSMaximumVersion</string>
					<key>pfm_range_list</key>
					<array>
						<string>1.0</string>
						<string>1.1</string>
						<string>1.2</string>
						<string>1.3</string>
					</array>
					<key>pfm_title</key>
					<string>TLS Maximum Version</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.13</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', the device uses an existing PAC if it's present. Otherwise, the server must present its identity using a certificate.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>EAPFASTUsePAC</string>
					<key>pfm_title</key>
					<string>Use PAC</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', allows PAC provisioning.

This value is only applicable if 'EAPFASTUsePAC' is 'true'. This value must be 'true' for EAP-FAST PAC usage to succeed because there is no other way to provision a PAC.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.EAPFASTUsePAC</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>EAPFASTProvisionPAC</string>
					<key>pfm_title</key>
					<string>Provision PAC</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', provisions the device anonymously. Note that there are known machine-in-the-middle attacks for anonymous provisioning.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.EAPFASTProvisionPAC</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>EAPFASTProvisionPACAnonymously</string>
					<key>pfm_title</key>
					<string>Provision PAC Anonymously</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>3</integer>
					<key>pfm_description</key>
					<string>The minimum number of RAND values to accept from the server.
For use with EAP-SIM only.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>18</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>EAPSIMNumberOfRANDs</string>
					<key>pfm_range_list</key>
					<array>
						<integer>2</integer>
						<integer>3</integer>
					</array>
					<key>pfm_title</key>
					<string>Number of RANDs</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>8.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Set this string to 'ActiveDirectory' to use the AD computer name and password credentials.
If using this property, you can't use 'SystemModeUseOpenDirectoryCredentials'.</string>
					<key>pfm_name</key>
					<string>SystemModeCredentialsSource</string>
					<key>pfm_range_list</key>
					<array>
						<string>ActiveDirectory</string>
					</array>
					<key>pfm_title</key>
					<string>System Profile Credentials Source</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If 'true', the system mode connection tries to use the Open Directory credentials.
If using this property, you can't use  'SystemModeCredentialsSource'.</string>
					<key>pfm_name</key>
					<string>SystemModeUseOpenDirectoryCredentials</string>
					<key>pfm_title</key>
					<string>Use OpenDirectory System Profile Credentials</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>EAP Client Configuration</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A dictionary that contains the list of apps that are allowed to benefit from L2 and L3 marking. When this dictionary isn't present, all apps are allowed to use L2 and L3 marking when the Wi-Fi network supports Cisco QoS fast lane.
Available in iOS 10.0 and later, and in macOS 10.13 and later.</string>
			<key>pfm_ios_min</key>
			<string>10.0</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>QoSMarkingPolicy</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If 'true', disables L3 marking and only uses L2 marking for traffic that goes to the Wi-Fi network.

If 'false', the system behaves as if Wi-Fi doesn't have an association with a Cisco QoS fast lane network.</string>
					<key>pfm_name</key>
					<string>QoSMarkingEnabled</string>
					<key>pfm_title</key>
					<string>Allow QoS marking</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If 'true', adds audio and video traffic of built-in audio/video services, such as FaceTime and Wi-Fi Calling, to the allow list for L2 and L3 marking for traffic that goes to the Wi-Fi network.</string>
					<key>pfm_name</key>
					<string>QoSMarkingAppleAudioVideoCalls</string>
					<key>pfm_title</key>
					<string>QoS marking for audio/video calls</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>An array of app bundle identifiers that defines the allow list for L2 and L3 marking for traffic that goes to the Wi-Fi network. If the array isn't present, but the 'QoSMarkingPolicy' key is present — even empty — no apps can use L2 and L3 marking.</string>
					<key>pfm_ios_min</key>
					<string>14.5</string>
					<key>pfm_macos_min</key>
					<string>14.0</string>
					<key>pfm_name</key>
					<string>QoSMarkingAllowListAppIdentifiers</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_title</key>
							<string>Allow List App</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Allow List App Identifiers</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.5</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Use 'QoSMarkingAllowListAppIdentifiers' instead.</string>
					<key>pfm_ios_deprecated</key>
					<string>14.5</string>
					<key>pfm_macos_deprecated</key>
					<string>14.0</string>
					<key>pfm_name</key>
					<string>QoSMarkingWhitelistedAppIdentifiers</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_title</key>
							<string>Allowlisted App</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Allowlisted App Identifiers</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_deprecated</key>
							<string>14.5</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_deprecated</key>
							<string>14.0</string>
						</dict>
					</dict>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>QoS Marking Policy</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.13</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<integer>13</integer>
							</array>
							<key>pfm_target</key>
							<string>EAPClientConfiguration.AcceptEAPTypes</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The UUID of the certificate payload within the same profile to use for the client credential.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_contains_any</key>
							<array>
								<integer>13</integer>
								<integer>21</integer>
								<integer>25</integer>
								<integer>43</integer>
							</array>
							<key>pfm_target</key>
							<string>EAPClientConfiguration.AcceptEAPTypes</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadCertificateUUID</string>
			<key>pfm_title</key>
			<string>Certificate UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', allows for two-factor authentication for EAP-TTLS, PEAP, or EAP-FAST.
If 'false', allows for zero-factor authentication for EAP-TLS.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_contains_any</key>
							<array>
								<integer>13</integer>
								<integer>21</integer>
								<integer>25</integer>
								<integer>43</integer>
							</array>
							<key>pfm_target</key>
							<string>EAPClientConfiguration.AcceptEAPTypes</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>TLSCertificateRequired</string>
			<key>pfm_title</key>
			<string>Certificate Required</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The wireless interface to use</string>
			<key>pfm_name</key>
			<string>Interface</string>
			<key>pfm_range_list</key>
			<array>
				<string>AnyEthernet</string>
				<string>FirstEthernet</string>
				<string>FirstActiveEthernet</string>
				<string>SecondEthernet</string>
				<string>SecondActiveEthernet</string>
				<string>ThirdEthernet</string>
				<string>ThirdActiveEthernet</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Any Ethernet</string>
				<string>First Ethernet</string>
				<string>First Active Ethernet</string>
				<string>Second Ethernet</string>
				<string>Second Active Ethernet</string>
				<string>Third Ethernet</string>
				<string>Third Active Ethernet</string>
			</array>
			<key>pfm_title</key>
			<string>Interface</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Wi-Fi</string>
	<key>pfm_tvos_min</key>
	<string>9.0</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>10</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>iOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>4.0</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_shared_ipad</key>
			<dict>
				<key>pfmx_device_channel</key>
				<true/>
				<key>pfmx_mode</key>
				<string>allowed</string>
				<key>pfmx_user_channel</key>
				<false/>
			</dict>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
		<key>macOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_device_channel</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>10.7</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_requires_dep</key>
			<false/>
			<key>pfmx_user_approved_mdm</key>
			<false/>
			<key>pfmx_user_channel</key>
			<true/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
		<key>tvOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>5.1</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_supervised</key>
			<false/>
		</dict>
		<key>watchOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>3.2</string>
			<key>pfmx_multiple</key>
			<true/>
		</dict>
	</dict>
</dict>
</plist>
