<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define Third Ethernet settings</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/8021xthirdethernet</string>
	<key>pfm_domain</key>
	<string>com.apple.thirdethernet.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2020-04-16T12:05:03Z</date>
	<key>pfm_macos_min</key>
	<string>10.13</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Third Ethernet settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>802.1X Ethernet: Third</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.thirdethernet.managed</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.thirdethernet.managed</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Select "Login Window" to authenticate the Mac to the network when the user logs in.</string>
			<key>pfm_name</key>
			<string>SetupModes</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>SetupMode</string>
					<key>pfm_range_list</key>
					<array>
						<string>System</string>
						<string>Loginwindow</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>System</string>
						<string>Login Window</string>
					</array>
					<key>pfm_title</key>
					<string>Setup Mode</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>EAP Setup Modes</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_type_input</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies 802.1x EAP authentication parameters.</string>
			<key>pfm_name</key>
			<string>EAPClientConfiguration</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The EAP types accepted.</string>
					<key>pfm_description_reference</key>
					<string>For EAP-TLS authentication without a network payload, install the necessary identity certificates and have your users select EAP-TLS mode in the 802.1X credentials dialog that appears when they connect to the network. For other EAP types, a network payload is necessary and must specify the correct settings for the network.</string>
					<key>pfm_name</key>
					<string>AcceptEAPTypes</string>
					<key>pfm_note</key>
					<string>For EAP-TLS authentication without a network payload, install the necessary identity certificates and have your users select EAP-TLS mode in the 802.1X credentials dialog that appears when they connect to the network.</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>An integer representing an EAP type, inside of the Accept EAP Types array.</string>
							<key>pfm_name</key>
							<string>EAPType</string>
							<key>pfm_range_list</key>
							<array>
								<integer>13</integer>
								<integer>17</integer>
								<integer>21</integer>
								<integer>25</integer>
								<integer>43</integer>
								<integer>18</integer>
								<integer>23</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>TLS</string>
								<string>LEAP</string>
								<string>TTLS</string>
								<string>PEAP</string>
								<string>EAP-FAST</string>
								<string>EAP-SIM</string>
								<string>EAP-AKA</string>
							</array>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>EAP Type</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Accept EAP Types</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Username. If not provided, the user may be prompted during login.</string>
					<key>pfm_name</key>
					<string>UserName</string>
					<key>pfm_title</key>
					<string>Username</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.OneTimeUserPassword</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description_reference</key>
					<string>Password. If not provided, the user may be prompted during login.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.OneTimeUserPassword</string>
								</dict>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.OneTimeUserPassword</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>UserPassword</string>
					<key>pfm_sensitive</key>
					<true/>
					<key>pfm_title</key>
					<string>Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description_reference</key>
					<string>If true, the user will be prompted for a password each time they connect to the network.</string>
					<key>pfm_name</key>
					<string>OneTimePassword</string>
					<key>pfm_note</key>
					<string>Apple's documentation does not indicate the difference or when this preference should be used vs. OneTimeUserPassword</string>
					<key>pfm_title</key>
					<string>One Time Password</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If set, the user will be prompted for a password each time they connect to the network.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>17</integer>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_present</key>
									<false/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OneTimeUserPassword</string>
					<key>pfm_note</key>
					<string>Apple's documentation does not indicate the difference or when this preference should be used vs. OneTimeUserPassword</string>
					<key>pfm_title</key>
					<string>Per-Connection Password</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Array of UUIDs corresponding to the trusted certificates for this authentication.</string>
					<key>pfm_name</key>
					<string>PayloadCertificateAnchorUUID</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>A UUID for a trusted certificate</string>
							<key>pfm_format</key>
							<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
							<key>pfm_name</key>
							<string>CertificateAnchorUUID</string>
							<key>pfm_title</key>
							<string>Individual Certificate Anchor UUID</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Certificate Anchor UUID</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Certificate Common Names expected from authentication server. The wildcard * can be used to match a range of strings.</string>
					<key>pfm_name</key>
					<string>TLSTrustedServerNames</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>An item in the TLS Trusted Server Names array representing a Common Name of a server certificate.</string>
							<key>pfm_name</key>
							<string>TLSTrustedServerName</string>
							<key>pfm_title</key>
							<string>Individual Trusted TLS Server Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Trusted Server Certificate Names</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Allows a dynamic trust decision by the user. If false, the authentication fails if the certificate isn't already trusted.</string>
					<key>pfm_description_reference</key>
					<string>If true, allows a dynamic trust decision by the user. The dynamic trust is the certificate dialogue that appears when a certificate isn't trusted.

If false, the authentication fails if the certificate isn't already trusted.</string>
					<key>pfm_name</key>
					<string>TLSAllowTrustExceptions</string>
					<key>pfm_title</key>
					<string>Allow Trust Exceptions</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description_reference</key>
					<string>If true, allows for two-factor authentication for EAP-TTLS, PEAP, or EAP-FAST. If false, allows for zero-factor authentication for EAP-TLS.</string>
					<key>pfm_name</key>
					<string>TLSCertificateIsRequired</string>
					<key>pfm_title</key>
					<string>TLS Certificate is Required</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_contains_any</key>
									<array>
										<integer>21</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_default</key>
					<string>MSCHAPv2</string>
					<key>pfm_description</key>
					<string>Specifies the inner authentication used by the TTLS module.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
									</array>
									<key>pfm_present</key>
									<false/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>TTLSInnerAuthentication</string>
					<key>pfm_range_list</key>
					<array>
						<string>PAP</string>
						<string>EAP</string>
						<string>CHAP</string>
						<string>MSCHAP</string>
						<string>MSCHAPv2</string>
					</array>
					<key>pfm_title</key>
					<string>Inner Authentication</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Externally visible identification (for TTLS, PEAP, and EAP-FAST). This string is used instead of the user's identity outside the encrypted tunnel. This value can be used to mask the true identity of the person using the network.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_present</key>
									<false/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OuterIdentity</string>
					<key>pfm_title</key>
					<string>Outer Identity</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>1.0</string>
					<key>pfm_description_reference</key>
					<string>The minimum TLS version to be used with EAP authentication.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_present</key>
									<false/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>TLSMinimumVersion</string>
					<key>pfm_range_list</key>
					<array>
						<string>1.0</string>
						<string>1.1</string>
						<string>1.2</string>
					</array>
					<key>pfm_title</key>
					<string>TLS Minimum Version</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>1.2</string>
					<key>pfm_description_reference</key>
					<string>The maximum TLS version to be used with EAP authentication.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_present</key>
									<false/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>TLSMaximumVersion</string>
					<key>pfm_range_list</key>
					<array>
						<string>1.0</string>
						<string>1.1</string>
						<string>1.2</string>
					</array>
					<key>pfm_title</key>
					<string>TLS Maximum Version</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description_reference</key>
					<string>If true, the device will use an existing PAC if it's present. Otherwise, the server must present its identity using a certificate.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>43</integer>
									</array>
									<key>pfm_present</key>
									<false/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>EAPFASTUsePAC</string>
					<key>pfm_title</key>
					<string>Use PAC</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If set, allows PAC provisioning.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>43</integer>
									</array>
									<key>pfm_present</key>
									<false/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_present</key>
									<false/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.EAPFASTUsePAC</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>EAPFASTProvisionPAC</string>
					<key>pfm_title</key>
					<string>Provision PAC</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description_reference</key>
					<string>If true, provisions the device anonymously. Note that there are known man-in-the-middle attacks for anonymous provisioning. </string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>43</integer>
									</array>
									<key>pfm_present</key>
									<false/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_present</key>
									<false/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.EAPFASTProvisionPAC</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>EAPFASTProvisionPACAnonymously</string>
					<key>pfm_title</key>
					<string>Provision PAC Anonymously</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>3</integer>
					<key>pfm_description</key>
					<string>The minimum number of RAND values accepted from the server. 3 is the default, and 2 is allowed, but offers less security.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>18</integer>
									</array>
									<key>pfm_present</key>
									<false/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>EAPSIMNumberOfRANDs</string>
					<key>pfm_range_list</key>
					<array>
						<integer>2</integer>
						<integer>3</integer>
					</array>
					<key>pfm_title</key>
					<string>Number of RANDs</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Use an alternate set of credentials when in System mode (AKA not a loginwindow profile). This can be used to tell EAPOLClient to use the computer password in a bound active directory scenario for authentication.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.SystemModeUseOpenDirectoryCredentials</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>SystemModeCredentialsSource</string>
					<key>pfm_note</key>
					<string>Only SystemModeCredentialsSource or SystemModeUseOpenDirectoryCredentials keys should exist in the profile. Not both.</string>
					<key>pfm_range_list</key>
					<array>
						<string>ActiveDirectory</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Active Directory</string>
					</array>
					<key>pfm_title</key>
					<string>System Profile Credentials Source</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>This indicates if the connection should try to use the OpenDirectory machine credentials.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.SystemModeCredentialsSource</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>SystemModeUseOpenDirectoryCredentials</string>
					<key>pfm_note</key>
					<string>Only SystemModeCredentialsSource or SystemModeUseOpenDirectoryCredentials keys should exist in the profile. Not both.</string>
					<key>pfm_title</key>
					<string>Use OpenDirectory System Profile Credentials</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>EAP Client Configuration</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The wired interface to use</string>
			<key>pfm_name</key>
			<string>Interface</string>
			<key>pfm_range_list</key>
			<array>
				<string>ThirdEthernet</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Third Ethernet</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Interface</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>802.1X Ethernet: Third</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
