<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Content Caching settings</string>
	<key>pfm_domain</key>
	<string>com.apple.AssetCache.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2023-08-21T10:35:00Z</date>
	<key>pfm_macos_min</key>
	<string>10.13.4</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Content Caching settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Content Caching</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.AssetCache.managed</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.AssetCache.managed</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile.
The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', automatically activates the content cache when possible and prevents it from being disabled. If the 'allowContentCaching' restriction is set to 'false', 'AutoActivation' is also 'false'.
Removing a profile that set 'AutoActivation' to 'true' does not deactivate the Content Cache.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, automatically activate the Content Cache when possible and prevent disabling of the Content Cache. Default is false.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>AutoActivation</string>
			<key>pfm_title</key>
			<string>Automatically activate content caching</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>The maximum number of bytes of disk space that will be used for the content cache. A value of 0 means unlimited disk space.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Defines the maximum number of bytes of disk space that will be used for the Content Cache. A CacheLimit of 0 means unlimited disk space. Default is 0.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>CacheLimit</string>
			<key>pfm_title</key>
			<string>Maximum Cache Size</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>bytes</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>PersonalCacheLimit</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', caches the user's iCloud data. Clients may take some time (hours or days) to react to changes to this setting; it doesn't have an immediate effect.

At least one of the 'AllowPersonalCaching' or 'AllowSharedCaching' keys must be 'true'.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, caches the userʼs iCloud data. Clients may take some time (hours, days) to react to changes to this setting; it does not have an immediate effect. Default is true. At least one of the AllowPersonalCaching or AllowSharedCaching keys must be true.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>AllowPersonalCaching</string>
			<key>pfm_title</key>
			<string>Allow Personal iCloud Data Caching</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>PersonalCacheLimit</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_title</key>
			<string>Max Personal Cache Size</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>bytes</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', caches non-iCloud content, such as apps and software updates. Clients may take some time (hours, days) to react to changes to this setting; it does not have an immediate effect.

At least one of the 'AllowPersonalCaching' or 'AllowSharedCaching' keys must be 'true'.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, caches non-iCloud content, such as apps and software updates. Clients may take some time (hours, days) to react to changes to this setting; it does not have an immediate effect. Default is true.
At least one of the AllowPersonalCaching or AllowSharedCaching keys must be true.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>AllowSharedCaching</string>
			<key>pfm_title</key>
			<string>Allow non-iCloud Data Caching</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Automatically enable Internet connection sharing when possible and prevent disabling Internet connection sharing. 'DenyTetheredCaching' overrides 'AutoEnableTetheredCaching'. Tethered caching requires Content Caching.
Available in macOS 10.15.4 and later.</string>
			<key>pfm_macos_min</key>
			<string>10.15.4</string>
			<key>pfm_name</key>
			<string>AutoEnableTetheredCaching</string>
			<key>pfm_title</key>
			<string>Automatically activate Internet connection sharing</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>The TCP port number on which the content cache accepts requests for uploads or downloads. Set the port to 0 to pick a random, available port.</string>
			<key>pfm_description_reference</key>
			<string>Optional. The TCP port number on which the Content Cache accepts requests for uploads or downloads. Port set to 0 picks a random, available port. Default is 0.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>Port</string>
			<key>pfm_range_max</key>
			<integer>65535</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Port</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>/Library/Application Support/Apple/AssetCache/Data</string>
			<key>pfm_description</key>
			<string>The path to the directory used to store cached content. Changing this setting manually doesn't automatically move cached content from the old location to the new one. To move content automatically, use the Sharing preference's Content Caching pane. The value must be (or end with) '/Library/Application Support/Apple/AssetCache/Data'.

A directory and its intermediates are created for the given data path if it doesn't already exist. The directory is owned by '_assetcache:_assetcache' and has mode 0750. Its immediate parent directory ('.../Library/Application Support/Apple/AssetCache') is owned by '_assetcache:_assetcache' and has mode '0755'.</string>
			<key>pfm_description_reference</key>
			<string>Optional. The path to the directory used to store Cached Content. Changing this setting manually does not automatically move cached content from the old to the new location. To move content automatically, use the Sharing preferenceʼs Content Caching pane.
The value must be, or end with, /Library/Application Support/Apple/AssetCache/Data. A directory (and its intermediates) will be created for the given DataPath if it does not already exist. The directory will be owned by _assetcache:_assetcache and have mode 0750. Its immediate parent directory (.../Library/Application Support/Apple/AssetCache) will be owned by _assetcache:_assetcache and have mode 0755.
Default is /Library/Application Support/Apple/AssetCache/Data.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>DataPath</string>
			<key>pfm_title</key>
			<string>Data Path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', disables tethered caching.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, tethered caching is disabled. Default is false.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>DenyTetheredCaching</string>
			<key>pfm_title</key>
			<string>Disable Caching Over Shared Internet Connection</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_value_inverted</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the Content Cache logs the IP address and port number of the clients that request content.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, the Content Cache will log the IP address and port number of the clients that request content. Default is false.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>LogClientIdentity</string>
			<key>pfm_title</key>
			<string>Log Client Details</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of the local IP addresses of other content caches that this cache should download from or upload to, instead of downloading from or uploading to Apple directly. Invalid addresses and addresses of computers that aren't content caches are ignored. Parent caches that become unavailable are skipped. If all parent content caches become unavailable, the content cache downloads from or uploads to Apple directly, until a parent content cache becomes available again.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Array of the local IP addresses of other Content Caches that this cache should download from or upload to, instead of downloading from or uploading to Apple directly. Invalid addresses and addresses of computers that are not Content Caches are ignored.
Parent caches that become unavailable are skipped. If all parent Content Caches become unavailable, the Content Cache will download from or upload to Apple directly until a parent Content Cache becomes available again.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>Parents</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>IPAddress</string>
					<key>pfm_title</key>
					<string>IP Address</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>10.0.0.1</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Parents IP Addresses</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>round-robin</string>
			<key>pfm_description</key>
			<string>The policy to implement when choosing among more than one configured parent content cache. With every policy, parent caches that are temporarily unavailable are skipped.

'first-available': Always use the first available parent in the Parents list. Use this policy to designate permanent primary, secondary, and subsequent parents.

'url-path-hash': Hash the path part of the requested URL so that the same parent is always used for the same URL. This is useful for maximizing the size of the combined caches of the parents.

'random': Choose a parent at random. Use this policy for load balancing.

'round-robin': Rotate through the parents in order. Use this policy for load balancing.

'sticky-available': Use the first available parent that is available in the Parents list until it becomes unavailable, then advance to the next one. Use this policy for designating floating primary, secondary, and subsequent parents.</string>
			<key>pfm_description_reference</key>
			<string>Optional. The policy to use when choosing among more than one configured parent Content Cache. With every policy, parent caches that are temporarily unavailable are skipped.
• first-available: Always use the first parent in the Parents list that is available. This is useful for designating permanent primary, secondary, and subsequent parents.
• url-path-hash: Hash the path part of the requested URL so that the same parent is always used for the same URL. This is useful for maximizing the size of the combined caches of the parents.
• random: Choose a parent at random. This is useful for load balancing.
• round-robin: Rotate through the parents in order. This is useful for load balancing.
• sticky-available: Starting with the first parent in the Parents list, always use the first parent that is available. Use that parent until it becomes unavailable, then advance to the next one. This is useful for designating floating primary, secondary, and subsequent parents.
Default is round-robin.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>ParentSelectionPolicy</string>
			<key>pfm_range_list</key>
			<array>
				<string>first-available</string>
				<string>random</string>
				<string>round-robin</string>
				<string>sticky-available</string>
				<string>url-path-hash</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>First available</string>
				<string>Random</string>
				<string>Round robin</string>
				<string>Sticky available</string>
				<string>Hash</string>
			</array>
			<key>pfm_title</key>
			<string>Parent Selection Policy</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of dictionaries describing a range of public IP addresses that the cloud servers should use for matching clients to content caches.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Array of dictionaries describing a range of public IP addresses that the cloud servers should use for matching clients to Content Caches.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>PeerLocalSubnetsOnly</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>PublicRanges</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>RangeDict</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>IPv4</string>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>type</string>
							<key>pfm_range_list</key>
							<array>
								<string>IPv4</string>
								<string>IPv6</string>
							</array>
							<key>pfm_title</key>
							<string>IP Address Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>first</string>
							<key>pfm_title</key>
							<string>Start IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>last</string>
							<key>pfm_title</key>
							<string>End IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>RangeDict</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Public Ranges</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>AgeForLowSpaceAlert</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Allow the system to purge content from the cache automatically when it needs disk space for other apps (i.e. when free disk space runs low on the computer). Customers who want Content Caching to be as effective as possible should turn this setting off.
Available in macOS 10.15 and later.</string>
			<key>pfm_name</key>
			<string>AllowCacheDelete</string>
			<key>pfm_title</key>
			<string>Allow Cache Delete</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', Content Caching displays exceptional conditions (alerts) as system notifications in the upper corner of the screen. Alerts were automatically displayed starting in macOS 10.13. In macOS 10.15 the alerts are off by default, but still available via this setting.
Available in macOS 10.15 and later.</string>
			<key>pfm_name</key>
			<string>DisplayAlerts</string>
			<key>pfm_title</key>
			<string>Display Content Caching Alerts</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', prevents the computer from sleeping as long as Content Caching is on (System Preferences &gt; Sharing &gt; Content Caching is on). Customers who want Content Caching to be as available as much as possible should turn this setting on.
Available in macOS 10.15 and later.</string>
			<key>pfm_name</key>
			<string>KeepAwake</string>
			<key>pfm_title</key>
			<string>Keep Awake for Content Caching</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>30</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>AgeForLowSpaceAlert</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_title</key>
			<string>Low Space Alert</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>ImportMaxRate</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>ImportMinRate</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>ImportRateAttenuation</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>ImportTimeout</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<true/>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>AllowImports</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_title</key>
			<string>Allow Imports</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>AllowWirelessPortable</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_title</key>
			<string>Allow Laptop Wireless Caching</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>5</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>DatabaseUpdateInterval</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_max</key>
			<integer>3600</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Cache Database Update Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>8000</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>DownloadMinRate</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_min</key>
			<integer>1000</integer>
			<key>pfm_title</key>
			<string>Minimum Download Rate</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>bytes per second</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>180</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>DownloadTimeout</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_min</key>
			<integer>10</integer>
			<key>pfm_title</key>
			<string>Download Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>ImportMaxRate</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_title</key>
			<string>Max Import Rate</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>bytes per second</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>2000</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>ImportMinRate</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_title</key>
			<string>Min Import Rate</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>bytes per second</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>0.2</real>
			<key>pfm_description_reference</key>
			<string>The percentage of attenuation added to the upload time. Clamped minimum is 0% attenuation. Values too large will exceed the ImportTimeout and cause failures.</string>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>ImportTimeout</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ImportRateAttenuation</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_max</key>
			<integer>1</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Import Rate Attenuation</string>
			<key>pfm_type</key>
			<string>real</string>
			<key>pfm_value_decimal_places</key>
			<integer>2</integer>
			<key>pfm_value_unit</key>
			<string>percent</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>300</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>ImportRateAttenuation</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ImportTimeout</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_min</key>
			<integer>10</integer>
			<key>pfm_title</key>
			<string>Import Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Listen on all interfaces</string>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>Interface</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_list</key>
			<array>
				<string>Listen on all interfaces</string>
				<string>en0</string>
				<string>en1</string>
				<string>en2</string>
			</array>
			<key>pfm_range_list_allow_custom_value</key>
			<true/>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', the content cache provides content to the clients in the union of the 'ListenRanges', 'PeerListenRanges' and 'Parents'.</string>
			<key>pfm_description_reference</key>
			<string>Indicates whether content caching registers with the union of the ListenRanges, PeerListenRanges, and Parents keys, or only with the ListenRanges key.

Note that ListenRanges could be automatically generated from LocalSubnetsOnly, and PeerListenRanges could be automatically generated from PeerLocalSubnetsOnly.</string>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>ListenWithPeersAndParents</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_title</key>
			<string>Listen with Peers and Parents</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>8</integer>
			<key>pfm_description_reference</key>
			<string>The maximum number of times, for a single request, that a child content cache will forward the request to a parent content cache.

Requests that are too deep (forwarding chain is too long) are forced to the origin rather than to a parent.</string>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>MaxParentDepth</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_title</key>
			<string>Max Parent Depth</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>MaxPeersToQuery</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_title</key>
			<string>Max Peers to Query</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>60</integer>
			<key>pfm_description_reference</key>
			<string>How often, in seconds, to add a row of metrics to the metrics database in /Library/Application Support/Apple/AssetCache/Metrics/Metrics.db.

- If the value is &gt; 1, metrics are added at the top of each interval. For example, at 60 seconds, metrics are added at the top of each minute.
- Flushing the cache flushes out the current row of metrics (if any).
- No metrics are added while content caching is idle.

Clamped between 1-60 seconds, inclusive.</string>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>MetricsInterval</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_max</key>
			<integer>60</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Metrics Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>30</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>MetricsMaxAge</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_min</key>
			<integer>30</integer>
			<key>pfm_title</key>
			<string>Max Metrics Age</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>60</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>OriginDownloadTimeout</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_max</key>
			<integer>300</integer>
			<key>pfm_range_min</key>
			<integer>5</integer>
			<key>pfm_title</key>
			<string>Origin Download Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>600</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>OriginUploadTimeout</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_max</key>
			<integer>3600</integer>
			<key>pfm_range_min</key>
			<integer>5</integer>
			<key>pfm_title</key>
			<string>Origin Upload Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>60</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>ParentDownloadTimeout</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_max</key>
			<integer>300</integer>
			<key>pfm_range_min</key>
			<integer>5</integer>
			<key>pfm_title</key>
			<string>Parent Download Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>600</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>ParentUploadTimeout</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_max</key>
			<integer>3600</integer>
			<key>pfm_range_min</key>
			<integer>5</integer>
			<key>pfm_title</key>
			<string>Parent Upload Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>900</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>ParentRetryInterval</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_max</key>
			<integer>3600</integer>
			<key>pfm_range_min</key>
			<integer>30</integer>
			<key>pfm_title</key>
			<string>Parent Retry Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>30</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>PruneAffinitiesAge</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_min</key>
			<integer>7</integer>
			<key>pfm_title</key>
			<string>Prune Affinities Cache Age</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>7</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>PruneAffinitiesInterval</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Prune Affinities Cache Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>120</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>PruneAssetsAge</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_min</key>
			<integer>7</integer>
			<key>pfm_title</key>
			<string>Prune Assets Age</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>7</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>PruneAssetsInterval</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Prune Assets Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>2000000000</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>ReservedVolumeSpace</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_title</key>
			<string>Reserved Volume Size</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>bytes</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>10</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>TerminationTimeout</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_max</key>
			<integer>60</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Termination Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>Verbose</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Client Restrictions</string>
				<string>Peer Restrictions</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Client Restrictions</key>
				<array>
					<string>LocalSubnetsOnly</string>
					<string>ListenRangesOnly</string>
					<string>ListenRanges</string>
					<string>MaxConcurrentClients</string>
				</array>
				<key>Peer Restrictions</key>
				<array>
					<string>PeerLocalSubnetsOnly</string>
					<string>PeerFilterRanges</string>
					<string>PeerListenRanges</string>
					<string>PeerDownloadTimeout</string>
					<string>PeerNotifyTimeout</string>
					<string>PeerQueryTimeout</string>
					<string>PeerRetryInterval</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', the content cache offers content to clients only on the same immediate local network only. No content is offered to clients on other networks reachable by the content cache. If 'LocalSubnetsOnly' is set to 'true', 'ListenRanges' will be ignored.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, the Content Cache offers content to clients only on the same immediate local network as the Content Cache. No content would be offered to clients on other networks reachable by the Content Cache. Default is true.
If LocalSubnetsOnly is set to true, ListenRanges will be ignored.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>LocalSubnetsOnly</string>
			<key>pfm_title</key>
			<string>Restrict Clients To Local Network</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the content cache provides content to the clients in the 'ListenRanges'.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, the Content Cache provides content only to clients in the ranges specified by the ListenRanges key. To use the ListenRangesOnly key, the ListenRanges key must also be specified. Default is false.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>LocalSubnetsOnly</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>ListenRanges</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ListenRangesOnly</string>
			<key>pfm_title</key>
			<string>Restrict To Client Listen Ranges</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of dictionaries describing a range of client IP addresses to serve.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Array of dictionaries describing a range of client IP addresses to serve.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>LocalSubnetsOnly</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ListenRanges</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_hidden</key>
					<string>container</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>IPv4</string>
							<key>pfm_description</key>
							<string>IP version</string>
							<key>pfm_name</key>
							<string>type</string>
							<key>pfm_range_list</key>
							<array>
								<string>IPv4</string>
								<string>IPv6</string>
							</array>
							<key>pfm_title</key>
							<string>IP Address Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>First IP address in range</string>
							<key>pfm_name</key>
							<string>first</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Start IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>10.0.0.0</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Last IP address in range</string>
							<key>pfm_name</key>
							<string>last</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>End IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>10.255.255.255</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Client Listen Ranges</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>3400</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>MaxConcurrentClients</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_title</key>
			<string>Max Concurrent Clients</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>clients</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', the content cache only peers with other content caches on the same immediate local network, rather than with content caches that use the same public IP address as the device. When 'PeerLocalSubnetsOnly' is 'true', it overrides the configuration of 'PeerFilterRanges' and 'PeerListenRanges'. If the network changes, the local network peering restrictions update appropriately. If 'false', the content cache defers to 'PeerFilterRanges' and 'PeerListenRanges' for configuring the peering restrictions.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If set to true, the Content Cache will only peer with other Content Caches on the same immediate local network, rather than with Content Caches that use the same public IP address as the device. When PeerLocalSubnetsOnly is true, it overrides the configuration of PeerFilterRanges and PeerListenRanges. If the network changes, the local network peering restrictions update appropriately.
If set to false, the Content Cache defers to PeerFilterRanges and PeerListenRanges for configuring the peering restrictions.
Default is true.
Availability: Available in macOS 10.13.4 and later.</string>
			<key>pfm_name</key>
			<string>PeerLocalSubnetsOnly</string>
			<key>pfm_title</key>
			<string>Restrict Peers To Local Network</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of dictionaries describing a range of peer IP addresses that the content cache uses to filter its list of peers to query for content. The content cache only queries peers in 'PeerFilterRanges'. When 'PeerFilterRanges' is an empty array, the content cache doesn't query any peers.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>PeerLocalSubnetsOnly</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>PeerFilterRanges</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>RangeDict</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>IPv4</string>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>type</string>
							<key>pfm_range_list</key>
							<array>
								<string>IPv4</string>
								<string>IPv6</string>
							</array>
							<key>pfm_title</key>
							<string>IP Address Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>first</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Start IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>10.0.0.0</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>last</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>End IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>10.255.255.255</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>RangeDict</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Peer Filter Ranges</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of dictionaries describing a range of peer IP addresses the content cache responds to. When 'PeerListenRanges' is an empty array, the content cache responds with an error to all cache queries.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>PeerLocalSubnetsOnly</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>PeerListenRanges</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>RangeDict</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>IPv4</string>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>type</string>
							<key>pfm_range_list</key>
							<array>
								<string>IPv4</string>
								<string>IPv6</string>
							</array>
							<key>pfm_title</key>
							<string>IP Address Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>first</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Start IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>10.0.0.0</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>last</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>End IP Address</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>10.255.255.255</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>RangeDict</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Peer Listen Ranges</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>30</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>PeerDownloadTimeout</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_max</key>
			<integer>300</integer>
			<key>pfm_range_min</key>
			<integer>5</integer>
			<key>pfm_title</key>
			<string>Peer Download Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>30</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>PeerNotifyTimeout</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_max</key>
			<integer>300</integer>
			<key>pfm_range_min</key>
			<integer>5</integer>
			<key>pfm_title</key>
			<string>Peer Notify Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>5</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>PeerQueryTimeout</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_max</key>
			<integer>60</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Peer Query Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>900</integer>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/guide/mac-help/configure-advanced-content-caching-settings-mchl91e7141a/10.15/mac/10.15</string>
			<key>pfm_name</key>
			<string>PeerRetryInterval</string>
			<key>pfm_note</key>
			<string>Advanced Config - local .plist only, no profile support</string>
			<key>pfm_range_max</key>
			<integer>3600</integer>
			<key>pfm_range_min</key>
			<integer>30</integer>
			<key>pfm_title</key>
			<string>Peer Retry Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Content Caching</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>4</integer>
</dict>
</plist>
