<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Cellular Private Network Settings and Device Configuration</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/cellularprivatenetwork</string>
	<key>pfm_domain</key>
	<string>com.apple.cellularprivatenetwork.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_ios_min</key>
	<string>17.0</string>
	<key>pfm_last_modified</key>
	<date>2024-09-12T10:00:38Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Cellular Private Network Settings and Device Configuration</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Cellular Private Network</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.cellularprivatenetwork.managed</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.cellularprivatenetwork.managed</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A list of up to 1000 geofences for private networks. Geofencing is only used on iPhone.</string>
			<key>pfm_name</key>
			<string>Geofences</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>GeofenceItem</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The longitude of the geofence.</string>
							<key>pfm_name</key>
							<string>Longitude</string>
							<key>pfm_range_max</key>
							<real>180</real>
							<key>pfm_range_min</key>
							<real>-180</real>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>real</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The latitude of the geofence.</string>
							<key>pfm_name</key>
							<string>Latitude</string>
							<key>pfm_range_max</key>
							<real>90</real>
							<key>pfm_range_min</key>
							<real>-90</real>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>real</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Specifies the radius of the geofence in meters. Set this value slightly greater than the private cellular network coverage area.</string>
							<key>pfm_name</key>
							<string>Radius</string>
							<key>pfm_range_max</key>
							<real>6500</real>
							<key>pfm_range_min</key>
							<real>100</real>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>real</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>A geofence identifier that's unique within a list of geofences.</string>
							<key>pfm_name</key>
							<string>GeofenceId</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The name of the private network configuration data set.</string>
			<key>pfm_name</key>
			<string>DataSetName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The version number of this dataset that the system uses to track updates.</string>
			<key>pfm_name</key>
			<string>VersionNumber</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Set to 'true' to prefer this private network over Wi-Fi.</string>
			<key>pfm_name</key>
			<string>CellularDataPreferred</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Set to 'true' if this private network is NR Standalone.</string>
			<key>pfm_name</key>
			<string>EnableNRStandalone</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>String formatted in accordance with the definition of a "Coordinated NID" (option 1 or option 2) in 3GPP 31.102 §12.7.1. Used to match this profile to a SIM present on the device. All combinations of NetworkIdentifier and CsgNetworkIdentifier must be unique between profiles installed on the device.</string>
			<key>pfm_ios_min</key>
			<string>18.0</string>
			<key>pfm_name</key>
			<string>NetworkIdentifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>String formatted in accordance with the definition of "CSG_ID" in 3GPP 23.003 §4.7. Used to match this profile to a SIM present on the device. All combinations of NetworkIdentifier and CsgNetworkIdentifier must be unique between profiles installed on the device.</string>
			<key>pfm_ios_min</key>
			<string>18.0</string>
			<key>pfm_name</key>
			<string>CsgNetworkIdentifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Cellular Private Network</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>1</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>iOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>17.0</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_shared_ipad</key>
			<dict>
				<key>pfmx_device_channel</key>
				<true/>
				<key>pfmx_mode</key>
				<string>allowed</string>
				<key>pfmx_user_channel</key>
				<false/>
			</dict>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
