<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define settings for mobile device management.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/mdm</string>
	<key>pfm_domain</key>
	<string>com.apple.mdm</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_ios_min</key>
	<string>4.0</string>
	<key>pfm_last_modified</key>
	<date>2024-03-01T15:25:39Z</date>
	<key>pfm_macos_min</key>
	<string>10.7</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
		<string>tvOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Use this section to define mobile device management (MDM) settings.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>MDM</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.mdm</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.mdm</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The URL that the device contacts to retrieve device management instructions. The URL must begin with the 'https://' URL scheme, and may contain a port number (':1234', for example).</string>
			<key>pfm_format</key>
			<string>^https://.+$</string>
			<key>pfm_name</key>
			<string>ServerURL</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Server URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of strings, each containing the UUID of a certificate to be used when evaluating trust to the '.../connect/' URLs of MDM servers.</string>
			<key>pfm_name</key>
			<string>ServerURLPinningCertificateUUIDs</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Server URL Pinning Certificate Identifiers</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.4</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.13</string>
				</dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.4</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A unique array of strings indicating server capabilities. If the server manages macOS devices or a Shared iPad, this field is mandatory and must contain the value 'com.apple.mdm.per-user-connections', which indicates that the server supports both device and user connections.
Starting with macOS 11, it is also recommended that macOS device enrollment profiles contain the value 'com.apple.mdm.bootstraptoken' to ensure the Bootstrap Token is created and escrowed with the MDM server at enrollment time.</string>
			<key>pfm_name</key>
			<string>ServerCapabilities</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>ServerCapabilitiesItems</string>
					<key>pfm_range_list</key>
					<array>
						<string>com.apple.mdm.per-user-connections</string>
						<string>com.apple.mdm.bootstraptoken</string>
						<string>com.apple.mdm.token</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_unique</key>
					<true/>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Server Capabilities</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The topic that MDM listens to for push notifications. The certificate that the server uses to send push notifications must have the same topic in its subject. The topic must begin with the 'com.apple.mgmt.' prefix.</string>
			<key>pfm_format</key>
			<string>^com\.apple\.mgmt\..+$</string>
			<key>pfm_name</key>
			<string>Topic</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Topic</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The UUID of the certificate payload for the device's identity. It may also point to a SCEP payload.</string>
			<key>pfm_name</key>
			<string>IdentityCertificateUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Identity Certificate Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Managed Apple ID of the user. Available in iOS 13.1 and later, and macOS 10.15 and later. This is only used with the profile-driven BYOD enrollment flow, and must not be present in the BYOD and ADDE account-driven enrollment flows. As of iOS 17 and macOS 14, profile-driven user enrollments are deprecated and will be removed in a future release.</string>
			<key>pfm_ios_deprecated</key>
			<string>17.0</string>
			<key>pfm_ios_min</key>
			<string>13.1</string>
			<key>pfm_macos_deprecated</key>
			<string>14.0</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>ManagedAppleID</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Managed Apple ID</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_deprecated</key>
					<string>17.0</string>
					<key>pfmx_introduced</key>
					<string>13.1</string>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>required</string>
					</dict>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_deprecated</key>
					<string>14.0</string>
					<key>pfmx_introduced</key>
					<string>10.15</string>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>required</string>
					</dict>
				</dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>watchOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Logical OR of the following bit flags:
'1': Allow inspection of installed configuration profiles.
'2': Allow installation and removal of configuration profiles.
'4': Allow device lock and passcode removal.
'8': Allow device erase.
'16': Allow query of device information (device capacity, serial number).
'32': Allow query of network information (phone/SIM numbers, MAC addresses).
'64': Allow inspection of installed provisioning profiles.
'128': Allow installation and removal of provisioning profiles.
'256': Allow inspection of installed applications.
'512': Allow restriction-related queries.
'1024': Allow security-related queries.
'2048': Allow manipulation of settings.
'4096': Allow app management.
The value can't be '0'. If '2' is specified, '1' must also be specified. If '128' is specified, '64' must also be specified.
If the 'ManagedAppleID' is included, then 'AccessRights' are ignored.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>ManagedAppleID</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>AccessRights</string>
			<key>pfm_note</key>
			<string>Each bit-flag allows an access right as follows:
1: Inspection of installed configuration profiles.
2: Installation and removal of configuration profiles.
4: Device lock and passcode removal.
8: Device erase.
16: Query of device information (device capacity, serial number).
32: Query of network information (phone/SIM numbers, MAC addresses).
64: Inspection of installed provisioning profiles.
128: Installation and removal of provisioning profiles.
256: Inspection of installed applications.
512: Restriction-related queries.
1024: Security-related queries.
2048: Manipulation of settings.
4096: App management.</string>
			<key>pfm_title</key>
			<string>Access Rights</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>ignored</string>
					</dict>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>ignored</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The URL that the device should use to check in during installation. The URL must begin with the 'https://' URL scheme and may contain a port number (':1234', for example). If this URL isn't given, 'ServerURL' is used for both purposes.</string>
			<key>pfm_format</key>
			<string>^https://.+$</string>
			<key>pfm_name</key>
			<string>CheckInURL</string>
			<key>pfm_title</key>
			<string>Check-In URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of strings, each containing the payload UUID of a certificate to be used when evaluating trust to the '.../checkin/' URLs of MDM servers.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>CheckInURL</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>CheckInURLPinningCertificateUUIDs</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Check-In URL Pinning Certificate Identifiers</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.4</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.13</string>
				</dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.4</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the device attempts to send a CheckOut &lt;https://developer.apple.com/library/archive/documentation/Miscellaneous/Reference/MobileDeviceManagementProtocolRef/2-MDM_Check_In_Protocol/MDM_Check_In_Protocol..html#//apple_ref/doc/uid/TP40017387-CH4-SW7&gt; message to the 'CheckInURL' when the profile is removed.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>CheckInURL</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>CheckOutWhenRemoved</string>
			<key>pfm_title</key>
			<string>Check-Out When Removed</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', fails the connection attempt unless a verified positive response is obtained during certificate revocation checks.
If 'false', revocation checks are done on a best-attempt basis, where failure to reach the server isn't considered fatal.</string>
			<key>pfm_name</key>
			<string>PinningRevocationCheckRequired</string>
			<key>pfm_title</key>
			<string>Pinning Revocation Check Required</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.4</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.13</string>
				</dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.4</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', warns the user that they need to reboot into RecoveryOS and allow the MDM to use the Bootstrap Token for authentication for certain sensitive operations such as enabling kernel extensions or installing some types of software updates. If the MDM doesn't need to perform these operations, it can leave this key set to 'false', and the user won't be notified.
The SettingsCommand.Command.Settings.MDMOptions.MDMOptions command overrides this default value.
This setting only applies to devices that have 'BootstrapTokenRequiredForSoftwareUpdate' or 'BootstrapTokenRequiredForKernelExtensionApproval' set to 'true' in their SecurityInfoResponse.SecurityInfo.
DEP-enrolled devices are automatically allowed to use the Bootstrap Token for authentication.
Available in macOS 11 and later.</string>
			<key>pfm_name</key>
			<string>PromptUserToAllowBootstrapTokenForAuthentication</string>
			<key>pfm_title</key>
			<string>Prompt User to Allow Bootstrap Token for Authentication</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>11.0</string>
				</dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>watchOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', each message coming from the device carries the additional 'Mdm-Signature' HTTP header.</string>
			<key>pfm_name</key>
			<string>SignMessage</string>
			<key>pfm_title</key>
			<string>Sign Message</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the device uses the development APNS servers. Otherwise, the device uses the production servers.
Note that this property must be set to 'false' if your Apple Push Notification Service certificate was issued by the Apple Push Certificate Portal ('https://identity.apple.com/pushcert'). That portal only issues certificates for the production push environment.</string>
			<key>pfm_name</key>
			<string>UseDevelopmentAPNS</string>
			<key>pfm_title</key>
			<string>Use Development Apns</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Managed Apple ID pre-assigned to the authenticated user. This is only used with the account-based BYOD enrollment flow. Available in iOS 15 and later.</string>
			<key>pfm_ios_min</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>AssignedManagedAppleID</string>
			<key>pfm_title</key>
			<string>Assigned Managed Apple ID</string>
			<key>pfm_tvos_min</key>
			<string>15.0</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>15.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>14.0</string>
				</dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>watchOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The enrollment mode the server indicates must be used when enrolling. This must be present for account-based BYOD enrollments, but must not be present for profile-based BYOD enrollments. Available in iOS 15 and later.</string>
			<key>pfm_ios_min</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>EnrollmentMode</string>
			<key>pfm_note</key>
			<string>This must be present for BYOD enrollments.</string>
			<key>pfm_range_list</key>
			<array>
				<string>BYOD</string>
				<string>ADDE</string>
			</array>
			<key>pfm_title</key>
			<string>EnrollmentMode</string>
			<key>pfm_tvos_min</key>
			<string>15.0</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>15.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>14.0</string>
				</dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>watchOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This property specifies an iTunes Store ID for an app the system can install with the InstallApplicationCommand, without any approval from the user. The MDM vendor or managing organization generally provides this app, which enhances the management experience for the user. The device shows the user details about this app in the account-driven enrollment process prior to installing the MDM profile. Use this property with account-driven MDM enrollments that normally require user approval for app installs through MDM.
Only account-driven user enrollments support this property and other enrollment types ignore it.
Available in iOS 15.1 and later.</string>
			<key>pfm_documentation_url</key>
			<string>https://support.apple.com/en-in/guide/deployment/dep950aed53e/web</string>
			<key>pfm_ios_min</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>RequiredAppIDForMDM</string>
			<key>pfm_title</key>
			<string>Required App ID for MDM on Unsupervised Device</string>
			<key>pfm_tvos_min</key>
			<string>15.0</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>15.1</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>watchOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>MDM</string>
	<key>pfm_tvos_min</key>
	<string>9.0</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>iOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>4.0</string>
			<key>pfmx_multiple</key>
			<false/>
			<key>pfmx_shared_ipad</key>
			<dict>
				<key>pfmx_device_channel</key>
				<true/>
				<key>pfmx_mode</key>
				<string>allowed</string>
				<key>pfmx_user_channel</key>
				<false/>
			</dict>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
		<key>macOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_device_channel</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>10.7</string>
			<key>pfmx_multiple</key>
			<false/>
			<key>pfmx_requires_dep</key>
			<false/>
			<key>pfmx_user_approved_mdm</key>
			<false/>
			<key>pfmx_user_channel</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
		<key>tvOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>6.0</string>
			<key>pfmx_multiple</key>
			<false/>
			<key>pfmx_supervised</key>
			<false/>
		</dict>
		<key>watchOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<false/>
			<key>pfmx_introduced</key>
			<string>10.0</string>
			<key>pfmx_multiple</key>
			<false/>
			<key>pfmx_supervised</key>
			<true/>
		</dict>
	</dict>
</dict>
</plist>
