<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Exchange Web Services settings</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/exchangewebservices</string>
	<key>pfm_domain</key>
	<string>com.apple.ews.account</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2023-08-21T10:35:00Z</date>
	<key>pfm_note</key>
	<string>As with VPN and Wi-Fi configurations, it is possible to associate an SCEP credential with an Exchange configu- ration via the PayloadCertificateUUID key.</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures an Exchange account</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>IdentificationUUID</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The display name for the account.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_title</key>
			<string>Account name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.ews.account</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.ews.account</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile.
The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>IdentificationUUID</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The user name with the optional domain (e.g "user" or "domain\user").</string>
			<key>pfm_description_reference</key>
			<string>This string specifies the user name for this Exchange account.
Required in macOS or non-interactive installations (like MDM on iOS).</string>
			<key>pfm_name</key>
			<string>UserName</string>
			<key>pfm_title</key>
			<string>Account user name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>IdentificationUUID</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The email address for the account (e.g. john@company.com).</string>
			<key>pfm_description_reference</key>
			<string>Specifies the full email address for the account. If not present in the payload, the device prompts for this string during profile installation.
In macOS, this key is required.</string>
			<key>pfm_name</key>
			<string>EmailAddress</string>
			<key>pfm_title</key>
			<string>Account email address</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The password of the user account.</string>
			<key>pfm_description_reference</key>
			<string>Optional. The password of the account. Use only with encrypted profiles.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>OAuth</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>Password</string>
			<key>pfm_sensitive</key>
			<true/>
			<key>pfm_title</key>
			<string>Account password</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default_copy</key>
			<string>com.apple.configurationprofile.identification@PayloadUUID</string>
			<key>pfm_description</key>
			<string>The UUID of the Identification Payload to use as the source for user values.</string>
			<key>pfm_name</key>
			<string>IdentificationUUID</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>IdentificationUUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Exchange server host name or IP address.
If using OAuth, the host name is ignored..</string>
			<key>pfm_name</key>
			<string>Host</string>
			<key>pfm_title</key>
			<string>Internal Exchange Host</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The server port number.</string>
			<key>pfm_name</key>
			<string>Port</string>
			<key>pfm_range_max</key>
			<integer>65535</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Internal Exchange Host Port</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The server path.</string>
			<key>pfm_name</key>
			<string>Path</string>
			<key>pfm_title</key>
			<string>Internal server path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', enables SSL.</string>
			<key>pfm_name</key>
			<string>SSL</string>
			<key>pfm_title</key>
			<string>Use SSL for Internal Exchange Host</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The external server address.</string>
			<key>pfm_name</key>
			<string>ExternalHost</string>
			<key>pfm_title</key>
			<string>External Exchange Host</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The external server port number.</string>
			<key>pfm_name</key>
			<string>ExternalPort</string>
			<key>pfm_range_max</key>
			<integer>65535</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>External Exchange Host Port</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The external server path.</string>
			<key>pfm_name</key>
			<string>ExternalPath</string>
			<key>pfm_title</key>
			<string>External server path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', enables SSL for connections to the external server.</string>
			<key>pfm_name</key>
			<string>ExternalSSL</string>
			<key>pfm_title</key>
			<string>Use SSL for External Exchange Host</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables OAuth for authentication. If OAuth is enabled, don't specify a password.
Available in macOS 10.14 and later</string>
			<key>pfm_description_reference</key>
			<string>Optional. Specifies whether the connection should use OAuth for authentication. If enabled, a password should not be specified. This defaults to false.
Availability: Available only in iOS 12.0 and macOS 10.14 and later.</string>
			<key>pfm_macos_min</key>
			<string>10.14</string>
			<key>pfm_name</key>
			<string>OAuth</string>
			<key>pfm_title</key>
			<string>Use OAuth</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The URL to load into a web view for authentication via OAuth when autodiscovery isn't used. This setting requires a 'Host' value.</string>
			<key>pfm_description_reference</key>
			<string>Optional. Specifies the URL to load into a webview for authentication via OAuth when auto-discovery is not used. Requires a Host value.
Availability: Available only in macOS 10.14 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>Host</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_macos_min</key>
			<string>10.14</string>
			<key>pfm_name</key>
			<string>OAuthSignInURL</string>
			<key>pfm_title</key>
			<string>OAuth Sign-In URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Exchange (macOS)</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>3</integer>
</dict>
</plist>
