<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define settings for configuration access to SCEP servers.</string>
	<key>pfm_domain</key>
	<string>com.apple.security.scep</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2019-10-11T01:10:32Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
		<string>tvOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures SCEP settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>SCEP</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.security.scep</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.security.scep</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This dictionary contains the payload contents</string>
			<key>pfm_name</key>
			<string>PayloadContent</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The base URL for the SCEP server</string>
					<key>pfm_name</key>
					<string>URL</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>URL</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Any string that is understood by the SCEP server. For example, it could be a domain name like example.org. If a certificate authority has multiple CA certificates this field can be used to distinguish which is required.</string>
					<key>pfm_name</key>
					<string>Name</string>
					<key>pfm_title</key>
					<string>Name</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The representation of a X.500 name represented as an array of OID and value. OIDs can be represented as dotted numbers, with shortcuts for country (C), locality (L), state (ST), organization (O), organizational unit (OU), and common name (CN).</string>
					<key>pfm_format</key>
					<string>(,?[^=,]+=[^=,]+(,|$))</string>
					<key>pfm_name</key>
					<string>Subject</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>This array holds another array which holds an OID value pair</string>
							<key>pfm_name</key>
							<string>SCEPSubjectArrayInnerArray</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>An array representing an OID and value pair.</string>
									<key>pfm_name</key>
									<string>SCEPSubjectArrayPair</string>
									<key>pfm_repetition_max</key>
									<integer>2</integer>
									<key>pfm_repetition_min</key>
									<integer>2</integer>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>One item in the array representing a OID</string>
											<key>pfm_name</key>
											<string>OID</string>
											<key>pfm_title</key>
											<string>OID</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_description</key>
											<string>One item in the array representing a value</string>
											<key>pfm_name</key>
											<string>Value</string>
											<key>pfm_title</key>
											<string>Value</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>Subject Array Pair</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Array Inside SCEP Subject Array</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Subject</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>string</string>
					<key>pfm_substitution_variables</key>
					<dict>
						<key>%AD_ComputerID%</key>
						<dict>
							<key>pfm_description</key>
							<string>Active Directory computer ID.</string>
							<key>pfm_value_placeholder</key>
							<string></string>
							<key>pfm_substitution_source</key>
							<string>local</string>
						</dict>
						<key>%AD_Domain%</key>
						<dict>
							<key>pfm_description</key>
							<string>Active Directory domain.</string>
							<key>pfm_value_placeholder</key>
							<string></string>
							<key>pfm_substitution_source</key>
							<string>local</string>
						</dict>
						<key>%AD_DomainForestName%</key>
						<dict>
							<key>pfm_description</key>
							<string>Active Directory forest name.</string>
							<key>pfm_value_placeholder</key>
							<string></string>
							<key>pfm_substitution_source</key>
							<string>local</string>
						</dict>
						<key>%AD_DomainGuid%</key>
						<dict>
							<key>pfm_description</key>
							<string>Active Directory GUID.</string>
							<key>pfm_value_placeholder</key>
							<string>20405B46-877F-4274-ADB8-A1FCAA765998</string>
							<key>pfm_substitution_source</key>
							<string>local</string>
						</dict>
						<key>%AD_DomainNameDNS%</key>
						<dict>
							<key>pfm_description</key>
							<string>Active Directory DNS Name.</string>
							<key>pfm_value_placeholder</key>
							<string></string>
							<key>pfm_substitution_source</key>
							<string>local</string>
						</dict>
						<key>%AD_KerberosID%</key>
						<dict>
							<key>pfm_description</key>
							<string>Active Directory Kerberos ID.</string>
							<key>pfm_value_placeholder</key>
							<string></string>
							<key>pfm_substitution_source</key>
							<string>local</string>
						</dict>
						<key>%ComputerName%</key>
						<dict>
							<key>pfm_description</key>
							<string>The computer’s name, as set in System Preferences > Sharing.</string>
							<key>pfm_value_placeholder</key>
							<string>ProfileCreator's MacBook Pro</string>
							<key>pfm_substitution_source</key>
							<string>local</string>
						</dict>
						<key>%HardwareUUID%</key>
						<dict>
							<key>pfm_description</key>
							<string>The computer’s unique identifier.</string>
							<key>pfm_value_placeholder</key>
							<string>7CD8DFF1-70B5-403D-81C2-A41A5F29CFF9</string>
							<key>pfm_substitution_source</key>
							<string>local</string>
						</dict>
						<key>%HostName%</key>
						<dict>
							<key>pfm_description</key>
							<string>The computer’s DNS name, such as mac1.example.com.</string>
							<key>pfm_value_placeholder</key>
							<string>ProfileCreators-MBP.domain.com</string>
							<key>pfm_substitution_source</key>
							<string>local</string>
						</dict>
						<key>%LocalHostName%</key>
						<dict>
							<key>pfm_description</key>
							<string>The computer’s local network name, such as Mac1.local.</string>
							<key>pfm_value_placeholder</key>
							<string>ProfileCreators-MacBook-Pro</string>
							<key>pfm_substitution_source</key>
							<string>local</string>
						</dict>
						<key>%MACAddress%</key>
						<dict>
							<key>pfm_description</key>
							<string>The computer’s Ethernet (en0) MAC address.</string>
							<key>pfm_value_placeholder</key>
							<string>a1:b2:c3:d4:e5:f6</string>
							<key>pfm_substitution_source</key>
							<string>local</string>
						</dict>
						<key>%SerialNumber%</key>
						<dict>
							<key>pfm_description</key>
							<string>The computer’s serial number.</string>
							<key>pfm_value_placeholder</key>
							<string>C02LZ9Q1CC55</string>
							<key>pfm_substitution_source</key>
							<string>local</string>
						</dict>
					</dict>
					<key>pfm_value_placeholder</key>
					<string>O=ProfileCreator,CN=ProfileCreator Identity &lt;UUID&gt;</string>
					<key>pfm_value_processor</key>
					<string>x5002subjectArray</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Used as the pre-shared secret for automatic enrollment.</string>
					<key>pfm_name</key>
					<string>Challenge</string>
					<key>pfm_title</key>
					<string>Challenge</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1024</integer>
					<key>pfm_description</key>
					<string>Key size in bits</string>
					<key>pfm_name</key>
					<string>Keysize</string>
					<key>pfm_range_list</key>
					<array>
						<integer>1024</integer>
						<integer>2048</integer>
					</array>
					<key>pfm_title</key>
					<string>Key Size</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The fingerprint (hex string) of the Certificate Authority certificate.</string>
					<key>pfm_name</key>
					<string>CAFingerprint</string>
					<key>pfm_title</key>
					<string>Fingerprint</string>
					<key>pfm_type</key>
					<string>data</string>
					<key>pfm_type_input</key>
					<string>string</string>
					<key>pfm_value_processor</key>
					<string>hex2data</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>RSA</string>
					<key>pfm_description</key>
					<string>Currently always "RSA".</string>
					<key>pfm_name</key>
					<string>Key Type</string>
					<key>pfm_range_list</key>
					<array>
						<string>RSA</string>
					</array>
					<key>pfm_title</key>
					<string>Key Type</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>A bitmask indicating the use of the key.\n• 1 - signing\n• 4 - encryption\n• 5 - signing and encryption</string>
					<key>pfm_ios_min</key>
					<string>4.0</string>
					<key>pfm_name</key>
					<string>Key Usage</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
						<integer>4</integer>
						<integer>5</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>None</string>
						<string>Signing</string>
						<string>Encryption</string>
						<string>Both signing and encryption</string>
					</array>
					<key>pfm_title</key>
					<string>Key Usage</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Allow / restrict exporting the private key from the keychain.</string>
					<key>pfm_description_reference</key>
					<string>If `false`, disables exporting the private key from the keychain.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>KeyIsExtractable</string>
					<key>pfm_title</key>
					<string>Key is Extractable</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Specifies the Subject Alt Name for the certificate.</string>
					<key>pfm_name</key>
					<string>SubjectAltName</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>RFC 822 (email address) string</string>
							<key>pfm_name</key>
							<string>rfc822Name</string>
							<key>pfm_title</key>
							<string>RFC 822 Name</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_substitution_variables</key>
							<dict>
								<key>%AD_ComputerID%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory computer ID.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_Domain%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory domain.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_DomainForestName%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory forest name.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_DomainGuid%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory GUID.</string>
									<key>pfm_value_placeholder</key>
									<string>20405B46-877F-4274-ADB8-A1FCAA765998</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_DomainNameDNS%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory DNS Name.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_KerberosID%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory Kerberos ID.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%ComputerName%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s name, as set in System Preferences > Sharing.</string>
									<key>pfm_value_placeholder</key>
									<string>ProfileCreator's MacBook Pro</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%HardwareUUID%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s unique identifier.</string>
									<key>pfm_value_placeholder</key>
									<string>7CD8DFF1-70B5-403D-81C2-A41A5F29CFF9</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%HostName%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s DNS name, such as mac1.example.com.</string>
									<key>pfm_value_placeholder</key>
									<string>ProfileCreators-MBP.domain.com</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%LocalHostName%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s local network name, such as Mac1.local.</string>
									<key>pfm_value_placeholder</key>
									<string>ProfileCreators-MacBook-Pro</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%MACAddress%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s Ethernet (en0) MAC address.</string>
									<key>pfm_value_placeholder</key>
									<string>a1:b2:c3:d4:e5:f6</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%SerialNumber%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s serial number.</string>
									<key>pfm_value_placeholder</key>
									<string>C02LZ9Q1CC55</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
							</dict>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>DNS Name</string>
							<key>pfm_name</key>
							<string>dNSName</string>
							<key>pfm_title</key>
							<string>DNS Name</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_substitution_variables</key>
							<dict>
								<key>%AD_ComputerID%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory computer ID.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_Domain%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory domain.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_DomainForestName%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory forest name.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_DomainGuid%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory GUID.</string>
									<key>pfm_value_placeholder</key>
									<string>20405B46-877F-4274-ADB8-A1FCAA765998</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_DomainNameDNS%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory DNS Name.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_KerberosID%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory Kerberos ID.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%ComputerName%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s name, as set in System Preferences > Sharing.</string>
									<key>pfm_value_placeholder</key>
									<string>ProfileCreator's MacBook Pro</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%HardwareUUID%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s unique identifier.</string>
									<key>pfm_value_placeholder</key>
									<string>7CD8DFF1-70B5-403D-81C2-A41A5F29CFF9</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%HostName%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s DNS name, such as mac1.example.com.</string>
									<key>pfm_value_placeholder</key>
									<string>ProfileCreators-MBP.domain.com</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%LocalHostName%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s local network name, such as Mac1.local.</string>
									<key>pfm_value_placeholder</key>
									<string>ProfileCreators-MacBook-Pro</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%MACAddress%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s Ethernet (en0) MAC address.</string>
									<key>pfm_value_placeholder</key>
									<string>a1:b2:c3:d4:e5:f6</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%SerialNumber%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s serial number.</string>
									<key>pfm_value_placeholder</key>
									<string>C02LZ9Q1CC55</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
							</dict>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Uniform Resource Indentifier</string>
							<key>pfm_name</key>
							<string>uniformResourceIdentifier</string>
							<key>pfm_title</key>
							<string>URI</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_substitution_variables</key>
							<dict>
								<key>%AD_ComputerID%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory computer ID.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_Domain%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory domain.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_DomainForestName%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory forest name.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_DomainGuid%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory GUID.</string>
									<key>pfm_value_placeholder</key>
									<string>20405B46-877F-4274-ADB8-A1FCAA765998</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_DomainNameDNS%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory DNS Name.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_KerberosID%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory Kerberos ID.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%ComputerName%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s name, as set in System Preferences > Sharing.</string>
									<key>pfm_value_placeholder</key>
									<string>ProfileCreator's MacBook Pro</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%HardwareUUID%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s unique identifier.</string>
									<key>pfm_value_placeholder</key>
									<string>7CD8DFF1-70B5-403D-81C2-A41A5F29CFF9</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%HostName%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s DNS name, such as mac1.example.com.</string>
									<key>pfm_value_placeholder</key>
									<string>ProfileCreators-MBP.domain.com</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%LocalHostName%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s local network name, such as Mac1.local.</string>
									<key>pfm_value_placeholder</key>
									<string>ProfileCreators-MacBook-Pro</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%MACAddress%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s Ethernet (en0) MAC address.</string>
									<key>pfm_value_placeholder</key>
									<string>a1:b2:c3:d4:e5:f6</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%SerialNumber%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s serial number.</string>
									<key>pfm_value_placeholder</key>
									<string>C02LZ9Q1CC55</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
							</dict>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>NT Principal Name</string>
							<key>pfm_name</key>
							<string>ntPrincipalName</string>
							<key>pfm_title</key>
							<string>NT Principal Name</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_substitution_variables</key>
							<dict>
								<key>%AD_ComputerID%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory computer ID.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_Domain%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory domain.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_DomainForestName%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory forest name.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_DomainGuid%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory GUID.</string>
									<key>pfm_value_placeholder</key>
									<string>20405B46-877F-4274-ADB8-A1FCAA765998</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_DomainNameDNS%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory DNS Name.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%AD_KerberosID%</key>
								<dict>
									<key>pfm_description</key>
									<string>Active Directory Kerberos ID.</string>
									<key>pfm_value_placeholder</key>
									<string></string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%ComputerName%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s name, as set in System Preferences > Sharing.</string>
									<key>pfm_value_placeholder</key>
									<string>ProfileCreator's MacBook Pro</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%HardwareUUID%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s unique identifier.</string>
									<key>pfm_value_placeholder</key>
									<string>7CD8DFF1-70B5-403D-81C2-A41A5F29CFF9</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%HostName%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s DNS name, such as mac1.example.com.</string>
									<key>pfm_value_placeholder</key>
									<string>ProfileCreators-MBP.domain.com</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%LocalHostName%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s local network name, such as Mac1.local.</string>
									<key>pfm_value_placeholder</key>
									<string>ProfileCreators-MacBook-Pro</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%MACAddress%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s Ethernet (en0) MAC address.</string>
									<key>pfm_value_placeholder</key>
									<string>a1:b2:c3:d4:e5:f6</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
								<key>%SerialNumber%</key>
								<dict>
									<key>pfm_description</key>
									<string>The computer’s serial number.</string>
									<key>pfm_value_placeholder</key>
									<string>C02LZ9Q1CC55</string>
									<key>pfm_substitution_source</key>
									<string>local</string>
								</dict>
							</dict>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Subject Alt Name</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>3</integer>
					<key>pfm_description</key>
					<string>The number of times the device should retry if the server sends a PENDING response.</string>
					<key>pfm_name</key>
					<string>Retries</string>
					<key>pfm_title</key>
					<string>Retries</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>10</integer>
					<key>pfm_description</key>
					<string>The number of seconds to wait between subsequent retries. The first retry is attempted without this delay.</string>
					<key>pfm_name</key>
					<string>RetryDelay</string>
					<key>pfm_title</key>
					<string>Retry Delay</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>14</integer>
					<key>pfm_description</key>
					<string>The number of days before the certificate expires at which to start showing the expiration notification</string>
					<key>pfm_name</key>
					<string>CertificateRenewalTimeInterval</string>
					<key>pfm_platforms</key>
					<array>
						<string>macOS</string>
					</array>
					<key>pfm_title</key>
					<string>Certificate Expiration Notification</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allow all apps to access the certificate in the keychain</string>
					<key>pfm_name</key>
					<string>AllowAllAppsAccess</string>
					<key>pfm_platforms</key>
					<array>
						<string>macOS</string>
					</array>
					<key>pfm_title</key>
					<string>Allow access to all apps</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Payload Content</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>SCEP</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>8</integer>
</dict>
</plist>
