<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define policy for system extensions.</string>
	<key>pfm_domain</key>
	<string>com.apple.system-extension-policy</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2020-10-22T22:35:09Z</date>
	<key>pfm_macos_min</key>
	<string>10.15</string>
	<key>pfm_note</key>
	<string>When multiple System Extension profiles are installed, the AllowUserOverrides preference key will be set to false if any profile sets it to false. As such, if you intend to set this to true, all System Extension profiles must also set this to true.</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures System Extensions Policy</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>System Extension Policy</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.system-extension-policy</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.system-extension-policy</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Set this property to false to prevent users from approving system extensions not explicitly allowed by configuration profiles.</string>
			<key>pfm_name</key>
			<string>AllowUserOverrides</string>
			<key>pfm_title</key>
			<string>Allow users to approve system extensions</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>List of team identifiers that define which validly signed system extensions will be allowed to load.</string>
			<key>pfm_name</key>
			<string>AllowedTeamIdentifiers</string>
			<key>pfm_note</key>
			<string>Team identifiers cannot be defined in this list and at the same time serve as keys in the "Allowed System Extensions" property.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>TeamIdentifier</string>
					<key>pfm_title</key>
					<string>Team Identifier</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>A1B2C3D4E5</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allowed Team Identifiers</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Dictionary of system extensions that will be allowed. Each extension is represented in the dictionary using its team identifier string as key and its bundle identifier string as the associated value.</string>
			<key>pfm_name</key>
			<string>AllowedSystemExtensions</string>
			<key>pfm_note</key>
			<string>Team identifiers cannot be used as keys in this dictionary and at the same time be defined in the "Allowed Team Identifiers" property.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>{{key}}</string>
					<key>pfm_title</key>
					<string>Team Identifier</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>A1B2C3D4E5</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>{{value}}</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>BundleIdentifier</string>
							<key>pfm_title</key>
							<string>Bundle Identifier</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>com.domainname.applicationname</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Bundle Identifier</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allowed System Extensions</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Dictionary of developer teams and their allowed system extension types. Entries use the team identifier as the key and an array of the allowed extension type strings as the associated value.</string>
			<key>pfm_name</key>
			<string>AllowedSystemExtensionTypes</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>{{key}}</string>
					<key>pfm_title</key>
					<string>Team Identifier</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>A1B2C3D4E5</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>{{value}}</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>SystemExtentionType</string>
							<key>pfm_range_list</key>
							<array>
								<string>DriverExtension</string>
								<string>NetworkExtension</string>
								<string>EndpointSecurityExtension</string>
							</array>
							<key>pfm_title</key>
							<string>System Extention Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>System Extension Types</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allowed System Extension Types</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>System Extension Policy</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_user_approved</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
