<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to configure DNS settings.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/dnssettings</string>
	<key>pfm_domain</key>
	<string>com.apple.dnsSettings.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_ios_min</key>
	<string>14.0</string>
	<key>pfm_last_modified</key>
	<date>2024-09-12T10:00:38Z</date>
	<key>pfm_macos_min</key>
	<string>11.0</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Use this section to configure DNS settings.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>DNS Settings</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.dnsSettings.managed</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.dnsSettings.managed</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A dictionary that defines a configuration for an encrypted DNS server.</string>
			<key>pfm_name</key>
			<string>DNSSettings</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The encrypted transport protocol used to communicate with the DNS server.</string>
					<key>pfm_name</key>
					<string>DNSProtocol</string>
					<key>pfm_range_list</key>
					<array>
						<string>HTTPS</string>
						<string>TLS</string>
					</array>
					<key>pfm_require</key>
					<string>always-nested</string>
					<key>pfm_title</key>
					<string>DNS Protocol</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>An unordered list of DNS server IP address strings. These IP addresses can be a mixture of IPv4 and IPv6 addresses.</string>
					<key>pfm_name</key>
					<string>ServerAddresses</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>ServerAddressesElement</string>
							<key>pfm_title</key>
							<string>Server Address Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>DNS Server Addresses</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>TLS</string>
									</array>
									<key>pfm_target</key>
									<string>DNSSettings.DNSProtocol</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>The hostname of a DNS-over-TLS server used to validate the server certificate, as defined in RFC 7858. If no 'ServerAddresses' are provided, the system uses the hostname to determine the server addresses. This key must be present only if the DNSProtocol is 'TLS'.</string>
					<key>pfm_name</key>
					<string>ServerName</string>
					<key>pfm_note</key>
					<string>This key must be present only if the DNSProtocol is TLS.</string>
					<key>pfm_title</key>
					<string>Server Name</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>HTTPS</string>
									</array>
									<key>pfm_target</key>
									<string>DNSSettings.DNSProtocol</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>The URI template of a DNS-over-HTTPS server, as defined in RFC 8484. This URL needs to use the 'https://' scheme, and the system uses the hostname or address in the URL to validate the server certificate. If no 'ServerAddresses' are provided, the system uses the hostname or address in the URL to determine the server addresses. Required if 'DNSProtocol' is 'HTTPS'.</string>
					<key>pfm_format</key>
					<string>^https://.*</string>
					<key>pfm_name</key>
					<string>ServerURL</string>
					<key>pfm_note</key>
					<string>This key must be present only if the DNSProtocol is HTTPS.</string>
					<key>pfm_title</key>
					<string>Server URL</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>https://example.com</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A list of domain strings used to determine which DNS queries use the DNS server. If not set, all domains use the DNS server.
The system supports a single wildcard ('*') prefix, but it's not required. For example, both '*.example.com' and 'example.com' match against 'mydomain.example.com' and 'your.domain.example.com', but don't match against 'mydomain-example.com'.</string>
					<key>pfm_name</key>
					<string>SupplementalMatchDomains</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>SupplementalMatchDomainsElement</string>
							<key>pfm_title</key>
							<string>Supplemental Match Domains Element</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>*.example.com</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Supplemental Match Domains</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>DNS Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of rules that define the DNS settings. If not set, the system always applies the DNS settings. These rules are identical to the 'OnDemandRules' array in VPN payloads.</string>
			<key>pfm_name</key>
			<string>OnDemandRules</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>OnDemandRulesElement</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The action to take if this dictionary matches the current network. Allowed values:

* 'Connect': Apply DNS Settings when the dictionary matches.
* 'Disconnect': Don't apply DNS Settings when the dictionary matches.
* 'EvaluateConnection': Apply DNS Settings with per-domain exceptions when the dictionary matches.</string>
							<key>pfm_name</key>
							<string>Action</string>
							<key>pfm_range_list</key>
							<array>
								<string>Connect</string>
								<string>Disconnect</string>
								<string>EvaluateConnection</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Connect</string>
								<string>Disconnect</string>
								<string>Evaluate Connection</string>
							</array>
							<key>pfm_require</key>
							<string>always-nested</string>
							<key>pfm_title</key>
							<string>On Demand Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_conditionals</key>
							<array>
								<dict>
									<key>pfm_target_conditions</key>
									<array>
										<dict>
											<key>pfm_range_list</key>
											<array>
												<string>EvaluateConnection</string>
											</array>
											<key>pfm_target</key>
											<string>OnDemandRulesElement.Action</string>
										</dict>
									</array>
								</dict>
							</array>
							<key>pfm_description</key>
							<string>An array of dictionaries that provide per-connection rules. The system uses this array only for settings where the 'Action' value is 'EvaluateConnection'.</string>
							<key>pfm_name</key>
							<string>ActionParameters</string>
							<key>pfm_note</key>
							<string>This array is used only for settings where the Action value is EvaluateConnection.</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>A dictionary that provides per-connection rules.
The keys allowed in each dictionary are described below. Note: This array is used only for dictionaries in which EvaluateConnection is the Action value.</string>
									<key>pfm_name</key>
									<string>ActionParameter</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>The DNS settings behavior for the specified domains. Allowed values:

* 'NeverConnect': Don't use the DNS Settings for the specified domains.
* 'ConnectIfNeeded': Allow using the DNS Settings for the specified domains.</string>
											<key>pfm_name</key>
											<string>DomainAction</string>
											<key>pfm_range_list</key>
											<array>
												<string>NeverConnect</string>
												<string>ConnectIfNeeded</string>
											</array>
											<key>pfm_range_list_titles</key>
											<array>
												<string>Never Connect</string>
												<string>Connect if Needed</string>
											</array>
											<key>pfm_require</key>
											<string>always-nested</string>
											<key>pfm_title</key>
											<string>Domain Action</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_description</key>
											<string>The domains for which this evaluation applies.</string>
											<key>pfm_name</key>
											<string>Domains</string>
											<key>pfm_require</key>
											<string>always-nested</string>
											<key>pfm_subkeys</key>
											<array>
												<dict>
													<key>pfm_name</key>
													<string>DomainsElement</string>
													<key>pfm_title</key>
													<string>Domains Element</string>
													<key>pfm_type</key>
													<string>string</string>
												</dict>
											</array>
											<key>pfm_title</key>
											<string>Domains</string>
											<key>pfm_type</key>
											<string>array</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>Action Parameter</string>
									<key>pfm_type</key>
									<string>dictionary</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Action Parameters</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>An array of domain names. This rule matches if any of the domain names in the specified list matches any domain in the device's search domains list.
The system supports a single wildcard ('*') prefix, but it's not required. For example, both '*.example.com' and 'example.com' match against 'mydomain.example.com' and 'your.domain.example.com', but don't match against 'mydomain-example.com'.</string>
							<key>pfm_name</key>
							<string>DNSDomainMatch</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>DNSDomainMatchElement</string>
									<key>pfm_title</key>
									<string>DNS Domain Match Element</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>DNS Domain Match</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>An array of IP addresses. This rule matches if any of the network's specified DNS servers match any entry in the array.
The system supports matching with a single wildcard. For example, '17.*' matches any DNS server in the 17.0.0.0/8 subnet.</string>
							<key>pfm_name</key>
							<string>DNSServerAddressMatch</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>DNSServerAddressMatchElement</string>
									<key>pfm_title</key>
									<string>DNS Server Address Match Element</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>DNS Server Address Match</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>An interface type. If specified, this rule matches only if the primary network interface hardware matches the specified type.</string>
							<key>pfm_name</key>
							<string>InterfaceTypeMatch</string>
							<key>pfm_range_list</key>
							<array>
								<string>Ethernet</string>
								<string>WiFi</string>
								<string>Cellular</string>
							</array>
							<key>pfm_title</key>
							<string>Interface Type Match</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>An array of SSIDs to match against the current network. If the network isn't a Wi-Fi network or if the SSID doesn't appear in this array, the match fails. Omit this key and the corresponding array to match against any SSID.</string>
							<key>pfm_name</key>
							<string>SSIDMatch</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>SSIDMatchElement</string>
									<key>pfm_title</key>
									<string>SSID Match Element</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>SSID Match</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>A URL to probe. This rule matches if this URL is successfully fetched and returns a 200 HTTP status code without redirection.</string>
							<key>pfm_name</key>
							<string>URLStringProbe</string>
							<key>pfm_title</key>
							<string>URL String Probe</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Rules Element</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>On Demand Rules</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system prohibits users from disabling DNS settings. This key is only available on supervised devices.</string>
			<key>pfm_name</key>
			<string>ProhibitDisablement</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Prohibit Disablement</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_user_approved</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The UUID that points to an identity certificate payload. The system uses this identity to authenticate the user to the DNS resolver.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_ios_min</key>
			<string>16.0</string>
			<key>pfm_macos_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>PayloadCertificateUUID</string>
			<key>pfm_title</key>
			<string>Certificate UUID</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>16.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.0</string>
				</dict>
			</dict>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>DNS Settings</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>3</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>iOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>14.0</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_shared_ipad</key>
			<dict>
				<key>pfmx_device_channel</key>
				<true/>
				<key>pfmx_mode</key>
				<string>allowed</string>
				<key>pfmx_user_channel</key>
				<false/>
			</dict>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>forbidden</string>
			</dict>
		</dict>
		<key>macOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_device_channel</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>11.0</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_requires_dep</key>
			<false/>
			<key>pfmx_user_approved_mdm</key>
			<false/>
			<key>pfmx_user_channel</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>forbidden</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
