<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Finder settings</string>
	<key>pfm_domain</key>
	<string>com.apple.finder</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2022-05-04T10:39:01Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Finder settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Finder</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.finder</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.finder</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Full</string>
			<key>pfm_description</key>
			<string>Select if the standard (Full) or Simple Finder should be used</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/finder</string>
			<key>pfm_macos_deprecated</key>
			<string>11.3</string>
			<key>pfm_name</key>
			<string>InterfaceLevel</string>
			<key>pfm_range_list</key>
			<array>
				<string>Full</string>
				<string>Simple</string>
			</array>
			<key>pfm_title</key>
			<string>Finder Interface Level</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Warning message requiring user approval before emptying the Trash</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/finder</string>
			<key>pfm_name</key>
			<string>WarnOnEmptyTrash</string>
			<key>pfm_title</key>
			<string>Show Warning Before Emptying the Trash</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Prevents opening the dialog box for finding servers on the network</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/finder</string>
			<key>pfm_name</key>
			<string>ProhibitConnectTo</string>
			<key>pfm_title</key>
			<string>Disallow Connect to Server</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Prevents ejecting removable media and mountable volumes</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/finder</string>
			<key>pfm_name</key>
			<string>ProhibitEject</string>
			<key>pfm_title</key>
			<string>Disallow Eject</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<string>off</string>
								<string>authenticate</string>
							</array>
							<key>pfm_domain</key>
							<string>com.apple.DiscRecording</string>
							<key>pfm_target</key>
							<string>BurnSupport</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Prevents writing permanent information to a CD or DVD. Disc burning restrictions require both Disc Burning and Finder payloads.</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/finder</string>
			<key>pfm_name</key>
			<string>ProhibitBurn</string>
			<key>pfm_title</key>
			<string>Disallow Burn Disc</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Prevents user from opening files or folders by typing a pathname</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/finder</string>
			<key>pfm_name</key>
			<string>ProhibitGoToFolder</string>
			<key>pfm_title</key>
			<string>Disallow Go to Folder</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Show hard disks on the desktop</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/finder</string>
			<key>pfm_name</key>
			<string>ShowHardDrivesOnDesktop</string>
			<key>pfm_title</key>
			<string>Show Internal Drives on Desktop</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show external disks on the desktop</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/finder</string>
			<key>pfm_name</key>
			<string>ShowExternalHardDrivesOnDesktop</string>
			<key>pfm_title</key>
			<string>Show External Drives on Desktop</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show removable media on the desktop</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/finder</string>
			<key>pfm_name</key>
			<string>ShowRemovableMediaOnDesktop</string>
			<key>pfm_title</key>
			<string>Show Removable Media (CDs, DVDs, etc.) on Desktop</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Show connected servers on the desktop</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/finder</string>
			<key>pfm_name</key>
			<string>ShowMountedServersOnDesktop</string>
			<key>pfm_title</key>
			<string>Show Connected Servers on Desktop</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show the Recent Tags section in the Finder sidebar</string>
			<key>pfm_documentation_url</key>
			<string>https://derflounder.wordpress.com/2021/11/29/disabling-recent-tags-in-the-finder-window-sidebar/</string>
			<key>pfm_name</key>
			<string>ShowRecentTags</string>
			<key>pfm_title</key>
			<string>Show Recent Tags</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Remove items from the Trash after 30 days</string>
			<key>pfm_documentation_url</key>
			<string>https://derflounder.wordpress.com/2016/10/30/enabling-the-remove-items-from-the-trash-after-30-days-setting-on-macos-sierra/</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>FXRemoveOldTrashItems</string>
			<key>pfm_title</key>
			<string>Remove Old Trash Items</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Finder</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>4</integer>
</dict>
</plist>
