<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define settings for AirPrint.</string>
	<key>pfm_description_reference</key>
	<string>The AirPrint payload adds AirPrint printers to the userʼs AirPrint printer list. This makes it easier to support environ- ments where the printers and the devices are on different subnets. An AirPrint payload is designated by specifying com.apple.airprint as the PayloadType value.
This payload is supported on iOS 7.0 and later and on macOS 10.10 and later.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/airprint</string>
	<key>pfm_domain</key>
	<string>com.apple.airprint</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_ios_min</key>
	<string>7.0</string>
	<key>pfm_last_modified</key>
	<date>2023-08-15T08:00:00Z</date>
	<key>pfm_macos_min</key>
	<string>10.10</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures AirPrint settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>AirPrint</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.airprint</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.airprint</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile.
The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of AirPrint printers that are presented to the user.</string>
			<key>pfm_description_reference</key>
			<string>An array of AirPrint printers that should always be shown.</string>
			<key>pfm_name</key>
			<string>AirPrint</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A printer item in the printer list</string>
					<key>pfm_name</key>
					<string>Printer</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The AirPrint printer's IP address or hostname</string>
							<key>pfm_description_reference</key>
							<string>The IP Address of the AirPrint destination.</string>
							<key>pfm_name</key>
							<string>IPAddress</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>IP Address or Hostname</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>192.168.1.1</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The AirPrint printer's listening port number</string>
							<key>pfm_description_reference</key>
							<string>The listening port of the AirPrint destination. Available only in iOS 11 and later.</string>
							<key>pfm_ios_min</key>
							<string>11.0</string>
							<key>pfm_name</key>
							<string>Port</string>
							<key>pfm_platforms</key>
							<array>
								<string>iOS</string>
							</array>
							<key>pfm_range_max</key>
							<integer>65535</integer>
							<key>pfm_range_min</key>
							<integer>0</integer>
							<key>pfm_title</key>
							<string>Port</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The AirPrint printer's resource path</string>
							<key>pfm_description_reference</key>
							<string>The Resource Path associated with the printer. This corresponds to the rp parameter of the _ipps.tcp Bonjour record. For example:
• printers/Canon_MG5300_series • printers/Xerox_Phaser_7600
• ipp/print
• Epson_IPP_Printer</string>
							<key>pfm_name</key>
							<string>ResourcePath</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Resource Path</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>printers/printer_name</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<false/>
							<key>pfm_description</key>
							<string>Enable and force TLS for AirPrint connections</string>
							<key>pfm_description_reference</key>
							<string>If true AirPrint connections are secured by Transport Layer Security (TLS). Default is false. Availability: Available only in iOS 11.0 and later.</string>
							<key>pfm_ios_min</key>
							<string>11.0</string>
							<key>pfm_name</key>
							<string>ForceTLS</string>
							<key>pfm_platforms</key>
							<array>
								<string>iOS</string>
							</array>
							<key>pfm_title</key>
							<string>Force TLS</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Printer</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Air print</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>AirPrint</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>
