<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Setup Assistant settings</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/setupassistant</string>
	<key>pfm_domain</key>
	<string>com.apple.SetupAssistant.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2020-10-15T06:00:44Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
		<string>tvOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Setup Assistant settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Setup Assistant</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.SetupAssistant.managed</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.SetupAssistant.managed</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Skips the Choose Your Look window.</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/setupassistant</string>
			<key>pfm_macos_min</key>
			<string>10.14.0</string>
			<key>pfm_name</key>
			<string>SkipAppearance</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip Appearance window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Skips the Apple ID setup window.</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/setupassistant</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>SkipCloudSetup</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip iCloud</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Skips the iCloud Storage window.</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/setupassistant</string>
			<key>pfm_macos_min</key>
			<string>10.13.4</string>
			<key>pfm_name</key>
			<string>SkipiCloudStorageSetup</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip iCloud Storage window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Skips the Privacy consent window.</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/setupassistant</string>
			<key>pfm_macos_min</key>
			<string>10.13.4</string>
			<key>pfm_name</key>
			<string>SkipPrivacySetup</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip Privacy consent window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Skips the Siri setup window.</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/setupassistant</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>SkipSiriSetup</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip Siri</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Skips the True Tone Display window.</string>
			<key>pfm_description_reference</key>
			<string>Optional. If true, skip the True Tone Display window. Availability: Available in macOS 10.13.6 and later.</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/setupassistant</string>
			<key>pfm_macos_min</key>
			<string>10.13.6</string>
			<key>pfm_name</key>
			<string>SkipTrueTone</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip True Tone Display window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Skips the Screen Time window.</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/setupassistant</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>SkipScreenTime</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip Screen Time window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Skips the TouchID setup window.</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/setupassistant</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>SkipTouchIDSetup</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Skip TouchID</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>List of setup items to skip</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/skipkeys</string>
			<key>pfm_name</key>
			<string>SkipSetupItems</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
				<string>tvOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_range_list</key>
					<array>
						<string>Accessibility</string>
						<string>Android</string>
						<string>Appearance</string>
						<string>AppleID</string>
						<string>Biometric</string>
						<string>DeviceToDeviceMigration</string>
						<string>Diagnostics</string>
						<string>DisplayTone</string>
						<string>FileVault</string>
						<string>HomeButtonSensitivity</string>
						<string>iCloudDiagnostics</string>
						<string>iCloudStorage</string>
						<string>iMessageAndFaceTime</string>
						<string>Location</string>
						<string>MessagingActivationUsingPhoneNumber</string>
						<string>OnBoarding</string>
						<string>Passcode</string>
						<string>Payment</string>
						<string>Privacy</string>
						<string>Restore</string>
						<string>RestoreCompleted</string>
						<string>ScreenSaver</string>
						<string>ScreenTime</string>
						<string>SIMSetup</string>
						<string>Siri</string>
						<string>SoftwareUpdate</string>
						<string>TapToSetup</string>
						<string>TOS</string>
						<string>TVHomeScreenSync</string>
						<string>TVProviderSignIn</string>
						<string>TVRoom</string>
						<string>UpdateCompleted</string>
						<string>WatchMigration</string>
						<string>Welcome</string>
						<string>Zoom</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Accessibility: Skips the Accessibility pane, only if the Mac is connected to Ethernet and the cloud config is downloaded. Availability: macOS 11+</string>
						<string>Android: If the Restore pane is not skipped, removes the Move from Android option in the Restore pane on iOS. Availability: iOS 9.0+</string>
						<string>Appearance: Skips the Choose Your Look screen. Availability: iOS 13.0+ and macOS 10.14+</string>
						<string>Apple ID: Skips Apple ID setup. Availability: iOS 7.0+, tvOS 10.2+, and macOS 10.9+</string>
						<string>Biometric: Skips biometric setup. Availability: iOS 8.1+ and macOS 10.12.4+</string>
						<string>Device to Device Migration: Skips Device to Device Migration pane. Availability: iOS 13.0+</string>
						<string>Diagnostics: Skips the App Analytics pane. Availability: iOS 7.0+, tvOS 10.2+, and macOS 10.9+</string>
						<string>Display Tone: Skips DisplayTone setup. Availability: iOS 9.3.2+ and macOS 10.13.6+</string>
						<string>FileVault: Disables FileVault Setup Assistant screen in macOS. Availability: macOS 10.10+</string>
						<string>Home Button Sensitivity: Skips the Meet the New Home Button screen on iPhone 7, iPhone 7 Plus, iPhone 8, iPhone 8 Plus and iPhone SE. Availability: iOS 10.0+</string>
						<string>iCloud Diagnostics: Skips iCloud Analytics screen. Availability: macOS 10.12.4+</string>
						<string>iCloud Storage: Skips iCloud Documents and Desktop screen in macOS. Availability: macOS 10.13.4+</string>
						<string>iMessage and FaceTime: Skips the iMessage and FaceTime screen in iOS. Availability: iOS 12.0+</string>
						<string>Location: Disables Location Services. Availability: iOS 7.0+ and macOS 10.11+</string>
						<string>Messaging Activation Using Phone Number: Skips the iMessage pane. Availability: iOS 10.0+</string>
						<string>OnBoarding: Skips on-boarding informational screens for user education (e.g. Go Home, Cover Sheet, Multitasking and Control Center) in iOS. Availability: iOS 11.0 - 13.6</string>
						<string>Passcode: Hides and disables the passcode pane. Availability: iOS 7.0+</string>
						<string>Payment: Skips Apple Pay setup. Availability: iOS 8.1+ and macOS 10.12.4+</string>
						<string>Privacy: Skips the privacy pane. Availability: iOS 11.13+, tvOS 11.13+, and macOS 10.13.4+</string>
						<string>Restore: Disables restoring from backup. Availability: iOS 7.0+ and macOS 10.9+</string>
						<string>Restore Completed: Skips the Restore Completed pane. Availability: iOS 14.0+</string>
						<string>ScreenSaver: Skips the tvOS screen about using aerial screensavers in ATV. Availability: tvOS 10.2+</string>
						<string>ScreenTime: Skips the Screen Time pane. Availability: iOS 12.0+ and macOS 10.15+</string>
						<string>SIM Setup: Skips the add cellular plan pane. Availability: iOS 12.0+</string>
						<string>Siri: Disables Siri. Availability: iOS 7.0+, tvOS 10.2+, and macOS 10.12+</string>
						<string>Software Update: Skips the mandatory software update screen in iOS. Availability: iOS 12.0+</string>
						<string>Tap To Setup: Skips the Tap To Set Up option in AppleTV about using an iOS device to set up your AppleTV. Availability: tvOS 10.2+</string>
						<string>Terms of Service: Skips Terms and Conditions. Availability: iOS 7.0+, tvOS 10.2+, and macOS 10.9+</string>
						<string>TVHomeScreenSync: Skips TV home screen layout sync screen. Availability: tvOS 11.0+</string>
						<string>TVProviderSignIn: Skips the TV provider sign in screen. Availability: tvOS 11.0+</string>
						<string>TVRoom: Skips the “Where is this Apple TV?” screen in tvOS. Availability: tvOS 11.4+</string>
						<string>Update Completed: Skips the Software Update Complete pane. Availability: iOS 14.0+</string>
						<string>Watch Migration: Skips the screen for watch migration. Availability: iOS 11.0+</string>
						<string>Welcome: Skips the Get Started pane. Availability: iOS 13.0+</string>
						<string>Zoom: Skips zoom setup. Availability: iOS 8.3+</string>
					</array>
					<key>pfm_title</key>
					<string>Items to Skip</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_unique</key>
					<true/>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Additional Skip Items</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Setup Assistant</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>7</integer>
</dict>
</plist>
