<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Parental Controls: Time Limit settings</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/parentalcontrolstimelimits</string>
	<key>pfm_domain</key>
	<string>com.apple.familycontrols.timelimits.v2</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2023-11-30T15:08:23Z</date>
	<key>pfm_macos_min</key>
	<string>10.7</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Parental Controls: Time Limit settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Parental Controls: Time Limits</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.familycontrols.timelimits.v2</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.familycontrols.timelimits.v2</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If 'true', enables time limits.</string>
			<key>pfm_name</key>
			<string>familyControlsEnabled</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Enable Time Limits</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The time limits to enforce if 'familyControlsEnabled' is enabled.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>familyControlsEnabled</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>time-limits</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The weekday allowance settings.</string>
					<key>pfm_name</key>
					<string>weekday-allowance</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>If 'true', enable these settings.</string>
							<key>pfm_name</key>
							<string>enabled</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Enable Weekday Allowance</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The allowance for that day, in seconds.</string>
							<key>pfm_exclude</key>
							<array>
								<dict>
									<key>pfm_target_conditions</key>
									<array>
										<dict>
											<key>pfm_n_range_list</key>
											<array>
												<true/>
											</array>
											<key>pfm_target</key>
											<string>time-limits.weekday-allowance.enabled</string>
										</dict>
									</array>
								</dict>
							</array>
							<key>pfm_name</key>
							<string>secondsPerDay</string>
							<key>pfm_title</key>
							<string>Allowance Seconds per Day</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>The type of day range:
0 = Weekday
1 = Weekend</string>
							<key>pfm_exclude</key>
							<array>
								<dict>
									<key>pfm_target_conditions</key>
									<array>
										<dict>
											<key>pfm_n_range_list</key>
											<array>
												<true/>
											</array>
											<key>pfm_target</key>
											<string>time-limits.weekday-allowance.enabled</string>
										</dict>
									</array>
								</dict>
							</array>
							<key>pfm_name</key>
							<string>rangeType</string>
							<key>pfm_range_list</key>
							<array>
								<integer>0</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Weekday</string>
							</array>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Range Type</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Weekday Allowance</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The weekday curfew settings.</string>
					<key>pfm_name</key>
					<string>weekday-curfew</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>If 'true', enable these settings.</string>
							<key>pfm_name</key>
							<string>enabled</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Enable Weekday Curfew</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The curfew start time, in the format '%d:%d:%d'.</string>
							<key>pfm_exclude</key>
							<array>
								<dict>
									<key>pfm_target_conditions</key>
									<array>
										<dict>
											<key>pfm_n_range_list</key>
											<array>
												<true/>
											</array>
											<key>pfm_target</key>
											<string>time-limits.weekday-curfew.enabled</string>
										</dict>
									</array>
								</dict>
							</array>
							<key>pfm_name</key>
							<string>start</string>
							<key>pfm_title</key>
							<string>Curfew Start Time</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The curfew end time, in the format '%d:%d:%d'.</string>
							<key>pfm_exclude</key>
							<array>
								<dict>
									<key>pfm_target_conditions</key>
									<array>
										<dict>
											<key>pfm_n_range_list</key>
											<array>
												<true/>
											</array>
											<key>pfm_target</key>
											<string>time-limits.weekday-curfew.enabled</string>
										</dict>
									</array>
								</dict>
							</array>
							<key>pfm_name</key>
							<string>end</string>
							<key>pfm_title</key>
							<string>Curfew End Time</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>The type of day range:
0 = Weekday
1 = Weekend</string>
							<key>pfm_exclude</key>
							<array>
								<dict>
									<key>pfm_target_conditions</key>
									<array>
										<dict>
											<key>pfm_n_range_list</key>
											<array>
												<true/>
											</array>
											<key>pfm_target</key>
											<string>time-limits.weekday-curfew.enabled</string>
										</dict>
									</array>
								</dict>
							</array>
							<key>pfm_name</key>
							<string>rangeType</string>
							<key>pfm_range_list</key>
							<array>
								<integer>0</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Weekday</string>
							</array>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Range Type</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Weekday Curfew</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The weekend allowance settings.</string>
					<key>pfm_name</key>
					<string>weekend-allowance</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>If 'true', enable these settings.</string>
							<key>pfm_name</key>
							<string>enabled</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Enable Weekend Allowance</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The allowance for that day, in seconds.</string>
							<key>pfm_exclude</key>
							<array>
								<dict>
									<key>pfm_target_conditions</key>
									<array>
										<dict>
											<key>pfm_n_range_list</key>
											<array>
												<true/>
											</array>
											<key>pfm_target</key>
											<string>time-limits.weekend-allowance.enabled</string>
										</dict>
									</array>
								</dict>
							</array>
							<key>pfm_name</key>
							<string>secondsPerDay</string>
							<key>pfm_title</key>
							<string>Allowance Seconds per Day</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>1</integer>
							<key>pfm_description</key>
							<string>The type of day range:
0 = Weekday
1 = Weekend</string>
							<key>pfm_exclude</key>
							<array>
								<dict>
									<key>pfm_target_conditions</key>
									<array>
										<dict>
											<key>pfm_n_range_list</key>
											<array>
												<true/>
											</array>
											<key>pfm_target</key>
											<string>time-limits.weekend-allowance.enabled</string>
										</dict>
									</array>
								</dict>
							</array>
							<key>pfm_name</key>
							<string>rangeType</string>
							<key>pfm_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Weekend</string>
							</array>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Range Type</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Weekend Allowance</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The weekend curfew settings.</string>
					<key>pfm_name</key>
					<string>weekend-curfew</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>If 'true', enable these settings.</string>
							<key>pfm_name</key>
							<string>enabled</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Enable Weekend Curfew</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The curfew start time, in the format '%d:%d:%d'.</string>
							<key>pfm_exclude</key>
							<array>
								<dict>
									<key>pfm_target_conditions</key>
									<array>
										<dict>
											<key>pfm_n_range_list</key>
											<array>
												<true/>
											</array>
											<key>pfm_target</key>
											<string>time-limits.weekend-curfew.enabled</string>
										</dict>
									</array>
								</dict>
							</array>
							<key>pfm_name</key>
							<string>start</string>
							<key>pfm_title</key>
							<string>Curfew Start Time</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The curfew end time, in the format '%d:%d:%d'.</string>
							<key>pfm_exclude</key>
							<array>
								<dict>
									<key>pfm_target_conditions</key>
									<array>
										<dict>
											<key>pfm_n_range_list</key>
											<array>
												<true/>
											</array>
											<key>pfm_target</key>
											<string>time-limits.weekend-curfew.enabled</string>
										</dict>
									</array>
								</dict>
							</array>
							<key>pfm_name</key>
							<string>end</string>
							<key>pfm_title</key>
							<string>Curfew End Time</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>1</integer>
							<key>pfm_description</key>
							<string>The type of day range:
0 = Weekday
1 = Weekend</string>
							<key>pfm_exclude</key>
							<array>
								<dict>
									<key>pfm_target_conditions</key>
									<array>
										<dict>
											<key>pfm_n_range_list</key>
											<array>
												<true/>
											</array>
											<key>pfm_target</key>
											<string>time-limits.weekend-curfew.enabled</string>
										</dict>
									</array>
								</dict>
							</array>
							<key>pfm_name</key>
							<string>rangeType</string>
							<key>pfm_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Weekend</string>
							</array>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Range Type</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Weekend Curfew</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Time Limits</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Parental Controls: Time Limits</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
