<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define general settings</string>
	<key>pfm_domain</key>
	<string>Configuration</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2023-08-15T08:00:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
		<string>tvOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable name for the profile. This value is displayed on the Detail screen. It doesn't have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The description of the profile, shown on the Detail screen for the profile. This description should be detailed enough to help the user decide whether to install the profile.</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provided the profile.</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The reverse-DNS style identifier ('com.example.myprofile', for example) that identifies the profile. This string is used to determine whether a new profile should replace an existing one or should be added.</string>
			<key>pfm_hidden</key>
			<string>all</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The globally unique identifier for the profile. The actual content is unimportant. In macOS, you can use 'uuidgen' to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_hidden</key>
			<string>all</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If present and set to 'true', the user can't delete the profile (unless the profile has a removal password and the user provides it).
On macOS, as of 10.15, this key only affects removal of manually installed profiles. If set to 'true' and no profile removal payload is present, removing the profile requires admin auth.
On macOS versions prior to 10.15, this key would prevent admins from removing MDM installed profiles but as of macOS 10.15, users can never remove MDM profiles, not even the admin.
Requires a supervised device.</string>
			<key>pfm_name</key>
			<string>PayloadRemovalDisallowed</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Prevent users from removing this profile</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The date when the profile is automatically removed.</string>
			<key>pfm_name</key>
			<string>RemovalDate</string>
			<key>pfm_title</key>
			<string>Removal Date</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The number of seconds until the profile is automatically removed. If the 'RemovalDate' key is present, whichever field yields the earliest date is used.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>RemovalDate</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>DurationUntilRemoval</string>
			<key>pfm_title</key>
			<string>Duration Until Removal</string>
			<key>pfm_type</key>
			<string>real</string>
			<key>pfm_type_input</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>Seconds</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A dictionary containing a key that consists of the IETF BCP 47 identifier for a language (for example, en or jp) and a value consisting of the agreement localized to that language. The agreement is displayed in a dialog, and the user must agree before installing the profile.

The dictionary can also contain an optional key, 'default', with its value consisting of the unlocalized (usually in en) agreement.

The system chooses a localized version in the order of preference specified by the user (macOS) or based on the user's current language setting (iOS). If no exact match is found, the default localization is used. If there is no default localization, the en localization is used. If there is no en localization, the first available localization is used.

Provide a default value, if possible. No warning is displayed if the user's locale doesn't match any localization in the 'ConsentText' dictionary.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A dictionary containing these keys and values:
• For each language in which a consent or license agreement is available, a key consisting of the IETF BCP 47 identifier for that language (for example, en or jp) and a value consisting of the agreement localized to that language. The agreement is displayed in a dialog to which the user must agree before installing the profile.
• The optional key default with its value consisting of the unlocalized agreement (usually in en).
The system chooses a localized version in the order of preference specified by the user (macOS) or based on the user's current language setting (iOS). If no exact match is found, the default localization is used. If there is no default localization, the en localization is used. If there is no en localization, then the first available localization is used.
You should provide a default value if possible. No warning will be displayed if the user's locale does not match any localization in the ConsentText dictionary.</string>
			<key>pfm_name</key>
			<string>ConsentText</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The IETF BCP 47 identifier for that language (for example, en or jp).</string>
					<key>pfm_name</key>
					<string>{{key}}</string>
					<key>pfm_title</key>
					<string>Language ID</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>en</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The agreement localized to that language.</string>
					<key>pfm_name</key>
					<string>{{value}}</string>
					<key>pfm_title</key>
					<string>Localized License Agreement</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The system chooses a localized version in the order of preference specified by the user (macOS) or based on the user's current language setting (iOS). If no exact match is found, the default localization is used. If there is no default localization, the en localization is used. If there is no en localization, then the first available localization is used.</string>
					<key>pfm_name</key>
					<string>default</string>
					<key>pfm_title</key>
					<string>Default License Agreement</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Consent Text</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Configuration</string>
			<key>pfm_description</key>
			<string>The type of payload. The only supported value is 'Configuration'.</string>
			<key>pfm_hidden</key>
			<string>all</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version number of the profile format. This number represents the version of the configuration profile as a whole, not of the individual profiles within it. The value should be 1.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the profile format. This describes the version of the configuration profile as a whole, not of the individual profiles within it.
Currently, this value should be 1.</string>
			<key>pfm_hidden</key>
			<string>all</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Set to 'true' if there is a removal passcode.</string>
			<key>pfm_hidden</key>
			<string>all</string>
			<key>pfm_name</key>
			<string>HasRemovalPasscode</string>
			<key>pfm_title</key>
			<string>Has removal passcode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The date when a profile is no longer valid and an update button is presented to the user.</string>
			<key>pfm_hidden</key>
			<string>all</string>
			<key>pfm_name</key>
			<string>PayloadExpirationDate</string>
			<key>pfm_title</key>
			<string>Expiration Date</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>General</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>7</integer>
</dict>
</plist>
