<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Google Software Update Settings</string>
	<key>pfm_documentation_url</key>
	<string>https://support.google.com/chrome/a/answer/7591084</string>
	<key>pfm_domain</key>
	<string>com.google.Keystone</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2020-04-16T20:11:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Google Software Update preferences</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Google Software Update Preferences</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.google.Keystone</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier.</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.google.Keystone</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload. (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile.
The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>updatePolicies</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Configure Global Google update settings</string>
					<key>pfm_name</key>
					<string>global</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>Enable auto-updates &amp; installs = Turns on auto-updates. Updates are always applied when detected by Google Software Update.
Install updates at scheduled update checks = Manual update checks will not install updates.
Turn off updates = Stops Google Software Update automatically updating all users to the latest stable version of Google apps. Updates are only applied when the user manually checks for updates.
Updates never applied = Never update Google apps</string>
							<key>pfm_documentation_url</key>
							<string>https://support.google.com/chrome/a/answer/7591084?hl=en#updatepolicysettings</string>
							<key>pfm_name</key>
							<string>UpdateDefault</string>
							<key>pfm_range_list</key>
							<array>
								<integer>0</integer>
								<integer>1</integer>
								<integer>2</integer>
								<integer>3</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Enable auto-updates &amp; installs</string>
								<string>Install updates at scheduled update checks</string>
								<string>Turn off updates</string>
								<string>Updates never applied</string>
							</array>
							<key>pfm_title</key>
							<string>Global Google Update</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The time in 24-hour clock format, that auto-updates start. Use a value between 0 - midnight - and 23.</string>
							<key>pfm_documentation_url</key>
							<string>https://support.google.com/chrome/a/answer/7591084?hl=en#updatepolicysettings</string>
							<key>pfm_name</key>
							<string>UpdatesSupressedStartHour</string>
							<key>pfm_range_max</key>
							<integer>23</integer>
							<key>pfm_range_min</key>
							<integer>0</integer>
							<key>pfm_title</key>
							<string>Global Google Update Schedule - Start Hour</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_value_unit</key>
							<string>hour</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The minute, within the starting hour, that auto-updates start. Use a value between 0 and 59.</string>
							<key>pfm_documentation_url</key>
							<string>https://support.google.com/chrome/a/answer/7591084?hl=en#updatepolicysettings</string>
							<key>pfm_name</key>
							<string>UpdatesSupressedStartMinute</string>
							<key>pfm_range_max</key>
							<integer>59</integer>
							<key>pfm_range_min</key>
							<integer>0</integer>
							<key>pfm_title</key>
							<string>Global Google Update Schedule - Start Minute</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_value_unit</key>
							<string>minute</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The length of time, in minutes, that auto-updates can be made. If you set this value to 0, the system behaves as if no update window is specified.</string>
							<key>pfm_documentation_url</key>
							<string>https://support.google.com/chrome/a/answer/7591084?hl=en#updatepolicysettings</string>
							<key>pfm_name</key>
							<string>UpdatesSupressedDurationMin</string>
							<key>pfm_title</key>
							<string>Global Google Update Schedule - Duration</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_value_unit</key>
							<string>minutes</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Even if you turn off automatic updates for Chrome Browser, browser components won't automatically stop updating, including Adobe Flash, Widevine DRM - for encrypted media -, and the Chrome updater recovery component.</string>
							<key>pfm_documentation_url</key>
							<string>https://www.chromium.org/administrators/policy-list-3#ComponentUpdatesEnabled</string>
							<key>pfm_name</key>
							<string>ComponentUpdatesEnabled</string>
							<key>pfm_title</key>
							<string>Enable Global Component Updates</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>This preference is referenced in an example property list in the documentation, but is not discussed. So it exists, but what it manages and the possible string values are not known.</string>
							<key>pfm_name</key>
							<string>DownloadPreference</string>
							<key>pfm_range_list</key>
							<array>
								<string>cacheable</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Cacheable Downloads</string>
							</array>
							<key>pfm_title</key>
							<string>Global Download Preference</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Global Google Update settings</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Configure Chrome update settings</string>
					<key>pfm_name</key>
					<string>com.google.Chrome</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>Enable auto-updates &amp; installs = Turns on auto-updates. Chrome updates are always applied when detected by Google Software Update.
Install updates at scheduled update checks = Manual update checks will not install updates.
Turn off updates = Stops Google Software Update automatically updating all users to the latest stable version of Chrome. Updates are only applied when the user manually checks for updates.
Updates never applied = Never update Chrome</string>
							<key>pfm_documentation_url</key>
							<string>https://support.google.com/chrome/a/answer/7591084?hl=en#updatepolicysettings</string>
							<key>pfm_name</key>
							<string>UpdateDefault</string>
							<key>pfm_range_list</key>
							<array>
								<integer>0</integer>
								<integer>1</integer>
								<integer>2</integer>
								<integer>3</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Enable auto-updates &amp; installs</string>
								<string>Install updates at scheduled update checks</string>
								<string>Turn off updates</string>
								<string>Updates never applied</string>
							</array>
							<key>pfm_title</key>
							<string>Chrome Update</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Pin an application to a single version. This stops your devices from updating to versions of the app beyond the number you specify. This should be done only temporarily, such as while testing a new version.</string>
							<key>pfm_format</key>
							<string>^[\d]+\.$</string>
							<key>pfm_name</key>
							<string>TargetVersionPrefix</string>
							<key>pfm_title</key>
							<string>Chrome Update Version Pin</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>71.</string>
							<key>pfm_value_unit</key>
							<string>major version</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Chrome Update settings</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Configure Drive File Stream update settings</string>
					<key>pfm_name</key>
					<string>com.google.drivefs</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>Enable auto-updates &amp; installs = Turns on auto-updates. FileStream updates are always applied when detected by Google Software Update.
Install updates at scheduled update checks = Manual update checks will not install updates.
Turn off updates = Stops Google Software Update automatically updating all users to the latest stable version of FileStream. Updates are only applied when the user manually checks for updates.
Updates never applied = Never update FileStream</string>
							<key>pfm_documentation_url</key>
							<string>https://support.google.com/chrome/a/answer/7591084?hl=en#updatepolicysettings</string>
							<key>pfm_name</key>
							<string>UpdateDefault</string>
							<key>pfm_range_list</key>
							<array>
								<integer>0</integer>
								<integer>1</integer>
								<integer>2</integer>
								<integer>3</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Enable auto-updates &amp; installs</string>
								<string>Install updates at scheduled update checks</string>
								<string>Turn off updates</string>
								<string>Updates never applied</string>
							</array>
							<key>pfm_title</key>
							<string>Drive File Stream Update</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Pin an application to a single version. This stops your devices from updating to versions of the app beyond the number you specify. This should be done only temporarily, such as while testing a new version.</string>
							<key>pfm_format</key>
							<string>^[\d]+\.$</string>
							<key>pfm_name</key>
							<string>TargetVersionPrefix</string>
							<key>pfm_title</key>
							<string>Drive File Stream Update Version Pin</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>29.</string>
							<key>pfm_value_unit</key>
							<string>major version</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Drive File Stream Update settings</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Configure Chat update settings</string>
					<key>pfm_name</key>
					<string>com.google.chat</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>Enable auto-updates &amp; installs = Turns on auto-updates. Chat updates are always applied when detected by Google Software Update.
Install updates at scheduled update checks = Manual update checks will not install updates.
Turn off updates = Stops Google Software Update automatically updating all users to the latest stable version of Chat. Updates are only applied when the user manually checks for updates.
Updates never applied = Never update Chat</string>
							<key>pfm_documentation_url</key>
							<string>https://support.google.com/chrome/a/answer/7591084?hl=en#updatepolicysettings</string>
							<key>pfm_name</key>
							<string>UpdateDefault</string>
							<key>pfm_range_list</key>
							<array>
								<integer>0</integer>
								<integer>1</integer>
								<integer>2</integer>
								<integer>3</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Enable auto-updates &amp; installs</string>
								<string>Install updates at scheduled update checks</string>
								<string>Turn off updates</string>
								<string>Updates never applied</string>
							</array>
							<key>pfm_title</key>
							<string>Chat Update</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Pin an application to a single version. This stops your devices from updating to versions of the app beyond the number you specify. This should be done only temporarily, such as while testing a new version.</string>
							<key>pfm_format</key>
							<string>^[\d]+\.$</string>
							<key>pfm_name</key>
							<string>TargetVersionPrefix</string>
							<key>pfm_title</key>
							<string>Chat Update Version Pin</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>18.</string>
							<key>pfm_value_unit</key>
							<string>major version</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Chat Update settings</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Configure Backup &amp; Sync update settings</string>
					<key>pfm_name</key>
					<string>com.google.GoogleDrive</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>Enable auto-updates &amp; installs = Turns on auto-updates. Backup &amp; Sync updates are always applied when detected by Google Software Update.
Install updates at scheduled update checks = Manual update checks will not install updates.
Turn off updates = Stops Google Software Update automatically updating all users to the latest stable version of Backup &amp; Sync. Updates are only applied when the user manually checks for updates.
Updates never applied = Never update Backup &amp; Sync</string>
							<key>pfm_documentation_url</key>
							<string>https://support.google.com/chrome/a/answer/7591084?hl=en#updatepolicysettings</string>
							<key>pfm_name</key>
							<string>UpdateDefault</string>
							<key>pfm_range_list</key>
							<array>
								<integer>0</integer>
								<integer>1</integer>
								<integer>2</integer>
								<integer>3</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Enable auto-updates &amp; installs</string>
								<string>Install updates at scheduled update checks</string>
								<string>Turn off updates</string>
								<string>Updates never applied</string>
							</array>
							<key>pfm_title</key>
							<string>Backup &amp; Sync Update</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Pin an application to a single version. This stops your devices from updating to versions of the app beyond the number you specify. This should be done only temporarily, such as while testing a new version.</string>
							<key>pfm_format</key>
							<string>^[\d]+\.$</string>
							<key>pfm_name</key>
							<string>TargetVersionPrefix</string>
							<key>pfm_title</key>
							<string>Backup &amp; Sync Update Version Pin</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>3.</string>
							<key>pfm_value_unit</key>
							<string>major version</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Backup &amp; Sync Update settings</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Google Software Updates</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>