<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://github.com/SecondSonConsulting/Baseline/releases</string>
	<key>pfm_description</key>
	<string>Baseline by Second Son Consulting Configuration</string>
	<key>pfm_documentation_url</key>
	<string>https://github.com/SecondSonConsulting/Baseline/wiki</string>
	<key>pfm_domain</key>
	<string>com.secondsonconsulting.baseline</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2024-03-03T00:00:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Baseline configuration preferences</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Baseline</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.secondsonconsulting.baseline</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.secondsonconsulting.baseline</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Define scripts that are run immediately as the user logs in.</string>
			<key>pfm_name</key>
			<string>InitialScripts</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The name you want to appear in the SwiftDialog menu as this script is run.</string>
							<key>pfm_name</key>
							<string>DisplayName</string>
							<key>pfm_title</key>
							<string>Display Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>A path to the script you want to run. Can be a local file path or a URL.</string>
							<key>pfm_name</key>
							<string>ScriptPath</string>
							<key>pfm_title</key>
							<string>Script Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The expected MD5 of the script being run.</string>
							<key>pfm_name</key>
							<string>MD5</string>
							<key>pfm_title</key>
							<string>MD5</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Arguments you want to pass to the script when it is run.</string>
							<key>pfm_name</key>
							<string>Arguments</string>
							<key>pfm_title</key>
							<string>Arguments</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>InitialScripts</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Define Installomator labels to be run by Baseline.</string>
			<key>pfm_name</key>
			<string>Installomator</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The name you want to appear in the SwiftDialog menu as this Installomator label is processed.</string>
							<key>pfm_name</key>
							<string>DisplayName</string>
							<key>pfm_title</key>
							<string>Display Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The Installomator label.</string>
							<key>pfm_name</key>
							<string>Label</string>
							<key>pfm_title</key>
							<string>Label</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Arguments you want to pass to the Installomator command for this label.</string>
							<key>pfm_name</key>
							<string>Arguments</string>
							<key>pfm_title</key>
							<string>Arguments</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The icon you want to appear in the SwiftDialog menu as this Installomator label is processed. Can be a URL or local file path.</string>
							<key>pfm_name</key>
							<string>Icon</string>
							<key>pfm_title</key>
							<string>Icon</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The subtitle text to appear on this line item.</string>
							<key>pfm_name</key>
							<string>Subtitle</string>
							<key>pfm_title</key>
							<string>Subtitle</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Installomator Labels</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Define Packages to be run by Baseline</string>
			<key>pfm_name</key>
			<string>Packages</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The name you want to appear in the SwiftDialog menu as this package is installed.</string>
							<key>pfm_name</key>
							<string>DisplayName</string>
							<key>pfm_title</key>
							<string>Display Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>A path to the package you want to install. Can be a local file path or a URL.</string>
							<key>pfm_name</key>
							<string>PackagePath</string>
							<key>pfm_title</key>
							<string>Package Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The expected TeamID of the package being installed.</string>
							<key>pfm_name</key>
							<string>TeamID</string>
							<key>pfm_title</key>
							<string>TeamID</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The expected MD5 of the package being installed.</string>
							<key>pfm_name</key>
							<string>MD5</string>
							<key>pfm_title</key>
							<string>MD5</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Arguments you want to pass to the installer command for this package.</string>
							<key>pfm_name</key>
							<string>Arguments</string>
							<key>pfm_title</key>
							<string>Arguments</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The icon you want to appear in the SwiftDialog menu as this package is installed. Can be a URL or local file path.</string>
							<key>pfm_name</key>
							<string>Icon</string>
							<key>pfm_title</key>
							<string>Icon</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The subtitle text to appear on this line item.</string>
							<key>pfm_name</key>
							<string>Subtitle</string>
							<key>pfm_title</key>
							<string>Subtitle</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Packages</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Define Scripts to be run by Baseline</string>
			<key>pfm_name</key>
			<string>Scripts</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The name you want to appear in the SwiftDialog menu as this script is run.</string>
							<key>pfm_name</key>
							<string>DisplayName</string>
							<key>pfm_title</key>
							<string>Display Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>A path to the script you want to run. Can be a local file path or a URL.</string>
							<key>pfm_name</key>
							<string>ScriptPath</string>
							<key>pfm_title</key>
							<string>Script Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The expected MD5 of the script being run.</string>
							<key>pfm_name</key>
							<string>MD5</string>
							<key>pfm_title</key>
							<string>MD5</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Arguments you want to pass to the script when it is run.</string>
							<key>pfm_name</key>
							<string>Arguments</string>
							<key>pfm_title</key>
							<string>Arguments</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The icon you want to appear in the SwiftDialog menu as this script is run. Can be a URL or local file path.</string>
							<key>pfm_name</key>
							<string>Icon</string>
							<key>pfm_title</key>
							<string>Icon</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The subtitle text to appear on this line item.</string>
							<key>pfm_name</key>
							<string>Subtitle</string>
							<key>pfm_title</key>
							<string>Subtitle</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Scripts</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>This setting controls whether Baseline forces a restart after completion.</string>
			<key>pfm_name</key>
			<string>Restart</string>
			<key>pfm_title</key>
			<string>Force Restart</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>This setting controls whether Baseline forces a restart after completion.</string>
			<key>pfm_name</key>
			<string>LogOut</string>
			<key>pfm_title</key>
			<string>Force Log Out</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>This setting controls whether Baseline uses the SwiftDialog --blurscreen feature. Default is true. If you set to false, consider using --ontop in your DialogListOptions key</string>
			<key>pfm_name</key>
			<string>BlurScreen</string>
			<key>pfm_title</key>
			<string>Blur Screen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>This setting controls whether Baseline displays a progress bar.</string>
			<key>pfm_name</key>
			<string>ProgressBar</string>
			<key>pfm_title</key>
			<string>Show Progress Bar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>This setting controls whether Baseline displays the current item being processed under the progress bar.</string>
			<key>pfm_name</key>
			<string>ProgressBarDisplayNames</string>
			<key>pfm_title</key>
			<string>Show Display Names on Progress Bar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>This setting controls whether Baseline deletes it's install directory after use: /usr/local/Baseline.</string>
			<key>pfm_name</key>
			<string>CleanupAfterUse</string>
			<key>pfm_title</key>
			<string>Cleanup After Use</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This setting controls whether Baseline will reinstall SwiftDialog as the final step before completion. Default behavior if this key is omitted will reinstall SwiftDialog if a custom PNG is found in /Library/Application Support/Dialog/Dialog.png.</string>
			<key>pfm_name</key>
			<string>ReinstallDialog</string>
			<key>pfm_title</key>
			<string>Reinstall SwiftDialog</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Tell Installomator to use it's built in SwiftDialog integration for the List View.</string>
			<key>pfm_name</key>
			<string>InstallomatorSwiftDialogIntegration</string>
			<key>pfm_title</key>
			<string>Use Installomator SwiftDialog Integration</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>By default, Baseline uses "NOTIFY=silent" and "BLOCKING_PROCESS_ACTION=kill" Installomator options. Setting this to True means Baseline will not use those options.</string>
			<key>pfm_name</key>
			<string>IgnoreDefaultInstallomatorOptions</string>
			<key>pfm_title</key>
			<string>Ignore Default Installomator Options</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>This setting enables SwiftDialog "Button 1" (the OK button) on the Baseline List View. This allows users to dismiss the list view and continue working while Baseline runs. By default this button is disabled.</string>
			<key>pfm_name</key>
			<string>Button1Enabled</string>
			<key>pfm_title</key>
			<string>Button 1 Enabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>SwiftDialog options for the primary Baseline progress list window.</string>
			<key>pfm_name</key>
			<string>DialogListOptions</string>
			<key>pfm_title</key>
			<string>Dialog List Window Options</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>SwiftDialog options for the Success Dialog window.</string>
			<key>pfm_name</key>
			<string>DialogSuccessOptions</string>
			<key>pfm_title</key>
			<string>Dialog Success Window Options</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>SwiftDialog options for the Failure Dialog window.</string>
			<key>pfm_name</key>
			<string>DialogFailureOptions</string>
			<key>pfm_title</key>
			<string>Dialog Failure Window Options</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Define a file or folder path. If this file or folder exists, Baseline will exit quietly without processing any items.</string>
			<key>pfm_name</key>
			<string>ExitCondition</string>
			<key>pfm_title</key>
			<string>Exit Condition</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Define a file path. If this file exists at any point while Baseline is running, Baseline will exit and will not process additional items.</string>
			<key>pfm_name</key>
			<string>BailOutFile</string>
			<key>pfm_title</key>
			<string>Bail Out File</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Baseline by Second Son Consulting</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>3</integer>
</dict>
</plist>
