<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://github.com/mpanighetti/install-or-defer/releases</string>
	<key>pfm_description</key>
	<string>Install or Defer settings</string>
	<key>pfm_documentation_url</key>
	<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
	<key>pfm_domain</key>
	<string>com.github.mpanighetti.install-or-defer</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2022-06-24T22:27:00Z</date>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Install or Defer preferences.</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Install or Defer</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.github.mpanighetti.install-or-defer</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.github.mpanighetti.install-or-defer</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<string>Install</string>
			<key>pfm_description</key>
			<string>The label of the install button.</string>
			<key>pfm_description_reference</key>
			<string>The label of the install button. Defaults to "Install". Keep this string short since jamfHelper will cut off longer button labels.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>InstallButtonLabel</string>
			<key>pfm_note</key>
			<string>Keep this string short since jamfHelper will cut off longer button labels.</string>
			<key>pfm_title</key>
			<string>Install Button Label</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Install</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<string>Defer</string>
			<key>pfm_description</key>
			<string>The label of the defer button.</string>
			<key>pfm_description_reference</key>
			<string>The label of the defer button. Defaults to "Defer". Keep this string short since jamfHelper will cut off longer button labels.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>DeferButtonLabel</string>
			<key>pfm_note</key>
			<string>Keep this string short since jamfHelper will cut off longer button labels.</string>
			<key>pfm_title</key>
			<string>Defer Button Label</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Defer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0.4</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Whether to suppress the persistent alert to run updates.</string>
			<key>pfm_description_reference</key>
			<string>Whether to suppress the persistent alert to run updates. Defaults to False. If set to True, clicking the install button will only launch the Software Update pane without displaying a persistent alert to upgrade, until the deadline date is reached.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>DisablePostInstallAlert</string>
			<key>pfm_title</key>
			<string>Disable Post-Install Alert</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_description</key>
			<string>File path to a logo that will be used in messaging.</string>
			<key>pfm_description_reference</key>
			<string>File path to a logo that will be used in messaging. Defaults to the Software Update icon. Recommend 512px, PNG format.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>MessagingLogo</string>
			<key>pfm_note</key>
			<string>Recommend 512px, PNG format.</string>
			<key>pfm_title</key>
			<string>Messaging Logo</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<string>IT</string>
			<key>pfm_description</key>
			<string>Contact information for technical support included in messaging alerts.</string>
			<key>pfm_description_reference</key>
			<string>Contact information for technical support included in messaging alerts. Defaults to "IT". Recommend using a team name (e.g. "Technical Support"), email address (e.g. "support@contoso.com"), or chat channel (e.g. "#technical-support").</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>SupportContact</string>
			<key>pfm_note</key>
			<string>Recommend using a team name (e.g. "Technical Support"), email address (e.g. "support@contoso.com"), or chat channel (e.g. "#technical-support").</string>
			<key>pfm_title</key>
			<string>Support Contact</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0.5</string>
			<key>pfm_default</key>
			<integer>14400</integer>
			<key>pfm_description</key>
			<string>Number of seconds between when the user clicks "Defer" and the next prompt appears.</string>
			<key>pfm_description_reference</key>
			<string>Number of seconds between when the user clicks "Defer" and the next prompt appears. Defaults to 14400 (4 hours). This value must be less than the MaxDeferralTime value.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>DeferralPeriod</string>
			<key>pfm_note</key>
			<string>This value must be less than the MaxDeferralTime value.</string>
			<key>pfm_title</key>
			<string>Deferral Period</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0.5</string>
			<key>pfm_default</key>
			<integer>300</integer>
			<key>pfm_description</key>
			<string>Number of seconds to wait between attempting a soft restart and forcing a restart.</string>
			<key>pfm_description_reference</key>
			<string>Number of seconds to wait between attempting a soft restart and forcing a restart. Defaults to 300 (5 minutes).</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>HardRestartDelay</string>
			<key>pfm_title</key>
			<string>Hard Restart Delay</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.2</string>
			<key>pfm_default</key>
			<integer>259200</integer>
			<key>pfm_description</key>
			<string>Number of seconds between the first script run and the updates being enforced.</string>
			<key>pfm_description_reference</key>
			<string>Number of seconds between the first script run and the updates being enforced. Defaults to 259200 (3 days).</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>MaxDeferralTime</string>
			<key>pfm_title</key>
			<string>Maximum Deferral Time</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0.5</string>
			<key>pfm_default</key>
			<integer>3600</integer>
			<key>pfm_description</key>
			<string>Number of seconds to wait before timing out the Install or Defer prompt.</string>
			<key>pfm_description_reference</key>
			<string>Number of seconds to wait before timing out the Install or Defer prompt. Defaults to 3600 (1 hour). This value must be less than the DeferralPeriod value.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>PromptTimeout</string>
			<key>pfm_note</key>
			<string>This value must be less than the DeferralPeriod value.</string>
			<key>pfm_title</key>
			<string>Prompt Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.2</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Whether to bypass deferral time entirely and skip straight to update enforcement.</string>
			<key>pfm_description_reference</key>
			<string>Whether to bypass deferral time entirely and skip straight to update enforcement (useful for script testing purposes). Defaults to false.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>SkipDeferral</string>
			<key>pfm_title</key>
			<string>Skip Deferral</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0.5</string>
			<key>pfm_default</key>
			<integer>600</integer>
			<key>pfm_description</key>
			<string>Number of seconds to wait between displaying the "install updates" message and applying updates, then attempting a soft restart.</string>
			<key>pfm_description_reference</key>
			<string>Number of seconds to wait between displaying the "install updates" message and applying updates, then attempting a soft restart. Defaults to 600 (10 minutes).</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>UpdateDelay</string>
			<key>pfm_note</key>
			<string>This value must be less than the DeferralPeriod value.</string>
			<key>pfm_title</key>
			<string>Update Delay</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_description</key>
			<string>The hour that a workday starts in your organization.</string>
			<key>pfm_description_reference</key>
			<string>The hour that a workday starts in your organization. This value must be an integer between 0 and 22, and the end hour must be later than the start hour. If the update deadline falls within this window of time, it will be moved forward to occur at the end of the workday.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>WorkdayStartHour</string>
			<key>pfm_note</key>
			<string>If the update deadline falls within this window of time, it will be moved forward to occur at the end of the workday.</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
				<integer>4</integer>
				<integer>5</integer>
				<integer>6</integer>
				<integer>7</integer>
				<integer>8</integer>
				<integer>9</integer>
				<integer>10</integer>
				<integer>11</integer>
				<integer>12</integer>
				<integer>13</integer>
				<integer>14</integer>
				<integer>15</integer>
				<integer>16</integer>
				<integer>17</integer>
				<integer>18</integer>
				<integer>19</integer>
				<integer>20</integer>
				<integer>21</integer>
				<integer>22</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>12:00 AM</string>
				<string>1:00 AM</string>
				<string>2:00 AM</string>
				<string>3:00 AM</string>
				<string>4:00 AM</string>
				<string>5:00 AM</string>
				<string>6:00 AM</string>
				<string>7:00 AM</string>
				<string>8:00 AM</string>
				<string>9:00 AM</string>
				<string>10:00 AM</string>
				<string>11:00 AM</string>
				<string>12:00 PM</string>
				<string>1:00 PM</string>
				<string>2:00 PM</string>
				<string>3:00 PM</string>
				<string>4:00 PM</string>
				<string>5:00 PM</string>
				<string>6:00 PM</string>
				<string>7:00 PM</string>
				<string>8:00 PM</string>
				<string>9:00 PM</string>
				<string>10:00 PM</string>
			</array>
			<key>pfm_title</key>
			<string>Workday Start Hour</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_description</key>
			<string>The hour that a workday ends in your organization.</string>
			<key>pfm_description_reference</key>
			<string>The hour that a workday ends in your organization. This value must be an integer between 1 and 23, and the end hour must be later than the start hour. If the update deadline falls within this window of time, it will be moved forward to occur at the end of the workday.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>WorkdayEndHour</string>
			<key>pfm_note</key>
			<string>If the update deadline falls within this window of time, it will be moved forward to occur at the end of the workday.</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
				<integer>4</integer>
				<integer>5</integer>
				<integer>6</integer>
				<integer>7</integer>
				<integer>8</integer>
				<integer>9</integer>
				<integer>10</integer>
				<integer>11</integer>
				<integer>12</integer>
				<integer>13</integer>
				<integer>14</integer>
				<integer>15</integer>
				<integer>16</integer>
				<integer>17</integer>
				<integer>18</integer>
				<integer>19</integer>
				<integer>20</integer>
				<integer>21</integer>
				<integer>22</integer>
				<integer>23</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>1:00 AM</string>
				<string>2:00 AM</string>
				<string>3:00 AM</string>
				<string>4:00 AM</string>
				<string>5:00 AM</string>
				<string>6:00 AM</string>
				<string>7:00 AM</string>
				<string>8:00 AM</string>
				<string>9:00 AM</string>
				<string>10:00 AM</string>
				<string>11:00 AM</string>
				<string>12:00 PM</string>
				<string>1:00 PM</string>
				<string>2:00 PM</string>
				<string>3:00 PM</string>
				<string>4:00 PM</string>
				<string>5:00 PM</string>
				<string>6:00 PM</string>
				<string>7:00 PM</string>
				<string>8:00 PM</string>
				<string>9:00 PM</string>
				<string>10:00 PM</string>
				<string>11:00 PM</string>
			</array>
			<key>pfm_title</key>
			<string>Workday End Hour</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Whether to write to a persistent log file at /var/log/install-or-defer.log.</string>
			<key>pfm_description_reference</key>
			<string>Whether to write to a persistent log file at /var/log/install-or-defer.log. If undefined or set to false, the script writes all output to the system log for live diagnostics.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>DiagnosticLog</string>
			<key>pfm_title</key>
			<string>Enable Diagnostic Log</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>5.0.3</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Whether to prompt users to run updates manually via System Preferences.</string>
			<key>pfm_description_reference</key>
			<string>Whether to prompt users to run updates manually via System Preferences. This is always the behavior on Apple Silicon Macs and cannot be overridden. If undefined or set to false on Intel Macs, the script triggers updates via scripted softwareupdate commands.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mpanighetti/install-or-defer#configuration-profile</string>
			<key>pfm_name</key>
			<string>ManualUpdates</string>
			<key>pfm_title</key>
			<string>Manual Updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Install or Defer</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>
