<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/download-warp</string>
	<key>pfm_description</key>
	<string>Use this section to define settings for Cloudflare WARP</string>
	<key>pfm_documentation_url</key>
	<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/</string>
	<key>pfm_domain</key>
	<string>com.cloudflare.warp</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2024-06-27T11:02:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
		<string>iOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configure Cloudflare WARP Client settings</string>
			<key>pfm_description</key>
			<string>Settings to configure Cloudflare WARP Client using your MDM solution</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Cloudflare WARP Client</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.cloudflare.warp</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.cloudflare.warp</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2024.1.160.0</string>
			<key>pfm_description</key>
			<string>When WARP is deployed with multiple organizations or configurations, this parameter is used to identify each configuration in the GUI.</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#display_name</string>
			<key>pfm_name</key>
			<string>display_name</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Required for full Cloudflare Zero Trust features. Instructs the client to register the device with your organization. Registration requires authentication via an IdP or Service Auth.</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#organization</string>
			<key>pfm_name</key>
			<string>organization</string>
			<key>pfm_title</key>
			<string>Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Instructs the client to direct all DNS queries to a specific Gateway DNS location. This value is only necessary if deploying without a team name or in an organization with multiple DNS locations. If you do not supply a DoH subdomain, we will automatically use the default Gateway DNS location for your organization.</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#gateway_unique_id</string>
			<key>pfm_name</key>
			<string>gateway_unique_id</string>
			<key>pfm_title</key>
			<string>Gateway Unique ID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.5.294.0</string>
			<key>pfm_default</key>
			<string>warp</string>
			<key>pfm_description</key>
			<string>Allows you to choose the operational mode of the client.</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#service_mode</string>
			<key>pfm_name</key>
			<string>service_mode</string>
			<key>pfm_range_list</key>
			<array>
				<string>1dot1</string>
				<string>warp</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>DoH Only</string>
				<string>WARP</string>
			</array>
			<key>pfm_title</key>
			<string>Service Mode</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Controls the visibility of the onboarding screens that ask the user to review the privacy policy during an application's first launch.</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#onboarding</string>
			<key>pfm_name</key>
			<string>onboarding</string>
			<key>pfm_title</key>
			<string>Onboarding</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.4.106</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Allows the user to turn off the WARP switch and disconnect the client.</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#switch_locked</string>
			<key>pfm_name</key>
			<string>switch_locked</string>
			<key>pfm_title</key>
			<string>Switch Locked</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.4.106</string>
			<key>pfm_description</key>
			<string>If switch has been turned off by user, the client will automatically turn itself back on after the specified number of minutes. We recommend keeping this set to a very low value - usually just enough time for a user to log in to hotel or airport Wi-Fi. If any value is specified for auto_connect the default state of the WARP client will always be Connected (for example, after the initial install or a reboot).</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#auto_connect</string>
			<key>pfm_name</key>
			<string>auto_connect</string>
			<key>pfm_range_max</key>
			<integer>1440</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Auto Connect</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>When the WARP client is deployed via MDM, the in-app Send Feedback button is disabled by default. This parameter allows you to re-enable the button and direct feedback towards your organization.</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#support_url</string>
			<key>pfm_format</key>
			<string>^(https://|mailto:).*$</string>
			<key>pfm_name</key>
			<string>support_url</string>
			<key>pfm_title</key>
			<string>Support URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Overrides the IP address used by the WARP client to communicate with the client orchestration API. If you set this parameter, be sure to update your organization's firewall to ensure the new IP is allowed through.</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#override_api_endpoint</string>
			<key>pfm_name</key>
			<string>override_api_endpoint</string>
			<key>pfm_title</key>
			<string>Override API Endpoint</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Overrides the IP address used by the WARP client to resolve DNS queries via DNS over HTTPS (DoH). If you set this parameter, be sure to update your organization's firewall to ensure the new IP is allowed through.</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#override_doh_endpoint</string>
			<key>pfm_name</key>
			<string>override_doh_endpoint</string>
			<key>pfm_title</key>
			<string>Override DoH Endpoint</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Overrides the IP address and UDP port used by the WARP client to send traffic to Cloudflare's edge. If you set this parameter, be sure to update your organization's firewall to ensure the new IP is allowed through.</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#override_warp_endpoint</string>
			<key>pfm_name</key>
			<string>override_warp_endpoint</string>
			<key>pfm_title</key>
			<string>Override WARP Endpoint</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Assigns a unique identifier to the device for the device UUID posture check.</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#unique_client_id</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>unique_client_id</string>
			<key>pfm_title</key>
			<string>Unique Client ID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enrolls the device in your Zero Trust organization using a service token. Requires the auth_client_secret parameter.</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#auth_client_id</string>
			<key>pfm_name</key>
			<string>auth_client_id</string>
			<key>pfm_title</key>
			<string>Auth Client ID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enrolls the device in your Zero Trust organization using a service token. Requires the auth_client_id parameter.</string>
			<key>pfm_documentation_url</key>
			<string>https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/parameters/#auth_client_secret</string>
			<key>pfm_name</key>
			<string>auth_client_secret</string>
			<key>pfm_title</key>
			<string>Auth Client Secret</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Cloudflare WARP Client</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
