<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://www.jamf.com/products/jamf-connect/</string>
	<key>pfm_description</key>
	<string>Jamf Connect Shares settings</string>
	<key>pfm_documentation_url</key>
	<string>https://docs.jamf.com/jamf-connect/1.0.0/sync/administrator-guide/File_Shares.html</string>
	<key>pfm_domain</key>
	<string>com.jamf.connect.shares</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-08-15T08:00:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Jamf Connect Shares</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.jamf.connect.shares</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.jamf.connect.shares</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Required.</string>
			<key>pfm_hidden</key>
			<string>all</string>
			<key>pfm_name</key>
			<string>Version</string>
			<key>pfm_range_list</key>
			<array>
				<string>1</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Jamf Connect Shares PLIST Version</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Configures Jamf Connect Shares settings</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Home Mount</string>
				<string>Shares</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Home Mount</key>
				<array>
					<string>HomeMount</string>
				</array>
				<key>Shares</key>
				<array>
					<string>Shares</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1.0</string>
			<key>pfm_description</key>
			<string>This is a dictionary of attributes for scenarios where the user's home profile should be mounted.</string>
			<key>pfm_description_reference</key>
			<string>Determines if a user's home profile should be mounted. This is written as a dictionary of keys including the Groups and Options keys.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jamf.com/jamf-connect/1.6.1/administrator-guide/Configuring_File_Shares_with_Jamf_Connect_Sync.html</string>
			<key>pfm_name</key>
			<string>HomeMount</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.0</string>
					<key>pfm_description</key>
					<string>Mount the user's home automatically or not.</string>
					<key>pfm_description_reference</key>
					<string>If set to true, will automount the user's home</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.jamf.com/jamf-connect/1.6.1/administrator-guide/Configuring_File_Shares_with_Jamf_Connect_Sync.html</string>
					<key>pfm_name</key>
					<string>Mount</string>
					<key>pfm_title</key>
					<string>Auto Mount Home</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.0</string>
					<key>pfm_description</key>
					<string>Specifies which active directory group members should have their home profile mounted.</string>
					<key>pfm_description_reference</key>
					<string>Specifies which active directory group members should have their home profile mounted</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.jamf.com/jamf-connect/1.6.1/administrator-guide/Configuring_File_Shares_with_Jamf_Connect_Sync.html</string>
					<key>pfm_name</key>
					<string>Groups</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Name of group in AD.</string>
							<key>pfm_name</key>
							<string>ADGroup</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>AD Group Name</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.0</string>
					<key>pfm_description</key>
					<string>Array of optional mount options. See the Options table in the documentation linked below for more information.</string>
					<key>pfm_description_reference</key>
					<string>The following options can be written as an array of strings with the Options key.
					MNT_RDONLY = Mounts the share as read only
					MNT_SYNCHRONOUS = Specifies that all input and outputs to the file system should be synchronized on the system
					MNT_NOEXEC = Prohibits code executions from the share</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.jamf.com/jamf-connect/1.6.1/administrator-guide/Configuring_File_Shares_with_Jamf_Connect_Sync.html</string>
					<key>pfm_name</key>
					<string>Options</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MountOption</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>Mount Option</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Home Mount</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1.0</string>
			<key>pfm_description</key>
			<string>Array of dictionaries of each share and their settings.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jamf.com/jamf-connect/1.6.1/administrator-guide/Configuring_File_Shares_with_Jamf_Connect_Sync.html</string>
			<key>pfm_name</key>
			<string>Shares</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Dictionary of shares and their settings.</string>
					<key>pfm_description_reference</key>
					<string>Determines a mount point and its associated attributes. This is written as an array of dictionaries.</string>
					<key>pfm_name</key>
					<string>ShareDict</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Name as it will appear in the Jamf Connect menu item.</string>
							<key>pfm_description_reference</key>
							<string>Specifies the name of the share displayed as a menu item in Jamf Connect</string>
							<key>pfm_name</key>
							<string>Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The actual URL of the mount point in the form of "smb://dc1.example.com/Homes".

For the URLs, you can use variable substitution to allow for custom mounts without having to create even more XML. Jamf Connect understands &lt;&lt;domain&gt;&gt;, &lt;&lt;fullname&gt;&gt;, &lt;&lt;serial&gt;&gt;, &lt;&lt;shortname&gt;&gt;, &lt;&lt;upn&gt;&gt; and &lt;&lt;email&gt;&gt;</string>
							<key>pfm_description_reference</key>
							<string>Specifies the URL of the mount point</string>
							<key>pfm_name</key>
							<string>URL</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>smb://example.com/path/to/share</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>An array of AD groups allowed to mount the share.</string>
							<key>pfm_description_reference</key>
							<string>Specifies which active directory group members should have their home profile mounted.</string>
							<key>pfm_name</key>
							<string>Groups</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>Group</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Optional local mount point.</string>
							<key>pfm_description_reference</key>
							<string>Specifies a local mount point</string>
							<key>pfm_name</key>
							<string>LocalMount</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>If enabled, the share is automatically mounted.</string>
							<key>pfm_description_reference</key>
							<string>If set to true, the share is automatically mounted</string>
							<key>pfm_name</key>
							<string>AutoMount</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>If enabled, the share is only mounted when the computer is connected to the active directory domain.</string>
							<key>pfm_description_reference</key>
							<string>If set to true, the share is only mounted when the computer is connected to the active directory domain.</string>
							<key>pfm_name</key>
							<string>ConnectedOnly</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Array of optional mount options. See the Options table in the documentation linked below for more information.</string>
							<key>pfm_name</key>
							<string>Options</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>MountOption</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
	</array>
	<key>pfm_title</key>
	<string>Jamf Connect Shares</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
