<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://itunes.apple.com/us/app/microsoft-remote-desktop-10/id1295203466</string>
	<key>pfm_description</key>
	<string>Microsoft Remote Desktop settings</string>
	<key>pfm_domain</key>
	<string>com.microsoft.rdc.macos</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2019-09-17T08:52:31Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Microsoft Remote Desktop settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Microsoft Remote Desktop</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.rdc.macos</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.rdc.macos</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>10.2.2</string>
			<key>pfm_description</key>
			<string>Disable the first run dialog "Help us make your experience better".</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.slack.com/archives/C8J5E5VPW/p1530676449000004</string>
			<key>pfm_name</key>
			<string>ClientSettings.FirstRunExperienceLaunchedVersion</string>
			<key>pfm_range_list</key>
			<array>
				<string>1</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Disable</string>
			</array>
			<key>pfm_title</key>
			<string>Disable First Run Dialog</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>10.2.7</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Disable upload of telemetry data.</string>
			<key>pfm_description_reference</key>
			<string>We also added a new key to the UserDefaults that allows you to control whether you want to send telemetry to us: ClientSettings.DisableTelemetryUpload (true/false). When this key is set, the "Help improve Remote Desktop" control will be disabled for the user.</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.slack.com/archives/C8J5E5VPW/p1549656233101800</string>
			<key>pfm_name</key>
			<string>ClientSettings.DisableTelemetryUpload</string>
			<key>pfm_title</key>
			<string>Disable Telemetry Upload</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>10.2.2</string>
			<key>pfm_description</key>
			<string>Support for all possible values of the "EnableCredSspSupport" and "Authentication Level" RDP file settings if this key is set to 0.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/windows-server/remote/remote-desktop-services/clients/mac-whatsnew#updates-for-version-1022</string>
			<key>pfm_name</key>
			<string>ClientSettings.EnforceCredSSPSupport</string>
			<key>pfm_range_list</key>
			<array>
				<string>0</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>0</string>
			</array>
			<key>pfm_title</key>
			<string>Enforce Cred SSP Support</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Microsoft Remote Desktop</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>5</integer>
</dict>
</plist>
