<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://software.alectrona.com/patch/releases/alectrona-patch-latest.pkg</string>
	<key>pfm_description</key>
	<string>Settings for Patch Agent</string>
	<key>pfm_documentation_url</key>
	<string>https://patchdocs.alectrona.com/docs/patch-agent/#patch-agent-preferences</string>
	<key>pfm_domain</key>
	<string>com.alectrona.patch-agent</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-11-30T15:08:23Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Alectrona Patch Agent configuration preferences</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Alectrona Patch Agent</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.alectrona.patch-agent</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.alectrona.patch-agent</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The software titles to automatically install or update (even if they are not currently installed) using the Patch Agent.</string>
			<key>pfm_documentation_url</key>
			<string>https://patchdocs.alectrona.com/docs/patch-agent/#patch-agent-preferences/</string>
			<key>pfm_name</key>
			<string>InstallOrUpdate</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Install Or Update</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The software titles to automatically update if installed and out-of-date using the Patch Agent.</string>
			<key>pfm_documentation_url</key>
			<string>https://patchdocs.alectrona.com/docs/patch-agent/#patch-agent-preferences/</string>
			<key>pfm_name</key>
			<string>UpdateOnly</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Update Only</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The software titles to enable the Active Intervals feature for even when not included in the InstallOrUpdate or UpdateOnly preference keys. These software titles might be updated using the patch command line tool in scripted workflows external to the Patch Agent.</string>
			<key>pfm_documentation_url</key>
			<string>https://patchdocs.alectrona.com/docs/patch-agent/#patch-agent-preferences/</string>
			<key>pfm_name</key>
			<string>OtherManagedSoftware</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Other Managed Software</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Patch Agent runs every 4 hours by default. You can adjust this interval time for your environment. Note: This key is configured in seconds. The minimum setting is 600 seconds (10 minutes) and there is currently no maximum.</string>
			<key>pfm_documentation_url</key>
			<string>https://patchdocs.alectrona.com/docs/patch-agent/#patch-agent-preferences/</string>
			<key>pfm_name</key>
			<string>RunInterval</string>
			<key>pfm_range_min</key>
			<integer>600</integer>
			<key>pfm_title</key>
			<string>Run Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>When Alectrona Patch runs for the first time, it performs what is called a "Patch Agent Run" where it runs all configured installs/updates. You can skip the first Patch Agent Run by setting this key to true.</string>
			<key>pfm_documentation_url</key>
			<string>https://patchdocs.alectrona.com/docs/patch-agent/#patch-agent-preferences/</string>
			<key>pfm_name</key>
			<string>SkipFirstPatchAgentRun</string>
			<key>pfm_title</key>
			<string>Skip First Patch Agent Run</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Patch Agent will attempt to silently update any recently deferred app that exists in the InstallOrUpdate or UpdateOnly keys immediately after that app has been terminated by the user (even during an interval period). You can disable this behavior by setting to false.</string>
			<key>pfm_documentation_url</key>
			<string>https://patchdocs.alectrona.com/docs/patch-agent/#patch-agent-preferences/</string>
			<key>pfm_name</key>
			<string>ActiveIntervals</string>
			<key>pfm_title</key>
			<string>Active Intervals</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set to true to remove the symlink located at /usr/local/bin/patch. This will remove patch from the user's $PATH and allows for accessing the built-in BSD patch command (opens new window)without using it's full path. Note: When setting this key to true you will need to access the Patch CLT at it's full path (opens new window)in Terminal or custom scripts.</string>
			<key>pfm_description_reference</key>
			<string>test</string>
			<key>pfm_documentation_url</key>
			<string>https://patchdocs.alectrona.com/docs/patch-agent/#patch-agent-preferences/</string>
			<key>pfm_name</key>
			<string>RemovePatchSymlink</string>
			<key>pfm_title</key>
			<string>Remove Patch Symlink</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set to true to perform a Jamf Pro inventory update after a software title is installed or updated using the Patch Agent.</string>
			<key>pfm_documentation_url</key>
			<string>https://patchdocs.alectrona.com/docs/patch-agent/#patch-agent-preferences/</string>
			<key>pfm_name</key>
			<string>ReconAfterInstall</string>
			<key>pfm_title</key>
			<string>Recon After Installs</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If an app is running when an update occurs, setting this key to true will suppress the update dialog and automatically perform a deferral.</string>
			<key>pfm_documentation_url</key>
			<string>https://patchdocs.alectrona.com/docs/patch-agent/#patch-agent-preferences/</string>
			<key>pfm_name</key>
			<string>DeferIfRunning</string>
			<key>pfm_title</key>
			<string>Defer If Running</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set to true to attempt to update and convert Mac App Store (MAS) apps to their non-MAS counterpart.</string>
			<key>pfm_documentation_url</key>
			<string>https://patchdocs.alectrona.com/docs/patch-agent/#patch-agent-preferences/</string>
			<key>pfm_name</key>
			<string>UpdateMAS</string>
			<key>pfm_title</key>
			<string>Update Mac App Store apps</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Alectrona Patch Agent</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
