<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_app_url</key>
		<string>https://endnote.com</string>
		<key>pfm_description</key>
		<string>EndNote settings</string>
		<key>pfm_domain</key>
		<string>com.ThomsonResearchSoft.EndNote</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_last_modified</key>
		<date>2019-09-17T08:52:30Z</date>
		<key>pfm_subkeys</key>
		<array>
			<dict>
				<key>pfm_default</key>
				<string>Configures EndNote settings</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>EndNote</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>com.ThomsonResearchSoft.EndNote</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>com.ThomsonResearchSoft.EndNote</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string/>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_app_max</key>
				<string>8.2</string>
				<key>pfm_app_min</key>
				<string>7.2</string>
				<key>pfm_description</key>
				<string>Set to 1 to accept EndNote X7.2 and X8 EULA and hide the dialog from users.</string>
				<key>pfm_description_reference</key>
				<string>Correct value is 1 or 0. For some reason, the developer decided to set these with a string value instead of a boolean.</string>
				<key>pfm_default</key>
				<string>0</string>
				<key>pfm_documentation_url</key>
				<string>https://derflounder.wordpress.com/2017/06/29/activating-endnote-x8-using-management-profiles/</string>
				<key>pfm_name</key>
				<string>AcceptedENX7.2EULA</string>
				<key>pfm_range_list</key>
				<array>
					<string>1</string>
					<string>0</string>
				</array>
				<key>pfm_range_list_titles</key>
				<array>
					<string>1: Accept and Suppress Dialog</string>
					<string>0: Show Dialog to Users</string>
				</array>
				<key>pfm_title</key>
				<string>Accept EndNote X7.2 / X8 EULA</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>9</string>
				<key>pfm_description</key>
				<string>Set to 1 to accept EndNote X9 EULA and hide the dialog from users.</string>
				<key>pfm_description_reference</key>
				<string>Correct value is 1 or 0. For some reason, the developer decided to set these with a string value instead of a boolean.</string>
				<key>pfm_default</key>
				<string>0</string>
				<key>pfm_name</key>
				<string>AcceptedENX9EULA</string>
				<key>pfm_range_list</key>
				<array>
					<string>1</string>
					<string>0</string>
				</array>
				<key>pfm_range_list_titles</key>
				<array>
					<string>1: Accept and Suppress Dialog</string>
					<string>0: Show Dialog to Users</string>
				</array>
				<key>pfm_title</key>
				<string>Accept EndNote X9 EULA</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Set to 0 to disable EndNote Getting Started prompts.</string>
				<key>pfm_description_reference</key>
				<string>Correct value is 1 or 0. For some reason, the developer decided to set these with a string value instead of a boolean.</string>
				<key>pfm_default</key>
				<string>1</string>
				<key>pfm_name</key>
				<string>ShowGettingStartedX9</string>
				<key>pfm_range_list</key>
				<array>
					<string>0</string>
					<string>1</string>
				</array>
				<key>pfm_range_list_titles</key>
				<array>
					<string>0: Hide Getting Started</string>
					<string>1: Show Getting Started</string>
				</array>
				<key>pfm_title</key>
				<string>Show Getting Started</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Suppress "Important Update" messaging at first run. Correct value is the whole version number, e.g. 2019.7.24.0. Mulitple versions can be specified.</string>
				<key>pfm_name</key>
				<string>IgnoredVersions</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>Version</string>
						<key>pfm_type</key>
						<string>string</string>
						<key>pfm_value_placeholder</key>
						<string>2019.7.24.0</string>
					</dict>
				</array>
				<key>pfm_title</key>
				<string>Suppress "Important Update" Messages</string>
				<key>pfm_type</key>
				<string>array</string>
			</dict>
		</array>
		<key>pfm_targets</key>
		<array>
			<string>system</string>
			<string>user</string>
		</array>
		<key>pfm_title</key>
		<string>EndNote</string>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_version</key>
		<integer>2</integer>
	</dict>
</plist>
