<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>pfm_app_url</key>
        <string>https://github.com/Jigsaw24/Elevate24/tree/main</string>
        <key>pfm_documentation_url</key>
        <string>https://github.com/Jigsaw24/Elevate24/tree/main</string>
        <key>pfm_targets</key>
        <array>
            <string>system</string>
        </array>
        <key>pfm_platforms</key>
        <array>
            <string>macOS</string>
        </array>

        <key>pfm_description</key>
        <string>macOS privilege access management tool from Jigsaw24</string>

        <key>pfm_domain</key>
        <string>com.jigsaw24.Elevate24</string>

        <key>pfm_format_version</key>
        <integer>6</integer>

        <key>pfm_last_modified</key>
        <date>2024-06-07T08:58:48Z</date>

        <key>pfm_icon</key>
        <data>iVBORw0KGgoAAAANSUhEUgAAAEAAAABACAYAAACqaXHeAAAAAXNSR0IArs4c6QAAAJBlWElmTU0AKgAAAAgABgEGAAMAAAABAAIAAAESAAMAAAABAAEAAAEaAAUAAAABAAAAVgEbAAUAAAABAAAAXgEoAAMAAAABAAIAAIdpAAQAAAABAAAAZgAAAAAAAACQAAAAAQAAAJAAAAABAAOgAQADAAAAAQABAACgAgAEAAAAAQAAAECgAwAEAAAAAQAAAEAAAAAAHAkeAQAAAAlwSFlzAAAWJQAAFiUBSVIk8AAAA0ppVFh0WE1MOmNvbS5hZG9iZS54bXAAAAAAADx4OnhtcG1ldGEgeG1sbnM6eD0iYWRvYmU6bnM6bWV0YS8iIHg6eG1wdGs9IlhNUCBDb3JlIDYuMC4wIj4KICAgPHJkZjpSREYgeG1sbnM6cmRmPSJodHRwOi8vd3d3LnczLm9yZy8xOTk5LzAyLzIyLXJkZi1zeW50YXgtbnMjIj4KICAgICAgPHJkZjpEZXNjcmlwdGlvbiByZGY6YWJvdXQ9IiIKICAgICAgICAgICAgeG1sbnM6dGlmZj0iaHR0cDovL25zLmFkb2JlLmNvbS90aWZmLzEuMC8iCiAgICAgICAgICAgIHhtbG5zOmV4aWY9Imh0dHA6Ly9ucy5hZG9iZS5jb20vZXhpZi8xLjAvIj4KICAgICAgICAgPHRpZmY6Q29tcHJlc3Npb24+MTwvdGlmZjpDb21wcmVzc2lvbj4KICAgICAgICAgPHRpZmY6UmVzb2x1dGlvblVuaXQ+MjwvdGlmZjpSZXNvbHV0aW9uVW5pdD4KICAgICAgICAgPHRpZmY6WFJlc29sdXRpb24+MTQ0PC90aWZmOlhSZXNvbHV0aW9uPgogICAgICAgICA8dGlmZjpZUmVzb2x1dGlvbj4xNDQ8L3RpZmY6WVJlc29sdXRpb24+CiAgICAgICAgIDx0aWZmOk9yaWVudGF0aW9uPjE8L3RpZmY6T3JpZW50YXRpb24+CiAgICAgICAgIDx0aWZmOlBob3RvbWV0cmljSW50ZXJwcmV0YXRpb24+MjwvdGlmZjpQaG90b21ldHJpY0ludGVycHJldGF0aW9uPgogICAgICAgICA8ZXhpZjpQaXhlbFhEaW1lbnNpb24+MTAyNDwvZXhpZjpQaXhlbFhEaW1lbnNpb24+CiAgICAgICAgIDxleGlmOkNvbG9yU3BhY2U+MTwvZXhpZjpDb2xvclNwYWNlPgogICAgICAgICA8ZXhpZjpQaXhlbFlEaW1lbnNpb24+MTAyNDwvZXhpZjpQaXhlbFlEaW1lbnNpb24+CiAgICAgIDwvcmRmOkRlc2NyaXB0aW9uPgogICA8L3JkZjpSREY+CjwveDp4bXBtZXRhPgpQr8ccAAAO2ElEQVR4AeVcCXSU1RX+ZslkIWxhSVhFQJawGAwECYTEEEDbgqhwaA9gtYpQUWsVtW5dsMeqKK24HItoj6eiVGi1SGUJIQQIAWWTrRrIgiSUQAKEGJLM2vu9ycNJmMnMJBN6pBf//PP/89599373vvveu++NhhkzZphWrVrlSEtL62B1OJ50wTAFQF+XC2GASz5qMugP35M7ZafM7rvBAIc8HJfHDUaX4/nc3NyTorNZaTVm/Phh8sWmsLCwrg6HA06n83uiZHBiGo1GGE0m2G22GgHmlrxt23IMiRkZ7S111nyTyUTl61wuV5jBYDAGx/p7U5qWtQkQ4WJkq8FhHmC01NmeqLd8nXwZfhUrTyvRsOEup7PObA6zuEz23xnhck2h29PyLPH/QBIVLA6HnapOMcPg6i3KQyx/RaKcUZoxmozSHq/6JqV9p8spsUfuVyb+GERnRscYs0RKs/tz69k+PDwcZrMEH7sD1RcvovJsFc5dqEJF1UWldKe2UejYri06yNWmTRTCzGYFhNVmA72zlUgNEQIAgWDX4D00RMvyovAmibxbsrYLewm8QuPT0hE/aiA6d+qEqKhIGagMuFhzERUVZ1FUfFzKbrokxNCERHTt0ll5R10dQ1TIyUAPCCnXyIgI0HIXqr5Fu7bR6r548e9x4+gk9OjRAx1jYhAVGQkJvJe6AD3QJnVqampw/vx5lJSU4ODBQ9iYmYmP//F3Jd+41HSpY0ZtXW1I5TWMSRlfLSBEiYnoAs1CgwpYRCGzuO7mzI3oO3AIRiYMR2FxMSrF1XflbkXHjh2DFpyAHD12DJkCxMJHfyX1bUhNz2DAFpCtlwAMmrFHhRaP9xQmuk0bnCw7o5R/4cWXsHNbNu6cMwu7d+WhbXQUamvdVqsfbTyab/iRvHgxEPIeKZ4yfNgwPPrII+IVRVj62mvI2bwJ/84vQJuoKFWmIYfgn1oEAPs5ld+0YT2Sk0bi8OEjeOLxx9ClS5dL0dzpkLlHfbTnTOxS5Pciq44dupwnGOw+Dz7wAPLz8zHth5OQtXEDIsMjVAxhueaSxIDgiQ3S3RngqPzy5e9g9pzZCLdY3IFPpptaKDWsNVNADQgl1MPjddddhzffeAMpKSniZXMwMmkMwsItEsJlKA9eFRX+g6pGxRjAHGLZnM1ZyM7Oxj33/EwpTyEvt3DzreMpmJrHC+Bsg+DPmT0bsqDBidISOCSANncQC7oLsHGO53nbdmDv3n1IS0tT1iYwFLK1iW2wLQKRnJyM99/7Cz7fuQMR4n3NcbSgJKZ16fZ523Kwd9/nGDEiQQni6aqtDQD5e3pZTP3oQlBMMsMMlgKuwQY4frvdfgtGJLiVvxJWb0opu13N6ZUhKirOCQjfxZ+m6unvAgKAyutoz4CXlpaq3PB/rTyV0N7Aqfb4sckoLz8rXmoSQAKLPQEBYLGEofhEKX56192YI9G+NYlg8wqWsrfmYcH98zFz+u3I3boFFnNYQHExIADMJjOOHTmIx2WMt0iw8R7tgxXZS3lRXMeToEGwVaNdu3a4b+69irHTKUv8ALzALwAREeFqhvfKkiWIHzy41VxfKSxBdq3M/ffv2a2AINDBUHV1Nbp3747XXn8duRKoI2QV6s+Z/ALg7kvhmH7HHUqWoC0TgAbaow4f+BIL75iOD+4eJUvmCjWsSvYmAA4Ni9x+223qRY0svf0h0CQAXMfnZG3FCy8+h969e7eK9Qkog+n5c+fwyt3TMC+lB0ZIYN+x9HnVhw3ynT8ltPo6KNMLXn31VTU/4Oy0KS9oEgAOKYAVkydNVG20hvV1FH/3Ty8jZm8x4mPCcX1iPCKkyx34dHWz283IyKiv615YqQcvf3wCQDQrzp7F1FtvA+ffJC2sFz7NeqX7eObaNfhi0fNInhqPHuYTaO/8Bn2n9cWpX87AyfyvQC8Itiv069cPsueBowVFavLmS0CfADDa7//ic0yamCFpqjbK/UMJAJUnyEUFx/DmlFsxMaM3ehmPo4MsbMKMDkQYanHNEODAormoqf7WDUJTvuyhIZfd7L6TJ0/Gf04UqxSbr6o+AeCUlzR8+DB1D6X7635fKwmPpY89hKT+QP9oB7pEOGExSkyQ0cDoPIMOnSR1dmQ79r77upIh0NWelnWY5BI06Xf6Wd99AmCvT0b26tVLlw35fcXbb8H68TpcP3QgYsNOI0I2qupTB3K3wGgrRLeEeFifeBJf50iuUL4MpCtoT2UOgcTMki/yCgAtwOwtE5g6laWZ+mIU6Hs95O3K3Y71v3gEqdNGoKelCu0i42Ayx8BgigHU1RFGcxzCXNXoM70/ip6eiLMnSwKKB1rWDh06ICNjIsorZEjVyDYS1DsAsqpiLq/vtX1UWop1NNNG9YN61K7/jeQKnx6XghvjgLgz+xBdeRLOihOwlZfA2uA6AfuZ4zBfOIbYSiDvmbmovVitQGhybKuXKkIStP369UXh0a99LtXN3jTgpgXz9p0kdc3kR6hI98NTJ0uRetdMxF/bG+0MVtiNBjilg/vq46wXeWMYIk6fxrcyQYqIkqAcgFAcxjt37qxK0oCy93Kpi+nqPgAwqE0Llbf34TqaQTB3PVFJSh4LXqRAFNFtDNIf5O7PIwkay0QJWCRf4HoFgBWcatzwVY0lmk96/A+WA8GiUv6U9+Trz35eASB6nSSdfVECoUbSk2lLPpOf9oTm8iEPf6RBYjAn+arjAwCn2qvjTJA7NpwUhYK08kxt7969WwXYQL2BoFmtVkyYMEH160DqsUxFebkS3e3Rl2vhFQBW5EZlUVGxGkMJAIXXqF7OJrA32grc/po1a1ZglRqVOnXqVKM3vh+5IVNQUIie1/RROQxR4LLCPgBwqV3aHNmopLDt27d3R6vL61/GsKkXtCJBSEpKwl/ff1+ltm++5Qcy56iRbiHMG3s2X0l5TsXX/WuteM0exMbG+k3IaKArKytlW20jbhg5SqXITO4TQQ1E9DoPYAluUZO4UUnixkMo6cczZ2Lu3Puwft065Vm1dTbUSXfzvGrrrLDInJ7KL3/nHSQm3qAA8RdDNAClpaVK5KhI2fr0QT4B0H3swMGDqmpL3V+3Tz7kzf2F3/zm1/LahZpatwcYxAs8r8jICHwlq7l7BShuhARKWtZDhw6pKnwmX2/kEwBucQ8dkShb1JvUaEAmGllvjIJ5RwsSBM7Vt2zZgi925oHb6txt0sT2HFKmpLQczz77TFC5SE6AGDDXb9gAmMNhk9S5sPNKPgHgkpKHEz6RHN0x2aImhQoA8tLxIDU1FUuW/BGbN21EtOz4MgXHdpiG35a9GVlrP0JvWZARMH+uT76aioqK8LeVKzF6VKIC0tdUyCcAZKS7QaZ4AUm7lnoI4Z958+6TxMutyBegzWI9bn1vXPcZFr/8CtLT0wPq943FycrKUq+Y0SZwQXsAa/NYSkpaOhYufExcsVQBEEovIKAEOUoUXvzSSygpLlQHLcpOl+NHU6dhvgATDOnNkLKyU1iwYAGGDBuuTqv46v/k3aQHsACDlfiCHFX5mI8h7Qbkp+PBgAEDsGbNGmRnZeLQ/j1Y/OIfEB0drQAK1PP0SPXJJ/8kazV8M53WVH2/APBMDo+lPPTQg8g/evSSwKqFEP3RfXvKlCl48qmn8NGqVRg0aFDQ/Z5dp6ysDPPnz0fCDYmos9r8xg2/AFBHun3Xnn2wePHLsjVuV0xD2RV0G7w/t2gRZkyfzo9+hVeFPP5w7bJ8+XL1JkJOj6istq/OX18vIAB4IGlY/EAsf3sZPvxwpaoaagDopuTpTsV7aBXgx7Sb0vHWn5fhjbeWIXHUaNhkFGsq+Gm2AQFA4biqumnCRNx55xzs2LFDMedQGUpqqq/6akcbgjnMNZ+tV0MmEzpyFtjn5MeTV0AAsAKFq5PJxZixKRg7dqwciDqsrBVqEDyFC+Sz9hijKN2zezf2G5jkPKHR5GPm04hpwACwHs/zmmRUGJGYhKFDh+LwkSMKBA5l2hKN+LfKI9vS7VVVVbnbEH05c+SiSi2sAmw5KADoBXY5Zd1GhqeExFEYOmQI8vLyVHfgd3riFGDbzSrGNtgWLb9nzx78ZNZsDIwfIuuJOnkfPMugACB7Nwg2WaJGY/SYseqg0ooVK9TxOD2mBy+G/xq0OJVnG/y8evVqjBw5Unkkp82y3KF0/hk1KhE0AKxPEBxOGQ5lmpl60wTMlpXa/TLzKigoqJ84hW7CRKW11an88ePH8fDDD6t9v0RZ58fFxkmwM8kegu/pbiOdGzw2CwANgvzWALUSGNMzJmHZex+if//+WLp0KZiIMAk4upzur7zrzw2kqH/Q32ul+ZpK8zotKXGO8X369FFtJI8bJwtpdgUzzBL0aJTmUEgOS3MObpHgyG2r7XIyY+DgeCRcPxz7vjwgfdOK/bt3IUZOiTcmDYYv4ZmPLCwsBBc2nNuTOMPjxifPKpp54lzAaabuil9IACAnMa6ybqQIx8hcIQce4mK74tz5Sjzw83lyXH40unXrBm5XccdGD19KCvlDqzOHR+9hJofJjA2ynl8pS1oSFzZMzXF6y7r0iqYWOapSAH8EgBQ5Lm9s0XF5z3ZoVVqU/zg54fi8U47La5ogBxe4d88dG87dWZaTLGZvC8TamRs36qKyR2jBaDmEzQWZVRSntak4Td4Sq3/XgLBy/14ATJox6de8juTJsdFnAhIeZlGK1sgvQ7hRWSBpcXdzDQv3kOxtrJw0Zw6PwDCT4x7b3Su6UFi8YYtwMVI52Jjuj40KtPiRvK12m8QHwVeiddeusYiL66YU1GizbebtdfCzSv+msrxMRga4FovhjYEyOAEoESEHS+MuubdOU9KIUqheDM4o5b/LSZo3yYnPK0BKVwG+kh1qPX9OKrrLmfMrR4Ta23WFJLAxkEq0Wmc0OGwvyG9pL0hwCZfG+dMsusbVSqKbyyrGtjCvYXIaf2uUpe1pcc+bpQtUy7jKn86yG1yNICi3Vz+ZlXjjchmm5uZmf21Mk5+Q78jJyTM6HQPsdtsyCVZlAsDVBoIKeNLnz9pt9g9MLufAndtzPuX/OuC/Xw9oVWntE6UAAAAASUVORK5CYII=</data>


        <!-- This is the title of the manifest -->
        <key>pfm_title</key>
        <string>Elevate24</string>

        <!-- This determines if there can be more than one payload in the profile for this PayloadType. -->
        <key>pfm_unique</key>
        <true/>

        <!-- This is the version number of this manifest, it's used to determine which manifest to load if two manifests with identical "pfm_domain" is found-->
        <key>pfm_version</key>
        <integer>1</integer>

        <!-- This is an array of all keys this payload can configure. They will be shown in order. -->
        <key>pfm_subkeys</key>
        <array>
            <dict>
                <key>pfm_name</key>
                <string>PFC_SegmentedControl_0</string>
                <key>pfm_range_list_titles</key>
                <array>
                    <string>License</string>
                    <string>Branding</string>
                    <string>Time and Reason</string>
                    <string>Security Settings</string>
                    <string>Secondary Account (Premium)</string>
                    <string>Reporting</string>
                </array>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_segments</key>
                <dict>
                    <key>License</key>
                    <array>
                        <string>LicenseKey</string>
                        <string>LicenseAPIKey</string>
                    </array>
                    <key>Branding</key>
                    <array>
                        <string>message</string>
                        <string>iconPath</string>
                        <string>heading</string>
                        <string>mainbutton</string>
                        <string>HideLogo</string>
                    </array>
                    <key>Time and Reason</key>
                    <array>
                        <string>enableReason</string>
                        <string>Enabletimelist</string>
                        <string>Sessiontime</string>
                        <string>times</string>
                        <string>reasons</string>
                    </array>
                    <key>Security Settings</key>
                    <array>
                        <string>enableAppleAuth</string>
                        <string>GoogleAuth</string>
                        <string>standardAtLoad</string>
                        <string>demoteAllAdmin</string>
                        <string>demoteAllAdminQuit</string>
                        <string>killterminalsessions</string>
                        <string>demoteExclusions</string>
                        <string>EnableSessionMonitoring</string>
                    </array>
                    <key>Secondary Account (Premium)</key>
                    <array>
                        <string>userElevateAdmin</string>
                        <string>useCurrentUserAsAdmin</string>
                        <string>adminUserName</string>
                        <string>ComplexPassword</string>
                        <string>PasswordUppercase</string>
                        <string>PasswordLowercase</string>
                        <string>PasswordNumbers</string>
                        <string>PasswordSymbols</string>
                        <string>showAdminPasswordGrace</string>
                    </array>
                    <key>Reporting</key>
                    <array>
                        <string>DisableDefaultLog</string>
                        <string>siemURL</string>
                        <string>siemAuthHeader</string>
                        <string>siemAuthToken</string>
                        <string>microsoftsentinel</string>
                        <string>teamswebhook</string>
                        <string>slack-webhook</string>
                    </array>
                </dict>
            </dict>



            <!-- *************************** REQUIRED KEYS *************************** -->
            <!-- Currently the "base" keys for each payload must be defined in each manifest -->
            <!-- That is something I hope to move into the application and make the settings more simple. -->
            <!-- But for now, these are required to create a valid payload on export. -->

            <!-- PayloadDescription -->
            <!-- Description for the payload shown when the payload is installed. -->
            <dict>
                <key>pfm_default</key>
                <string>Configures Elevate24 configuration preferences.</string>                <!-- CHANGE THIS VALUE -->
                <key>pfm_description</key>
                <string>Elevate24 Configuration</string>
                <key>pfm_name</key>
                <string>PayloadDescription</string>
                <key>pfm_title</key>
                <string>Elevate24</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <!-- PayloadDisplayName -->
            <!-- Display Name of the payload shown when the payload is installed. -->
            <dict>
                <key>pfm_default</key>
                <string>Elevate24</string>                <!-- CHANGE THIS VALUE -->
                <key>pfm_description</key>
                <string>Elevate24 Configuration</string>
                <key>pfm_description_reference</key>
                <string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
                <key>pfm_name</key>
                <string>PayloadDisplayName</string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_title</key>
                <string>Payload Display Name</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <!-- PayloadIdentifier -->
            <!-- The base identifier this payload should use. This will then be expanded by the application to add the root identifier + the payload UUID to create a unique identifier automatically. -->
            <dict>
                <key>pfm_default</key>
                <string>com.jigsaw24.Elevate24</string>                <!-- CHANGE THIS VALUE TO THE SAME AS pfm_domain and PayloadType -->
                <key>pfm_description</key>
                <string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
                <key>pfm_description_reference</key>
                <string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
                <key>pfm_name</key>
                <string>PayloadIdentifier</string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_title</key>
                <string>Payload Identifier</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <!-- PayloadType -->
            <!-- This is the PayloadType of the payload. -->
            <dict>
                <key>pfm_default</key>
                <string>com.jigsaw24.Elevate24</string>                <!-- CHANGE THIS VALUE TO THE SAME AS pfm_domain and PayloadIdentifier -->
                <key>pfm_description</key>
                <string>The type of the payload, a reverse dns string.</string>
                <key>pfm_description_reference</key>
                <string>The payload type.</string>
                <key>pfm_name</key>
                <string>PayloadType</string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_title</key>
                <string>Payload Type</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <!-- PayloadUUID -->
            <!-- This is the PayloadUUID and it will be generated automatically. You should NOT edit this. -->
            <dict>
                <key>pfm_description</key>
                <string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
                <key>pfm_description_reference</key>
                <string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
                <key>pfm_format</key>
                <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
                <key>pfm_name</key>
                <string>PayloadUUID</string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_title</key>
                <string>Payload UUID</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <!-- PayloadVersion -->
            <!-- This is the version of the payload. You should NOT edit this. -->
            <dict>
                <key>pfm_default</key>
                <integer>1</integer>
                <key>pfm_description</key>
                <string>The version of the whole configuration profile.</string>
                <key>pfm_description_reference</key>
                <string>The version number of the individual payload. A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
                <key>pfm_name</key>
                <string>PayloadVersion</string>
                <key>pfm_require</key>
                <string>always</string>
                <key>pfm_title</key>
                <string>Payload Version</string>
                <key>pfm_type</key>
                <string>integer</string>
            </dict>

            <!-- PayloadOrganization -->
            <!-- This is the organization of the payload. You should NOT edit this. -->
            <dict>
                <key>pfm_description</key>
                <string>This value describes the issuing organization of the profile, as displayed to the user</string>
                <key>pfm_name</key>
                <string>PayloadOrganization</string>
                <key>pfm_title</key>
                <string>Payload Organization</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <!-- *************************** APPLICATION KEYS *************************** -->
            <!-- You should add all keys this payload can manage below this comment. -->

            <!-- *************************** License Keys *************************** -->

            <dict>
                <key>pfm_name</key>
                <string>LicenseKey</string>
                <key>pfm_title</key>
                <string>License Key (Premium)</string>
                <key>pfm_description</key>
                <string>Enter your Elevate24 license key. Mandatory key for Premium customers only.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#license-configuration</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_value_placeholder</key>
                <string>License Key</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>LicenseAPIKey</string>
                <key>pfm_title</key>
                <string>License API Key (Premium)</string>
                <key>pfm_description</key>
                <string>Enter your Elevate24 license api key. Mandatory key for Premium customers only.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#license-configuration</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_value_placeholder</key>
                <string>License API Key</string>
            </dict>

            <!-- *************************** Branding *************************** -->

            <dict>
                <key>pfm_name</key>
                <string>message</string>
                <key>pfm_title</key>
                <string>Message</string>
                <key>pfm_description</key>
                <string>Change the standard application message in the application.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#branding</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_value_placeholder</key>
                <string>The use of admin accounts is recorded for security compliance.</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>iconPath</string>
                <key>pfm_title</key>
                <string>Icon (Premium)</string>
                <key>pfm_description</key>
                <string>Prodvide the file path to a JPEG or PNG to use as the icon in the Elevate24 application.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#branding</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_value_placeholder</key>
                <string>/path/to/file.png</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>heading</string>
                <key>pfm_title</key>
                <string>Heading (Premium)</string>
                <key>pfm_description</key>
                <string>Change the standard header from Elevate24 in the application. Always displays in bold.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#branding</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_value_placeholder</key>
                <string></string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>mainbutton</string>
                <key>pfm_title</key>
                <string>Mainbutton Txt (Premium)</string>
                <key>pfm_description</key>
                <string>Change the standard button text from Elevate in the application. </string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#branding</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_value_placeholder</key>
                <string></string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>HideLogo</string>
                <key>pfm_title</key>
                <string>Hide Powered By Jigsaw24 Logo (Premium)</string>
                <key>pfm_description</key>
                <string>Hide the “Powered by Jigsaw24” logo in the application.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#branding</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>

<!-- *************************** Session Time and Reason *************************** -->

            <dict>
                <key>pfm_name</key>
                <string>Enabletimelist</string>
                <key>pfm_title</key>
                <string>Enable Choice of Session Times</string>
                <key>pfm_description</key>
                <string>Enables the option for the application to display a choice of times. To be used in conjuction with Session Times list.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#elevated-session-customisation</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>


            <dict>
                <key>pfm_name</key>
                <string>enableReason</string>
                <key>pfm_title</key>
                <string>Enable free text reason</string>
                <key>pfm_description</key>
                <string>Will replace reasons drop down list with a free text entry box. </string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#elevated-session-customisation</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>Sessiontime</string>
                <key>pfm_title</key>
                <string>Session Time</string>
                <key>pfm_description</key>
                <string>Change the length of time (in seconds) the user will be elevated for. Do not use this key if you want to present a list of times to choose from.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#elevated-session-customisation</string>
                <key>pfm_type</key>
                <string>string</string>
                <key>pfm_value_placeholder</key>
                <string>900</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>times</string>
                <key>pfm_title</key>
                <string>Session Times</string>
                <key>pfm_description</key>
                <string>List of available times to chose from in the Application. Enter time below in seconds.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#elevated-session-customisation</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_type</key>
                        <string>string</string>
                    </dict>
                </array>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>reasons</string>
                <key>pfm_title</key>
                <string>Reasons</string>
                <key>pfm_description</key>
                <string>The reasons to choose for needing elevated rights in dropbox within the application.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#elevated-session-customisation</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_type</key>
                        <string>string</string>
                    </dict>
                </array>
            </dict>

            <!-- *************************** Reporting Keys *************************** -->

            <dict>
                <key>pfm_name</key>
                <string>siemURL</string>
                <key>pfm_title</key>
                <string>SIEM URL (Premium)</string>
                <key>pfm_description</key>
                <string></string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Reporting%20Configuration%20Keys.md#reporting-configuration-keys-for-elevate24</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>siemAuthHeader</string>
                <key>pfm_title</key>
                <string>SIEM Auth Header (Premium)</string>
                <key>pfm_description</key>
                <string></string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Reporting%20Configuration%20Keys.md#reporting-configuration-keys-for-elevate24</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>siemAuthToken</string>
                <key>pfm_title</key>
                <string>SIEM Auth Token (Premium)</string>
                <key>pfm_description</key>
                <string></string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Reporting%20Configuration%20Keys.md#reporting-configuration-keys-for-elevate24</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>teamswebhook</string>
                <key>pfm_title</key>
                <string>Teams Webhook (Premium)</string>
                <key>pfm_description</key>
                <string></string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Reporting%20Configuration%20Keys.md#reporting-configuration-keys-for-elevate24</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>slack-webhook</string>
                <key>pfm_title</key>
                <string>Slack Webhook (Premium)</string>
                <key>pfm_description</key>
                <string></string>
                 <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Reporting%20Configuration%20Keys.md#reporting-configuration-keys-for-elevate24</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>microsoftsentinel</string>
                <key>pfm_title</key>
                <string>Microsoft Sentinel</string>
                <key>pfm_description</key>
                <string>To allow reporting to a Microsoft Sentinel Instance..</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Reporting%20Configuration%20Keys.md#reporting-configuration-keys-for-elevate24</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_type</key>
                        <string>SentinelClientId</string>
                        <key>pfm_type</key>
                        <string>SentinelTennantId</string>
                        <key>pfm_type</key>
                        <string>SentinelClientsecret</string>
                        <key>pfm_type</key>
                        <string>SentinelUploadURL</string>
                    </dict>
                </array>
            </dict>

                        <!-- *************************** Security Settings *************************** -->

            <dict>
                <key>pfm_name</key>
                <string>DisableDefaultLog</string>
                <key>pfm_title</key>
                <string>Disable Default Log (Premium)</string>
                <key>pfm_description</key>
                <string>To disable sending of premium reporting data to Jigsaw24. If you are a basic customer, no data is sent from the device, it is all stored locally.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Reporting%20Configuration%20Keys.md#disable-sending-data-to-jigsaw24</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>


            <dict>
                <key>pfm_name</key>
                <string>EnableSessionMonitoring</string>
                <key>pfm_title</key>
                <string>Enable Session Monitoring (Premium)</string>
                <key>pfm_description</key>
                <string>To enable monitoring of administrator activities whilst in an elevated state.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20Session%20Reporting%20-%20Configuration%20Keys.md#configuration-keys-for-elevate24-session-reporting</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>enableAppleAuth</string>
                <key>pfm_title</key>
                <string>Apple Auth (Premium)</string>
                <key>pfm_description</key>
                <string>Prompts the user for their local Apple credentials or TouchID (if enabled on device) before allowing elevation.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#security-settings</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>GoogleAuth</string>
                <key>pfm_title</key>
                <string>OTP Auth (Premium)</string>
                <key>pfm_description</key>
                <string>Enables the use of authenticator applications such as Google Auth or Microsoft Auth, prompting for a valid session token before Elevating to admin.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#security-settings</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>standardAtLoad</string>
                <key>pfm_title</key>
                <string>Standard At Load</string>
                <key>pfm_description</key>
                <string>Will remove admin rights when the application first launches.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#security-settings</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>demoteAllAdmin</string>
                <key>pfm_title</key>
                <string>Demote All Admin</string>
                <key>pfm_description</key>
                <string>Enables all admin users being demoted to standard users when the current elevation period ends. If you have any accounts on the device you'd like to remain admin please configure Demote Exclusions.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#security-settings</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>demoteAllAdminQuit</string>
                <key>pfm_title</key>
                <string>Demote All Admin Quit</string>
                <key>pfm_description</key>
                <string>Will demote all admin accounts from admin when the application quits or the laptop is restarted.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#security-settings</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>demoteExclusions</string>
                <key>pfm_title</key>
                <string>Demote Exclusions</string>
                <key>pfm_description</key>
                <string>Will exclude accounts on device from being demoted.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#security-settings</string>
                <key>pfm_type</key>
                <string>array</string>
                <key>pfm_subkeys</key>
                <array>
                    <dict>
                        <key>pfm_type</key>
                        <string>string</string>
                    </dict>
                </array>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>killterminalsessions</string>
                <key>pfm_title</key>
                <string>Kill Terminal Sessions</string>
                <key>pfm_description</key>
                <string>Will demote the current terminal session from sudo session to standard.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#security-settings</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>

             <!-- *************************** 2nd Account *************************** -->

            <dict>
                <key>pfm_name</key>
                <string>userElevateAdmin</string>
                <key>pfm_title</key>
                <string>User Elevate Admin (Premium)</string>
                <key>pfm_description</key>
                <string>Will create a temporary secondary account instead of Elevating the primary account. A temporary password will also be supplied upon elevation.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#security-settings</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>useCurrentUserAsAdmin</string>
                <key>pfm_title</key>
                <string>Use Current User As Admin (Premium)</string>
                <key>pfm_description</key>
                <string>If User Elevate Admin Key is enabled and this key is also enabled, the temporary account will use the current logged in users username as part of the account naming. For example, Joe.Bloggs-adm</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#secondary-account-configuration</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>adminUserName</string>
                <key>pfm_title</key>
                <string>Admin User Name (Premium)</string>
                <key>pfm_description</key>
                <string>If ‘Use Current User As Admin’ is not enabled, this key allows the ability to create a temporary admin account with a standard name.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#secondary-account-configuration</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>ComplexPassword</string>
                <key>pfm_title</key>
                <string>Complex Password (Premium)</string>
                <key>pfm_description</key>
                <string>Enables the use of a custom complex password when 'User Elevate Admin' is enabled.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#secondary-account-configuration</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>PasswordUppercase</string>
                <key>pfm_title</key>
                <string>Password Uppercase (Premium)</string>
                <key>pfm_description</key>
                <string>Enter the amount of uppercase Letters required for the password.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#secondary-account-configuration</string>
                <key>pfm_value_placeholder</key>
                <string>4</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>PasswordLowercase</string>
                <key>pfm_title</key>
                <string>Password Lowercase (Premium)</string>
                <key>pfm_description</key>
                <string>Enter the amount of lowercase Letters required for the password.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#secondary-account-configuration</string>
                <key>pfm_value_placeholder</key>
                <string>8</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>PasswordNumbers</string>
                <key>pfm_title</key>
                <string>Password Numbers (Premium)</string>
                <key>pfm_description</key>
                <string>Enter the amount of numbers required for the password.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#secondary-account-configuration</string>
                <key>pfm_value_placeholder</key>
                <string>2</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>PasswordSymbols</string>
                <key>pfm_title</key>
                <string>Password Symbols (Premium)</string>
                <key>pfm_description</key>
                <string>Enter the amount of symbols required for the password.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#secondary-account-configuration</string>
                <key>pfm_value_placeholder</key>
                <string>2</string>
                <key>pfm_type</key>
                <string>string</string>
            </dict>

            <dict>
                <key>pfm_name</key>
                <string>showAdminPasswordGrace</string>
                <key>pfm_title</key>
                <string>Show Admin Password Grace (Premium)</string>
                <key>pfm_description</key>
                <string>Set the number of seconds after elevation or last showing the password that the password will be shown (Max 45 seconds). This only works if 'User Elevate Admin' is enabled.</string>
                <key>pfm_documentation_url</key>
                <string>https://github.com/Jigsaw24/Elevate24/blob/main/Documentation/Elevate24%20-%20Configuration%20Keys.md#secondary-account-configuration</string>
                <key>pfm_value_placeholder</key>
                <string>5</string>
                <key>pfm_type</key>
                <string>integer</string>
            </dict>
        </array>
    </dict>
</plist>
