<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://enterprise.google.com/chrome/chrome-browser/</string>
	<key>pfm_description</key>
	<string>Google Chrome Managed Settings</string>
	<key>pfm_documentation_url</key>
	<string>http://dev.chromium.org/administrators/policy-list-3</string>
	<key>pfm_domain</key>
	<string>com.google.Chrome</string>
	<key>pfm_format_version</key>
	<integer>3</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2018-10-20T18:20:30Z</date>
	<key>pfm_name</key>
	<string>Google_Chrome</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Google Chrome settings</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Google Chrome</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.google.Chrome</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier.</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.google.Chrome</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF).</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload. A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile. The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set whether sites with abusive experiences should be prevented from opening new windows or tabs.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set whether sites with abusive experiences should be prevented from opening new windows or tabs.

If this policy is set to True, sites with abusive experiences will be prevented from opening new windows or tabs.
However this behavior will not trigger if SafeBrowsingEnabled policy is set to False.
If this policy is set to False, sites with abusive experiences will be allowed to open new windows or tabs.
If this policy is left not set, True will be used.</string>
			<key>pfm_name</key>
			<string>AbusiveExperienceInterventionEnforce</string>
			<key>pfm_title</key>
			<string>Abusive Experience Intervention Enforce</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set whether ads should be blocked on sites with intrusive ads.</string>
			<key>pfm_description_reference</key>
			<string>1 - Allow ads on all sites
2 - Do not allow ads on sites with intrusive ads
Allows you to set whether ads should be blocked on sites with intrusive ads.

If this policy is set to 2, ads will be blocked on sites with intrusive ads.
However this behavior will not trigger if SafeBrowsingEnabled policy is set to False.
If this policy is set to 1, ads will not be blocked on sites with intrusive ads.
If this policy is left not set, 2 will be used.</string>
			<key>pfm_name</key>
			<string>AdsSettingForIntrusiveAdsSites</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Allow ads on all sites</string>
				<string>Do not allow ads on sites with intrusive ads</string>
			</array>
			<key>pfm_title</key>
			<string>Ads setting for sites with intrusive ads</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Controls whether third-party sub-content on a page is allowed to pop-up an HTTP Basic Auth dialog box.</string>
			<key>pfm_description_reference</key>
			<string>Controls whether third-party sub-content on a page is allowed to pop-up an HTTP Basic Auth dialog box.

Typically this is disabled as a phishing defense. If this policy is not set, this is disabled and third-party sub-content will not be allowed to pop up a HTTP Basic Auth dialog box.</string>
			<key>pfm_name</key>
			<string>AllowCrossOriginAuthPrompt</string>
			<key>pfm_title</key>
			<string>Cross-origin HTTP Basic Auth prompts</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables deleting browser history and download history in Google Chrome and prevents users from changing this setting.</string>
			<key>pfm_description_reference</key>
			<string>Enables deleting browser history and download history in Google Chrome and prevents users from changing this setting.

Note that even with this policy disabled, the browsing and download history are not guaranteed to be retained: users may be able to edit or delete the history database files directly, and the browser itself may expire or archive any or all history items at any time.

If this setting is enabled or not set, browsing and download history can be deleted.

If this setting is disabled, browsing and download history cannot be deleted.</string>
			<key>pfm_name</key>
			<string>AllowDeletingBrowserHistory</string>
			<key>pfm_title</key>
			<string>Enable deleting browser and download history</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allow users to play dinosaur easter egg game when device is offline.</string>
			<key>pfm_description_reference</key>
			<string>Allow users to play dinosaur easter egg game when device is offline.

If this policy is set to False, users will not be able to play the dinosaur easter egg game when device is offline. If this setting is set to True, users are allowed to play the dinosaur game. If this policy is not set, users are not allowed to play the dinosaur easter egg game on enrolled Chrome OS, but are allowed to play it under other circumstances.</string>
			<key>pfm_name</key>
			<string>AllowDinosaurEasterEgg</string>
			<key>pfm_title</key>
			<string>Allow Dinosaur Easter Egg Game</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows access to local files on the machine by allowing Google Chrome to display file selection dialogs.</string>
			<key>pfm_description_reference</key>
			<string>Allows access to local files on the machine by allowing Google Chrome to display file selection dialogs.

If you enable this setting, users can open file selection dialogs as normal.

If you disable this setting, whenever the user performs an action which would provoke a file selection dialog (like importing bookmarks, uploading files, saving links, etc.) a message is displayed instead and the user is assumed to have clicked Cancel on the file selection dialog.

If this setting is not set, users can open file selection dialogs as normal.</string>
			<key>pfm_name</key>
			<string>AllowFileSelectionDialogs</string>
			<key>pfm_title</key>
			<string>Allow invocation of file selection dialogs</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If you enable this setting, outdated plugins are used as normal plugins.</string>
			<key>pfm_description_reference</key>
			<string>If you enable this setting, outdated plugins are used as normal plugins.

If you disable this setting, outdated plugins will not be used and users will not be asked for permission to run them.

If this setting is not set, users will be asked for permission to run outdated plugins.</string>
			<key>pfm_name</key>
			<string>AllowOutdatedPlugins</string>
			<key>pfm_title</key>
			<string>Allow running plugins that are outdated</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables Google Chrome's restricted log in feature in G Suite and prevents users from changing this setting.</string>
			<key>pfm_description_reference</key>
			<string>Enables Google Chrome's restricted log in feature in G Suite and prevents users from changing this setting.

If you define this setting, the user will only be able to access Google
Apps using accounts from the specified domains (note that this does not
work for gmail.com/googlemail.com).

This setting will NOT prevent the user from loging in on a managed device
that requires Google authentication. The user will still be allowed to
sign in to accounts from other domains, but they will receive an error
when trying to use G Suite with those accounts.

If you leave this setting empty/not-configured, the user will be able to
access G Suite with any account.

This policy causes the X-GoogApps-Allowed-Domains header to be appended to
all HTTP and HTTPS requests to all google.com domains, as described in
https://support.google.com/a/answer/1668854.

Users cannot change or override this setting.</string>
			<key>pfm_name</key>
			<string>AllowedDomainsForApps</string>
			<key>pfm_title</key>
			<string>Define domains allowed to access G Suite</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables the use of alternate error pages that are built into Google Chrome (such as 'page not found') and prevents users from changing this setting.</string>
			<key>pfm_description_reference</key>
			<string>Enables the use of alternate error pages that are built into Google Chrome (such as 'page not found') and prevents users from changing this setting.

If you enable this setting, alternate error pages are used.

If you disable this setting, alternate error pages are never used.

If you enable or disable this setting, users cannot change or override this setting in Google Chrome.

If this policy is left not set, this will be enabled but the user will be able to change it.</string>
			<key>pfm_name</key>
			<string>AlternateErrorPagesEnabled</string>
			<key>pfm_title</key>
			<string>Enable alternate error pages</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disables the internal PDF viewer in Google Chrome. Instead it treats it as download and allows the user to open PDF files with the default application.</string>
			<key>pfm_description_reference</key>
			<string>Disables the internal PDF viewer in Google Chrome. Instead it treats it as download and allows the user to open PDF files with the default application.

If this policy is left not set or disabled the PDF plugin will be used to open PDF files unless the user disables it.</string>
			<key>pfm_name</key>
			<string>AlwaysOpenPdfExternally</string>
			<key>pfm_title</key>
			<string>Always Open PDF files externally</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If enabled or not configured (default), the user will be prompted for
audio capture access except for URLs configured in the
AudioCaptureAllowedUrls list which will be granted access without prompting.</string>
			<key>pfm_description_reference</key>
			<string>If enabled or not configured (default), the user will be prompted for
audio capture access except for URLs configured in the
AudioCaptureAllowedUrls list which will be granted access without prompting.

When this policy is disabled, the user will never be prompted and audio
capture only be available to URLs configured in AudioCaptureAllowedUrls.

This policy affects all types of audio inputs and not only the built-in microphone.</string>
			<key>pfm_name</key>
			<string>AudioCaptureAllowed</string>
			<key>pfm_title</key>
			<string>Allow or deny audio capture</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Patterns in this list will be matched against the security
origin of the requesting URL.  If a match is found, access to audio
capture devices will be granted without prompt.</string>
			<key>pfm_description_reference</key>
			<string>Patterns in this list will be matched against the security
origin of the requesting URL.  If a match is found, access to audio
capture devices will be granted without prompt.

NOTE: Until version 45, this policy was only supported in Kiosk mode.</string>
			<key>pfm_name</key>
			<string>AudioCaptureAllowedUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>URLs that will be granted access to audio capture devices without prompt</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Servers that Google Chrome may delegate to.</string>
			<key>pfm_description_reference</key>
			<string>Servers that Google Chrome may delegate to.

Separate multiple server names with commas. Wildcards (*) are allowed.

If you leave this policy not set Google Chrome will not delegate user credentials even if a server is detected as Intranet.</string>
			<key>pfm_name</key>
			<string>AuthNegotiateDelegateWhitelist</string>
			<key>pfm_title</key>
			<string>Kerberos delegation server whitelist</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies which HTTP authentication schemes are supported by Google Chrome.</string>
			<key>pfm_description_reference</key>
			<string>Specifies which HTTP authentication schemes are supported by Google Chrome.

Possible values are 'basic', 'digest', 'ntlm' and 'negotiate'. Separate multiple values with commas.

If this policy is left not set, all four schemes will be used.</string>
			<key>pfm_name</key>
			<string>AuthSchemes</string>
			<key>pfm_title</key>
			<string>Supported authentication schemes</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies which servers should be whitelisted for integrated authentication. Integrated authentication is only enabled when Google Chrome receives an authentication challenge from a proxy or from a server which is in this permitted list.</string>
			<key>pfm_description_reference</key>
			<string>Specifies which servers should be whitelisted for integrated authentication. Integrated authentication is only enabled when Google Chrome receives an authentication challenge from a proxy or from a server which is in this permitted list.

Separate multiple server names with commas. Wildcards (*) are allowed.

If you leave this policy not set Google Chrome will try to detect if a server is on the Intranet and only then will it respond to IWA requests.  If a server is detected as Internet then IWA requests from it will be ignored by Google Chrome.</string>
			<key>pfm_name</key>
			<string>AuthServerWhitelist</string>
			<key>pfm_title</key>
			<string>Authentication server whitelist</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables Google Chrome's AutoFill feature and allows users to auto complete web forms using previously stored information such as address or credit card information.</string>
			<key>pfm_description_reference</key>
			<string>Enables Google Chrome's AutoFill feature and allows users to auto complete web forms using previously stored information such as address or credit card information.

If you disable this setting, AutoFill will be inaccessible to users.

If you enable this setting or do not set a value, AutoFill will remain under the control of the user. This will allow them to configure AutoFill profiles and to switch AutoFill on or off at their own discretion.</string>
			<key>pfm_name</key>
			<string>AutoFillEnabled</string>
			<key>pfm_title</key>
			<string>Enable AutoFill</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to specify a list of url patterns that specify sites for which Google Chrome should automatically select a client certificate, if the site requests a certificate.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to specify a list of url patterns that specify sites for which Google Chrome should automatically select a client certificate, if the site requests a certificate.

The value must be an array of stringified JSON dictionaries. Each dictionary must have the form { "pattern": "$URL_PATTERN", "filter" : $FILTER }, where $URL_PATTERN is a content setting pattern. $FILTER restricts from which client certificates the browser will automatically select. Independent of the filter, only certificates will be selected that match the server's certificate request. If $FILTER has the form { "ISSUER": { "CN": "$ISSUER_CN" } }, additionally only client certificates are selected that are issued by a certificate with the CommonName $ISSUER_CN. If $FILTER is the empty dictionary {}, the selection of client certificates is not additionally restricted.

If this policy is left not set, no auto-selection will be done for any site.</string>
			<key>pfm_name</key>
			<string>AutoSelectCertificateForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Automatically select client certificates for these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables Google Chrome's AutoFill feature and allows users to auto complete address information in web forms using previously stored information.</string>
			<key>pfm_description_reference</key>
			<string>Enables Google Chrome's AutoFill feature and allows users to auto complete address information in web forms using previously stored information.

If this setting is disabled, Autofill will never suggest, or fill address information, nor will it save additional address information that the user might submit while browsing the web.

If this setting is enabled or has no value, the user will be able to control Autofill for addresses in the UI.</string>
			<key>pfm_name</key>
			<string>AutofillAddressEnabled</string>
			<key>pfm_title</key>
			<string>Enable AutoFill for addresses</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables Google Chrome's AutoFill feature and allows users to auto complete credit card information in web forms using previously stored information.</string>
			<key>pfm_description_reference</key>
			<string>Enables Google Chrome's AutoFill feature and allows users to auto complete credit card information in web forms using previously stored information.

If this setting is disabled, Autofill will never suggest, or fill credit card information, nor will it save additional credit card information that the user might submit while browsing the web.

If this setting is enabled or has no value, the user will be able to control Autofill for credit cards in the UI.</string>
			<key>pfm_name</key>
			<string>AutofillCreditCardEnabled</string>
			<key>pfm_title</key>
			<string>Enable AutoFill for credit cards</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to control if videos can play automatically (without user consent) with audio content in Google Chrome.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to control if videos can play automatically (without user consent) with audio content in Google Chrome.

If the policy is set to True, Google Chrome is allowed to autoplay media.
If the policy is set to False, Google Chrome is not allowed to autoplay media. The AutoplayWhitelist policy can be used to override this for certain URL patterns.
By default, Google Chrome is not allowed to autoplay media. The AutoplayWhitelist policy can be used to override this for certain URL patterns.

Note that if Google Chrome is running and this policy changes, it will be applied only to new opened tabs. Therefore some tabs might still observe the previous behavior.</string>
			<key>pfm_name</key>
			<string>AutoplayAllowed</string>
			<key>pfm_title</key>
			<string>Allow media autoplay</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Controls the whitelist of URL patterns that autoplay will always be enabled on.</string>
			<key>pfm_description_reference</key>
			<string>Controls the whitelist of URL patterns that autoplay will always be enabled on.

If autoplay is enabled then videos can play automatically (without user consent) with audio content in Google Chrome.

A URL pattern has to be formatted according to https://www.chromium.org/administrators/url-blacklist-filter-format.

If the AutoplayAllowed policy is set to True then this policy will have no effect.

If the AutoplayAllowed policy is set to False then any URL patterns set in this policy will still be allowed to play.

Note that if Google Chrome is running and this policy changes, it will be applied only to new opened tabs. Therefore some tabs might still observe the previous behavior.</string>
			<key>pfm_name</key>
			<string>AutoplayWhitelist</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allow media autoplay on a whitelist of URL patterns</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enabling this setting prevents cookies from being set by web page elements that are not from the domain that is in the browser's address bar.</string>
			<key>pfm_description_reference</key>
			<string>Enabling this setting prevents cookies from being set by web page elements that are not from the domain that is in the browser's address bar.

Disabling this setting allows cookies to be set by web page elements that are not from the domain that is in the browser's address bar and prevents users from changing this setting.

If this policy is left not set, third party cookies will be enabled but the user will be able to change that.</string>
			<key>pfm_name</key>
			<string>BlockThirdPartyCookies</string>
			<key>pfm_title</key>
			<string>Block third party cookies</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If you enable this setting, Google Chrome will show a bookmark bar.</string>
			<key>pfm_description_reference</key>
			<string>If you enable this setting, Google Chrome will show a bookmark bar.

If you disable this setting, users will never see the bookmark bar.

If you enable or disable this setting, users cannot change or override it in Google Chrome.

If this setting is left not set the user can decide to use this function or not.</string>
			<key>pfm_name</key>
			<string>BookmarkBarEnabled</string>
			<key>pfm_title</key>
			<string>Enable Bookmark Bar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is set to true or not configured, Google Chrome will allow Add Person from the user manager.</string>
			<key>pfm_description_reference</key>
			<string>If this policy is set to true or not configured, Google Chrome will allow Add Person from the user manager.

If this policy is set to false, Google Chrome will not allow creation of new profiles from the user manager.</string>
			<key>pfm_name</key>
			<string>BrowserAddPersonEnabled</string>
			<key>pfm_title</key>
			<string>Enable add person in user manager</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is set to true or not configured, Google Chrome will enable guest logins. Guest logins are Google Chrome profiles where all windows are in incognito mode.</string>
			<key>pfm_description_reference</key>
			<string>If this policy is set to true or not configured, Google Chrome will enable guest logins. Guest logins are Google Chrome profiles where all windows are in incognito mode.

If this policy is set to false, Google Chrome will not allow guest profiles to be started.</string>
			<key>pfm_name</key>
			<string>BrowserGuestModeEnabled</string>
			<key>pfm_title</key>
			<string>Enable guest mode in browser</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Setting this policy to false stops Google Chrome from occasionally sending queries to a Google server to retrieve an accurate timestamp. These queries will be enabled if this policy is set to True or is not set.</string>
			<key>pfm_description_reference</key>
			<string>Setting this policy to false stops Google Chrome from occasionally sending queries to a Google server to retrieve an accurate timestamp. These queries will be enabled if this policy is set to True or is not set.</string>
			<key>pfm_name</key>
			<string>BrowserNetworkTimeQueriesEnabled</string>
			<key>pfm_title</key>
			<string>Allow queries to a Google time service</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Controls whether the built-in DNS client is used in Google Chrome.</string>
			<key>pfm_description_reference</key>
			<string>Controls whether the built-in DNS client is used in Google Chrome.

If this policy is set to true, the built-in DNS client will be used, if available.

If this policy is set to false, the built-in DNS client will never be used.

If this policy is left not set, the users will be able to change whether the built-in DNS client is used by editing chrome://flags or specifying a command-line flag.</string>
			<key>pfm_name</key>
			<string>BuiltInDnsClientEnabled</string>
			<key>pfm_title</key>
			<string>Use built-in DNS client</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disables enforcing Certificate Transparency requirements for a list of subjectPublicKeyInfo hashes.</string>
			<key>pfm_description_reference</key>
			<string>Disables enforcing Certificate Transparency requirements for a list of subjectPublicKeyInfo hashes.

This policy allows disabling Certificate Transparency disclosure requirements for certificate chains that contain certificates with one of the specified subjectPublicKeyInfo hashes. This allows certificates that would otherwise be untrusted, because they were not properly publicly disclosed, to continue to be used for Enterprise hosts.

In order for Certificate Transparency enforcement to be disabled when this policy is set, one of the following conditions must be met:
1. The hash is of the server certificate's subjectPublicKeyInfo.
2. The hash is of a subjectPublicKeyInfo that appears in a CA certificate in the certificate chain, that CA certificate is constrained via the X.509v3 nameConstraints extension, one or more directoryName nameConstraints are present in the permittedSubtrees, and the directoryName contains an organizationName attribute.
3. The hash is of a subjectPublicKeyInfo that appears in a CA certificate in the certificate chain, the CA certificate has one or more organizationName attributes in the certificate Subject, and the server's certificate contains the same number of organizationName attributes, in the same order, and with byte-for-byte identical values.

A subjectPublicKeyInfo hash is specified by concatenating the hash algorithm name, the "/" character, and the Base64 encoding of that hash algorithm applied to the DER-encoded subjectPublicKeyInfo of the specified certificate. This Base64 encoding is the same format as an SPKI Fingerprint, as defined in RFC 7469, Section 2.4. Unrecognized hash algorithms are ignored. The only supported hash algorithm at this time is "sha256".

If this policy is not set, any certificate that is required to be disclosed via Certificate Transparency will be treated as untrusted if it is not disclosed according to the Certificate Transparency policy.</string>
			<key>pfm_name</key>
			<string>CertificateTransparencyEnforcementDisabledForCas</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Disable Certificate Transparency enforcement for a list of subjectPublicKeyInfo hashes</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disables enforcing Certificate Transparency requirements for a list of Legacy Certificate Authorities.</string>
			<key>pfm_description_reference</key>
			<string>Disables enforcing Certificate Transparency requirements for a list of Legacy Certificate Authorities.

This policy allows disabling Certificate Transparency disclosure requirements for certificate chains that contain certificates with one of the specified subjectPublicKeyInfo hashes. This allows certificates that would otherwise be untrusted, because they were not properly publicly disclosed, to continue to be used for Enterprise hosts.

In order for Certificate Transparency enforcement to be disabled when this policy is set, the hash must be of a subjectPublicKeyInfo appearing in a CA certificate that is recognized as a Legacy Certificate Authority (CA). A Legacy CA is a CA that has been publicly trusted by default one or more operating systems supported by Google Chrome, but is not trusted by the Android Open Source Project or Google Chrome OS.

A subjectPublicKeyInfo hash is specified by concatenating the hash algorithm name, the "/" character, and the Base64 encoding of that hash algorithm applied to the DER-encoded subjectPublicKeyInfo of the specified certificate. This Base64 encoding is the same format as an SPKI Fingerprint, as defined in RFC 7469, Section 2.4. Unrecognized hash algorithms are ignored. The only supported hash algorithm at this time is "sha256".

If this policy is not set, any certificate that is required to be disclosed via Certificate Transparency will be treated as untrusted if it is not disclosed according to the Certificate Transparency policy.</string>
			<key>pfm_name</key>
			<string>CertificateTransparencyEnforcementDisabledForLegacyCas</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Disable Certificate Transparency enforcement for a list of Legacy Certificate Authorities</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disables enforcing Certificate Transparency requirements to the listed URLs.</string>
			<key>pfm_description_reference</key>
			<string>Disables enforcing Certificate Transparency requirements to the listed URLs.

This policy allows certificates for the hostnames in the specified URLs to not be disclosed via Certificate Transparency. This allows certificates that would otherwise be untrusted, because they were not properly publicly disclosed, to continue to be used, but makes it harder to detect misissued certificates for those hosts.

A URL pattern is formatted according to https://www.chromium.org/administrators/url-blacklist-filter-format. However, because certificates are valid for a given hostname independent of the scheme, port, or path, only the hostname portion of the URL is considered. Wildcard hosts are not supported.

If this policy is not set, any certificate that is required to be disclosed via Certificate Transparency will be treated as untrusted if it is not disclosed according to the Certificate Transparency policy.</string>
			<key>pfm_name</key>
			<string>CertificateTransparencyEnforcementDisabledForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Disable Certificate Transparency enforcement for a list of URLs</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables Google Chrome to act as a proxy between Google Cloud Print and legacy printers connected to the machine.</string>
			<key>pfm_description_reference</key>
			<string>Enables Google Chrome to act as a proxy between Google Cloud Print and legacy printers connected to the machine.

If this setting is enabled or not configured, users can enable the cloud print proxy by authentication with their Google account.

If this setting is disabled, users cannot enable the proxy, and the machine will not be allowed to share it's printers with Google Cloud Print.</string>
			<key>pfm_name</key>
			<string>CloudPrintProxyEnabled</string>
			<key>pfm_title</key>
			<string>Enable Google Cloud Print proxy</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables Google Chrome to submit documents to Google Cloud Print for printing.  NOTE: This only affects Google Cloud Print support in Google Chrome.  It does not prevent users from submitting print jobs on web sites.</string>
			<key>pfm_description_reference</key>
			<string>Enables Google Chrome to submit documents to Google Cloud Print for printing.  NOTE: This only affects Google Cloud Print support in Google Chrome.  It does not prevent users from submitting print jobs on web sites.

If this setting is enabled or not configured, users can print to Google Cloud Print from the Google Chrome print dialog.

If this setting is disabled, users cannot print to Google Cloud Print from the Google Chrome print dialog</string>
			<key>pfm_name</key>
			<string>CloudPrintSubmitEnabled</string>
			<key>pfm_title</key>
			<string>Enable submission of documents to Google Cloud Print</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables component updates for all components in Google Chrome when not set or set to True.</string>
			<key>pfm_description_reference</key>
			<string>Enables component updates for all components in Google Chrome when not set or set to True.

If set to False, updates to components are disabled. However, some components are exempt from this policy: updates to any component that does not contain executable code, or does not significantly alter the behavior of the browser, or is critical for its security will not be disabled.
Examples of such components include the certificate revocation lists and Safe Browsing data.
See https://developers.google.com/safe-browsing for more info on Safe Browsing.</string>
			<key>pfm_name</key>
			<string>ComponentUpdatesEnabled</string>
			<key>pfm_title</key>
			<string>Enable component updates in Google Chrome</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to set cookies.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to set cookies.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultCookiesSetting' policy if it is set, or the user's personal configuration otherwise.

See also policies 'CookiesBlockedForUrls' and 'CookiesSessionOnlyForUrls'. Note that there must be no conflicting URL patterns between these three policies - it is unspecified which policy takes precedence.</string>
			<key>pfm_name</key>
			<string>CookiesAllowedForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allow cookies on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are not allowed to set cookies.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are not allowed to set cookies.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultCookiesSetting' policy if it is set, or the user's personal configuration otherwise.

See also policies 'CookiesAllowedForUrls' and 'CookiesSessionOnlyForUrls'. Note that there must be no conflicting URL patterns between these three policies - it is unspecified which policy takes precedence.</string>
			<key>pfm_name</key>
			<string>CookiesBlockedForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Block cookies on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Cookies set by pages matching these URL patterns will be limited to the current session, i.e. they will be deleted when the browser exits.</string>
			<key>pfm_description_reference</key>
			<string>Cookies set by pages matching these URL patterns will be limited to the current session, i.e. they will be deleted when the browser exits.

For URLs not covered by the patterns specified here, or for all URLs if this policy is not set, the global default value will be used either from the 'DefaultCookiesSetting' policy, if it is set, or the user's personal configuration otherwise.

Note that if Google Chrome is running in 'background mode', the session may not be closed when the last browser window is closed, but will instead stay active until the browser exits. Please see the 'BackgroundModeEnabled' policy for more information about configuring this behavior.

See also policies 'CookiesAllowedForUrls' and 'CookiesBlockedForUrls'. Note that there must be no conflicting URL patterns between these three policies - it is unspecified which policy takes precedence.

If the "RestoreOnStartup" policy is set to restore URLs from previous sessions this policy will not be respected and cookies will be stored permanently for those sites.</string>
			<key>pfm_name</key>
			<string>CookiesSessionOnlyForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Limit cookies from matching URLs to the current session</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the default browser checks in Google Chrome and prevents users from changing them.</string>
			<key>pfm_description_reference</key>
			<string>Configures the default browser checks in Google Chrome and prevents users from changing them.

If you enable this setting, Google Chrome will always check on startup whether it is the default browser and automatically register itself if possible.

If this setting is disabled, Google Chrome will never check if it is the default browser and will disable user controls for setting this option.

If this setting is not set, Google Chrome will allow the user to control whether it is the default browser and whether user notifications should be shown when it isn't.</string>
			<key>pfm_name</key>
			<string>DefaultBrowserSettingEnabled</string>
			<key>pfm_title</key>
			<string>Set Google Chrome as Default Browser</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set whether websites are allowed to set local data. Setting local data can be either allowed for all websites or denied for all websites.</string>
			<key>pfm_description_reference</key>
			<string>1 - Allow all sites to set local data
2 - Do not allow any site to set local data
4 - Keep cookies for the duration of the session
Allows you to set whether websites are allowed to set local data. Setting local data can be either allowed for all websites or denied for all websites.

If this policy is set to 'Keep cookies for the duration of the session' then cookies will be cleared when the session closes. Note that if Google Chrome is running in 'background mode', the session may not close when the last window is closed. Please see the 'BackgroundModeEnabled' policy for more information about configuring this behavior.

If this policy is left not set, 'AllowCookies' will be used and the user will be able to change it.</string>
			<key>pfm_name</key>
			<string>DefaultCookiesSetting</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
				<integer>4</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Allow all sites to set local data</string>
				<string>Do not allow any site to set local data</string>
				<string>Keep cookies for the duration of the session</string>
			</array>
			<key>pfm_title</key>
			<string>Default cookies setting</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the default directory that Google Chrome will use for downloading files.</string>
			<key>pfm_description_reference</key>
			<string>Configures the default directory that Google Chrome will use for downloading files.

If you set this policy, it will change the default directory that Google Chrome downloads files to. This policy is not mandatory, so the user will be able to change the directory.

If you do not set this policy, Google Chrome will use its usual default directory (platform-specific).

See https://www.chromium.org/administrators/policy-list-3/user-data-directory-variables for a list of variables that can be used.</string>
			<key>pfm_name</key>
			<string>DefaultDownloadDirectory</string>
			<key>pfm_title</key>
			<string>Set default download directory</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set whether websites are allowed to track the users' physical location. Tracking the users' physical location can be allowed by default, denied by default or the user can be asked every time a website requests the physical location.</string>
			<key>pfm_description_reference</key>
			<string>1 - Allow sites to track the users' physical location
2 - Do not allow any site to track the users' physical location
3 - Ask whenever a site wants to track the users' physical location
Allows you to set whether websites are allowed to track the users' physical location. Tracking the users' physical location can be allowed by default, denied by default or the user can be asked every time a website requests the physical location.

If this policy is left not set, 'AskGeolocation' will be used and the user will be able to change it.</string>
			<key>pfm_name</key>
			<string>DefaultGeolocationSetting</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Allow sites to track the users' physical location</string>
				<string>Do not allow any site to track the users' physical location</string>
				<string>Ask whenever a site wants to track the users' physical location</string>
			</array>
			<key>pfm_title</key>
			<string>Default geolocation setting</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set whether websites are allowed to display images. Displaying images can be either allowed for all websites or denied for all websites.</string>
			<key>pfm_description_reference</key>
			<string>1 - Allow all sites to show all images
2 - Do not allow any site to show images
Allows you to set whether websites are allowed to display images. Displaying images can be either allowed for all websites or denied for all websites.

If this policy is left not set, 'AllowImages' will be used and the user will be able to change it.

Note that previously this policy was erroneously enabled on Android, but this functionality has never been fully supported on Android.</string>
			<key>pfm_name</key>
			<string>DefaultImagesSetting</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Allow all sites to show all images</string>
				<string>Do not allow any site to show images</string>
			</array>
			<key>pfm_title</key>
			<string>Default images setting</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set whether websites are allowed to run JavaScript. Running JavaScript can be either allowed for all websites or denied for all websites.</string>
			<key>pfm_description_reference</key>
			<string>1 - Allow all sites to run JavaScript
2 - Do not allow any site to run JavaScript
Allows you to set whether websites are allowed to run JavaScript. Running JavaScript can be either allowed for all websites or denied for all websites.

If this policy is left not set, 'AllowJavaScript' will be used and the user will be able to change it.</string>
			<key>pfm_name</key>
			<string>DefaultJavaScriptSetting</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Allow all sites to run JavaScript</string>
				<string>Do not allow any site to run JavaScript</string>
			</array>
			<key>pfm_title</key>
			<string>Default JavaScript setting</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set whether websites are allowed to display desktop notifications. Displaying desktop notifications can be allowed by default, denied by default or the user can be asked every time a website wants to show desktop notifications.</string>
			<key>pfm_description_reference</key>
			<string>1 - Allow sites to show desktop notifications
2 - Do not allow any site to show desktop notifications
3 - Ask every time a site wants to show desktop notifications
Allows you to set whether websites are allowed to display desktop notifications. Displaying desktop notifications can be allowed by default, denied by default or the user can be asked every time a website wants to show desktop notifications.

If this policy is left not set, 'AskNotifications' will be used and the user will be able to change it.</string>
			<key>pfm_name</key>
			<string>DefaultNotificationsSetting</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Allow sites to show desktop notifications</string>
				<string>Do not allow any site to show desktop notifications</string>
				<string>Ask every time a site wants to show desktop notifications</string>
			</array>
			<key>pfm_title</key>
			<string>Default notification setting</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set whether websites are allowed to automatically run the Flash plugin. Automatically running the Flash plugin can be either allowed for all websites or denied for all websites.</string>
			<key>pfm_description_reference</key>
			<string>1 - Allow all sites to automatically run the Flash plugin
2 - Block the Flash plugin
3 - Click to play
Allows you to set whether websites are allowed to automatically run the Flash plugin. Automatically running the Flash plugin can be either allowed for all websites or denied for all websites.

Click to play allows the Flash plugin to run but the user must click on the placeholder to start its execution.

Automatic playback is only allowed for domains explictly listed in the PluginsAllowedForUrls policy. If you want to enabled automatic playback for all sites consider adding http://* and https://* to this list.

If this policy is left not set, the user will be able to change this setting manually.</string>
			<key>pfm_name</key>
			<string>DefaultPluginsSetting</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Allow all sites to automatically run the Flash plugin</string>
				<string>Block the Flash plugin</string>
				<string>Click to play</string>
			</array>
			<key>pfm_title</key>
			<string>Default Flash setting</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set whether websites are allowed to show pop-ups. Showing popups can be either allowed for all websites or denied for all websites.</string>
			<key>pfm_description_reference</key>
			<string>1 - Allow all sites to show pop-ups
2 - Do not allow any site to show popups
Allows you to set whether websites are allowed to show pop-ups. Showing popups can be either allowed for all websites or denied for all websites.

If this policy is left not set, 'BlockPopups' will be used and the user will be able to change it.</string>
			<key>pfm_name</key>
			<string>DefaultPopupsSetting</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Allow all sites to show pop-ups</string>
				<string>Do not allow any site to show popups</string>
			</array>
			<key>pfm_title</key>
			<string>Default popups setting</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Overrides Google Chrome default printer selection rules.</string>
			<key>pfm_description_reference</key>
			<string>Overrides Google Chrome default printer selection rules.

This policy determines the rules for selecting the default printer in Google Chrome which happens the first time the print function is used with a profile.

When this policy is set, Google Chrome will attempt to find a printer matching all of the specified attributes, and select it as default printer. The first printer found matching the policy is selected, in case of non-unique match any matching printer can be selected, depending on the order printers are discovered.

If this policy is not set or matching printer is not found within the timeout, the printer defaults to built-in PDF printer or no printer selected, when PDF printer is not available.

The value is parsed as JSON object, conforming to the following schema:
{
  "type": "object",
  "properties": {
    "kind": {
      "description": "Whether to limit the search of the matching printer to a specific set of printers.",
      "type": "string",
      "enum": [ "local", "cloud" ]
    },
    "idPattern": {
      "description": "Regular expression to match printer id.",
      "type": "string"
    },
    "namePattern": {
      "description": "Regular expression to match printer display name.",
      "type": "string"
    }
  }
}

Printers connected to Google Cloud Print are considered "cloud", the rest of the printers are classified as "local".
Omitting a field means all values match, for example, not specifying connectivity will cause Print Preview to initiate the discovery of all kinds of printers, local and cloud.
Regular expression patterns must follow the JavaScript RegExp syntax and matches are case sensistive.</string>
			<key>pfm_name</key>
			<string>DefaultPrinterSelection</string>
			<key>pfm_title</key>
			<string>Default printer selection rules</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies a list of alternate URLs that can be used to extract search terms from the search engine. The URLs should contain the string '{searchTerms}', which will be used to extract the search terms.</string>
			<key>pfm_description_reference</key>
			<string>Specifies a list of alternate URLs that can be used to extract search terms from the search engine. The URLs should contain the string '{searchTerms}', which will be used to extract the search terms.

This policy is optional. If not set, no alternate urls will be used to extract search terms.

This policy is only respected if the 'DefaultSearchProviderEnabled' policy is enabled.</string>
			<key>pfm_name</key>
			<string>DefaultSearchProviderAlternateURLs</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>List of alternate URLs for the default search provider</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables the use of a default search provider.</string>
			<key>pfm_description_reference</key>
			<string>Enables the use of a default search provider.

If you enable this setting, a default search is performed when the user types text in the omnibox that is not a URL.

You can specify the default search provider to be used by setting the rest of the default search policies. If these are left empty, the user can choose the default provider.

If you disable this setting, no search is performed when the user enters non-URL text in the omnibox.

If you enable or disable this setting, users cannot change or override this setting in Google Chrome.

If this policy is left not set, the default search provider is enabled, and the user will be able to set the search provider list.

This policy is not available on Windows instances that are not joined
to a Microsoft® Active Directory® domain.</string>
			<key>pfm_name</key>
			<string>DefaultSearchProviderEnabled</string>
			<key>pfm_title</key>
			<string>Enable the default search provider</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the character encodings supported by the search provider. Encodings are code page names like UTF-8, GB2312, and ISO-8859-1. They are tried in the order provided.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the character encodings supported by the search provider. Encodings are code page names like UTF-8, GB2312, and ISO-8859-1. They are tried in the order provided.

This policy is optional. If not set, the default will be used which is UTF-8.

This policy is only respected if the 'DefaultSearchProviderEnabled' policy is enabled.</string>
			<key>pfm_name</key>
			<string>DefaultSearchProviderEncodings</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Default search provider encodings</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the favorite icon URL of the default search provider.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the favorite icon URL of the default search provider.

This policy is optional. If not set, no icon will be present for the search provider.

This policy is only respected if the 'DefaultSearchProviderEnabled' policy is enabled.</string>
			<key>pfm_name</key>
			<string>DefaultSearchProviderIconURL</string>
			<key>pfm_title</key>
			<string>Default search provider icon</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the URL of the search engine used to provide image search. Search requests will be sent using the GET method. If the DefaultSearchProviderImageURLPostParams policy is set then image search requests will use the POST method instead.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the URL of the search engine used to provide image search. Search requests will be sent using the GET method. If the DefaultSearchProviderImageURLPostParams policy is set then image search requests will use the POST method instead.

This policy is optional. If not set, no image search will be used.

This policy is only respected if the 'DefaultSearchProviderEnabled' policy is enabled.</string>
			<key>pfm_name</key>
			<string>DefaultSearchProviderImageURL</string>
			<key>pfm_title</key>
			<string>Parameter providing search-by-image feature for the default search provider</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the parameters used when doing image search with POST. It consists of comma-separated name/value pairs. If a value is a template parameter, like {imageThumbnail} in above example, it will be replaced with real image thumbnail data.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the parameters used when doing image search with POST. It consists of comma-separated name/value pairs. If a value is a template parameter, like {imageThumbnail} in above example, it will be replaced with real image thumbnail data.

This policy is optional. If not set, image search request will be sent using the GET method.

This policy is only respected if the 'DefaultSearchProviderEnabled' policy is enabled.</string>
			<key>pfm_name</key>
			<string>DefaultSearchProviderImageURLPostParams</string>
			<key>pfm_title</key>
			<string>Parameters for image URL which uses POST</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the keyword, which is the shortcut used in the omnibox to trigger the search for this provider.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the keyword, which is the shortcut used in the omnibox to trigger the search for this provider.

This policy is optional. If not set, no keyword will activate the search provider.

This policy is only considered if the 'DefaultSearchProviderEnabled' policy is enabled.</string>
			<key>pfm_name</key>
			<string>DefaultSearchProviderKeyword</string>
			<key>pfm_title</key>
			<string>Default search provider keyword</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the name of the default search provider. If left empty or not set, the host name specified by the search URL will be used.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the name of the default search provider. If left empty or not set, the host name specified by the search URL will be used.

This policy is only considered if the 'DefaultSearchProviderEnabled' policy is enabled.</string>
			<key>pfm_name</key>
			<string>DefaultSearchProviderName</string>
			<key>pfm_title</key>
			<string>Default search provider name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the URL that a search engine uses to provide a new tab page.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the URL that a search engine uses to provide a new tab page.

This policy is optional. If not set, no new tab page will be provided.

This policy is only respected if the 'DefaultSearchProviderEnabled' policy is enabled.</string>
			<key>pfm_name</key>
			<string>DefaultSearchProviderNewTabURL</string>
			<key>pfm_title</key>
			<string>Default search provider new tab page URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the URL of the search engine used when doing a default search. The URL should contain the string '{searchTerms}', which will be replaced at query time by the terms the user is searching for.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the URL of the search engine used when doing a default search. The URL should contain the string '{searchTerms}', which will be replaced at query time by the terms the user is searching for.

Google's search URL can be specified as: '{google:baseURL}search?q={searchTerms}&amp;{google:RLZ}{google:originalQueryForSuggestion}{google:assistedQueryStats}{google:searchFieldtrialParameter}{google:searchClient}{google:sourceId}ie={inputEncoding}'.

This option must be set when the 'DefaultSearchProviderEnabled' policy is enabled and will only be respected if this is the case.</string>
			<key>pfm_name</key>
			<string>DefaultSearchProviderSearchURL</string>
			<key>pfm_title</key>
			<string>Default search provider search URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the parameters used when searching a URL with POST. It consists of comma-separated name/value pairs. If a value is a template parameter, like {searchTerms} in above example, it will be replaced with real search terms data.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the parameters used when searching a URL with POST. It consists of comma-separated name/value pairs. If a value is a template parameter, like {searchTerms} in above example, it will be replaced with real search terms data.

This policy is optional. If not set, search request will be sent using the GET method.

This policy is only respected if the 'DefaultSearchProviderEnabled' policy is enabled.</string>
			<key>pfm_name</key>
			<string>DefaultSearchProviderSearchURLPostParams</string>
			<key>pfm_title</key>
			<string>Parameters for search URL which uses POST</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the URL of the search engine used to provide search suggestions. The URL should contain the string '{searchTerms}', which will be replaced at query time by the text the user has entered so far.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the URL of the search engine used to provide search suggestions. The URL should contain the string '{searchTerms}', which will be replaced at query time by the text the user has entered so far.

This policy is optional. If not set, no suggest URL will be used.

Google's suggest URL can be specified as: '{google:baseURL}complete/search?output=chrome&amp;q={searchTerms}'.

This policy is only respected if the 'DefaultSearchProviderEnabled' policy is enabled.</string>
			<key>pfm_name</key>
			<string>DefaultSearchProviderSuggestURL</string>
			<key>pfm_title</key>
			<string>Default search provider suggest URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the parameters used when doing suggestion search with POST. It consists of comma-separated name/value pairs. If a value is a template parameter, like {searchTerms} in above example, it will be replaced with real search terms data.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the parameters used when doing suggestion search with POST. It consists of comma-separated name/value pairs. If a value is a template parameter, like {searchTerms} in above example, it will be replaced with real search terms data.

This policy is optional. If not set, suggest search request will be sent using the GET method.

This policy is only respected if the 'DefaultSearchProviderEnabled' policy is enabled.</string>
			<key>pfm_name</key>
			<string>DefaultSearchProviderSuggestURLPostParams</string>
			<key>pfm_title</key>
			<string>Parameters for suggest URL which uses POST</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set whether websites are allowed to get access to nearby Bluetooth devices. Access can be completely blocked, or the user can be asked every time a website wants to get access to nearby Bluetooth devices.</string>
			<key>pfm_description_reference</key>
			<string>2 - Do not allow any site to request access to Bluetooth devices via the Web Bluetooth API
3 - Allow sites to ask the user to grant access to a nearby Bluetooth device
Allows you to set whether websites are allowed to get access to nearby Bluetooth devices. Access can be completely blocked, or the user can be asked every time a website wants to get access to nearby Bluetooth devices.

If this policy is left not set, '3' will be used, and the user will be able to change it.</string>
			<key>pfm_name</key>
			<string>DefaultWebBluetoothGuardSetting</string>
			<key>pfm_range_list</key>
			<array>
				<integer>2</integer>
				<integer>3</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Do not allow any site to request access to Bluetooth devices via the Web Bluetooth API</string>
				<string>Allow sites to ask the user to grant access to a nearby Bluetooth device</string>
			</array>
			<key>pfm_title</key>
			<string>Control use of the Web Bluetooth API</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set whether websites are allowed to get access to connected USB devices. Access can be completely blocked, or the user can be asked every time a website wants to get access to connected USB devices.</string>
			<key>pfm_description_reference</key>
			<string>2 - Do not allow any site to request access to USB devices via the WebUSB API
3 - Allow sites to ask the user to grant access to a connected USB device
Allows you to set whether websites are allowed to get access to connected USB devices. Access can be completely blocked, or the user can be asked every time a website wants to get access to connected USB devices.

This policy can be overridden for specific URL patterns using the 'WebUsbAskForUrls' and 'WebUsbBlockedForUrls' policies.

If this policy is left not set, '3' will be used, and the user will be able to change it.</string>
			<key>pfm_name</key>
			<string>DefaultWebUsbGuardSetting</string>
			<key>pfm_range_list</key>
			<array>
				<integer>2</integer>
				<integer>3</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Do not allow any site to request access to USB devices via the WebUSB API</string>
				<string>Allow sites to ask the user to grant access to a connected USB device</string>
			</array>
			<key>pfm_title</key>
			<string>Control use of the WebUSB API</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to control where Developer Tools can be used.</string>
			<key>pfm_description_reference</key>
			<string>0 - Disallow usage of the Developer Tools on extensions installed by enterprise policy, allow usage of the Developer Tools in other contexts
1 - Allow usage of the Developer Tools
2 - Disallow usage of the Developer Tools
Allows you to control where Developer Tools can be used.

If this policy is set to 'DeveloperToolsDisallowedForForceInstalledExtensions' (value 0, which is the default value), the Developer Tools and the JavaScript console can be accessed in general, but they can not be accessed in the context of extensions installed by enterprise policy.
If this policy is set to 'DeveloperToolsAllowed' (value 1), the Developer Tools and the JavaScript console can be accessed and used in all contexts, including the context of extensions installed by enterprise policy.
If this policy is set to 'DeveloperToolsDisallowed' (value 2), the Developer Tools can not be accessed and web-site elements can not be inspected anymore. Any keyboard shortcuts and any menu or context menu entries to open the Developer Tools or the JavaScript Console will be disabled.</string>
			<key>pfm_name</key>
			<string>DeveloperToolsAvailability</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Disallow usage of the Developer Tools on extensions installed by enterprise policy, allow usage of the Developer Tools in other contexts</string>
				<string>Allow usage of the Developer Tools</string>
				<string>Disallow usage of the Developer Tools</string>
			</array>
			<key>pfm_title</key>
			<string>Control where Developer Tools can be used</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enabling this setting prevents web pages from accessing the graphics processing unit (GPU). Specifically, web pages can not access the WebGL API and plugins can not use the Pepper 3D API.</string>
			<key>pfm_description_reference</key>
			<string>Enabling this setting prevents web pages from accessing the graphics processing unit (GPU). Specifically, web pages can not access the WebGL API and plugins can not use the Pepper 3D API.

Disabling this setting or leaving it not set potentially allows web pages to use the WebGL API and plugins to use the Pepper 3D API. The default settings of the browser may still require command line arguments to be passed in order to use these APIs.

If HardwareAccelerationModeEnabled is set to false, Disable3DAPIs is ignored and it is equivalent to Disable3DAPIs being set to true.</string>
			<key>pfm_name</key>
			<string>Disable3DAPIs</string>
			<key>pfm_title</key>
			<string>Disable support for 3D graphics APIs</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies whether the generated Kerberos SPN is based on the canonical DNS name or the original name entered.</string>
			<key>pfm_description_reference</key>
			<string>Specifies whether the generated Kerberos SPN is based on the canonical DNS name or the original name entered.

If you enable this setting, CNAME lookup will be skipped and the server name will be used as entered.

If you disable this setting or leave it not set, the canonical name of the server will be determined via CNAME lookup.</string>
			<key>pfm_name</key>
			<string>DisableAuthNegotiateCnameLookup</string>
			<key>pfm_title</key>
			<string>Disable CNAME lookup when negotiating Kerberos authentication</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Show the system print dialog instead of print preview.</string>
			<key>pfm_description_reference</key>
			<string>Show the system print dialog instead of print preview.

When this setting is enabled, Google Chrome will open the system print dialog instead of the built-in print preview when a user requests a page to be printed.

If this policy is not set or is set to false, print commands trigger the print preview screen.</string>
			<key>pfm_name</key>
			<string>DisablePrintPreview</string>
			<key>pfm_title</key>
			<string>Disable Print Preview</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Safe Browsing service shows a warning page when users navigate to sites that are flagged as potentially malicious. Enabling this setting prevents users from proceeding anyway from the warning page to the malicious site.</string>
			<key>pfm_description_reference</key>
			<string>The Safe Browsing service shows a warning page when users navigate to sites that are flagged as potentially malicious. Enabling this setting prevents users from proceeding anyway from the warning page to the malicious site.

If this setting is disabled or not configured then users can choose to proceed to the flagged site after being shown the warning.

See https://developers.google.com/safe-browsing for more info on Safe Browsing.</string>
			<key>pfm_name</key>
			<string>DisableSafeBrowsingProceedAnyway</string>
			<key>pfm_title</key>
			<string>Disable proceeding from the Safe Browsing warning page</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If enabled, screenshots cannot be taken using keyboard shortcuts or extension APIs.</string>
			<key>pfm_description_reference</key>
			<string>If enabled, screenshots cannot be taken using keyboard shortcuts or extension APIs.

If disabled or not specified, taking screenshots is allowed.</string>
			<key>pfm_name</key>
			<string>DisableScreenshots</string>
			<key>pfm_title</key>
			<string>Disable taking screenshots</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the directory that Google Chrome will use for storing cached files on the disk.</string>
			<key>pfm_description_reference</key>
			<string>Configures the directory that Google Chrome will use for storing cached files on the disk.

If you set this policy, Google Chrome will use the provided directory regardless whether the user has specified the '--disk-cache-dir' flag or not. To avoid data loss or other unexpected errors this policy should not be set to a volume's root directory or to a directory used for other purposes, because Google Chrome manages its contents.

See https://www.chromium.org/administrators/policy-list-3/user-data-directory-variables for a list of variables that can be used.

If this policy is left not set the default cache directory will be used and the user will be able to override it with the '--disk-cache-dir' command line flag.</string>
			<key>pfm_name</key>
			<string>DiskCacheDir</string>
			<key>pfm_title</key>
			<string>Set disk cache directory</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the cache size that Google Chrome will use for storing cached files on the disk.</string>
			<key>pfm_description_reference</key>
			<string>Configures the cache size that Google Chrome will use for storing cached files on the disk.

If you set this policy, Google Chrome will use the provided cache size regardless whether the user has specified the '--disk-cache-size' flag or not. The value specified in this policy is not a hard boundary but rather a suggestion to the caching system, any value below a few megabytes is too small and will be rounded up to a sane minimum.

If the value of this policy is 0, the default cache size will be used but the user will not be able to change it.

If this policy is not set the default size will be used and the user will be able to override it with the --disk-cache-size flag.</string>
			<key>pfm_name</key>
			<string>DiskCacheSize</string>
			<key>pfm_title</key>
			<string>Set disk cache size</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the directory that Google Chrome will use for downloading files.</string>
			<key>pfm_description_reference</key>
			<string>Configures the directory that Google Chrome will use for downloading files.

If you set this policy, Google Chrome will use the provided directory regardless whether the user has specified one or enabled the flag to be prompted for download location every time.

See https://www.chromium.org/administrators/policy-list-3/user-data-directory-variables for a list of variables that can be used.

If this policy is left not set the default download directory will be used and the user will be able to change it.</string>
			<key>pfm_name</key>
			<string>DownloadDirectory</string>
			<key>pfm_title</key>
			<string>Set download directory</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the type of downloads that Google Chrome will completely block, without letting users override the security decision.</string>
			<key>pfm_description_reference</key>
			<string>0 - No special restrictions
1 - Block dangerous downloads
2 - Block potentially dangerous downloads
3 - Block all downloads
Configures the type of downloads that Google Chrome will completely block, without letting users override the security decision.

If you set this policy, Google Chrome will prevent certain types of downloads, and won't let user bypass the security warnings.

When the 'Block dangerous downloads' option is chosen, all downloads are allowed, except for those that carry Safe Browsing warnings.

When the 'Block potentially dangerous downloads' option is chosen, all downloads allowed, except for those that carry Safe Browsing warnings of potentially dangerous downloads.

When the 'Block all downloads' option is chosen, all downloads are blocked.

When this policy is not set, (or the 'No special restrictions' option is chosen), the downloads will go through the usual security restrictions based on Safe Browsing analysis results.

Note that these restrictions apply to downloads triggered from web page content, as well as the 'download link...' context menu option. These restrictions do not apply to the save / download of the currently displayed page, nor does it apply to saving as PDF from the printing options.

See https://developers.google.com/safe-browsing for more info on Safe Browsing.</string>
			<key>pfm_name</key>
			<string>DownloadRestrictions</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>No special restrictions</string>
				<string>Block dangerous downloads</string>
				<string>Block potentially dangerous downloads</string>
				<string>Block all downloads</string>
			</array>
			<key>pfm_title</key>
			<string>Download restrictions</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If you enable this setting, bookmarks can be added, removed or modified. This is the default also when this policy is not set.</string>
			<key>pfm_description_reference</key>
			<string>If you enable this setting, bookmarks can be added, removed or modified. This is the default also when this policy is not set.

If you disable this setting, bookmarks can not be added, removed or modified. Existing bookmarks are still available.</string>
			<key>pfm_name</key>
			<string>EditBookmarksEnabled</string>
			<key>pfm_title</key>
			<string>Enable or disable bookmark editing</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies whether the generated Kerberos SPN should include a non-standard port.</string>
			<key>pfm_description_reference</key>
			<string>Specifies whether the generated Kerberos SPN should include a non-standard port.

If you enable this setting, and a non-standard port (i.e., a port other than 80 or 443) is entered, it will be included in the generated Kerberos SPN.

If you disable this setting or leave it not set, the generated Kerberos SPN will not include a port in any case.</string>
			<key>pfm_name</key>
			<string>EnableAuthNegotiatePort</string>
			<key>pfm_title</key>
			<string>Include non-standard port in Kerberos SPN</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>ExampleDeprecatedFeature_EffectiveUntil20080902 - Enable ExampleDeprecatedFeature API through 2008/09/02
Specify a list of deprecated web platform features to re-enable temporarily.</string>
			<key>pfm_description_reference</key>
			<string>ExampleDeprecatedFeature_EffectiveUntil20080902 - Enable ExampleDeprecatedFeature API through 2008/09/02
Specify a list of deprecated web platform features to re-enable temporarily.

This policy gives administrators the ability to re-enable deprecated web platform features for a limited time. Features are identified by a string tag and the features corresponding to the tags included in the list specified by this policy will get re-enabled.

If this policy is left not set, or the list is empty or does not match one of the supported string tags, all deprecated web platform features will remain disabled.

While the policy itself is supported on the above platforms, the feature it is enabling may be available on fewer platforms. Not all deprecated Web Platform features can be re-enabled. Only the ones explicitly listed below can be for a limited period of time, which is different per feature. The general format of the string tag will be [DeprecatedFeatureName]_EffectiveUntil[yyyymmdd]. As reference, you can find the intent behind the Web Platform feature changes at https://bit.ly/blinkintents.</string>
			<key>pfm_name</key>
			<string>EnableDeprecatedWebPlatformFeatures</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Enable deprecated web platform features for a limited time</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is set to true or is not set, Google Cast will be enabled, and users will be able to launch it from the app menu, page context menus, media controls on Cast-enabled websites, and (if shown) the Cast toolbar icon.</string>
			<key>pfm_description_reference</key>
			<string>If this policy is set to true or is not set, Google Cast will be enabled, and users will be able to launch it from the app menu, page context menus, media controls on Cast-enabled websites, and (if shown) the Cast toolbar icon.

If this policy set to false, Google Cast will be disabled.</string>
			<key>pfm_name</key>
			<string>EnableMediaRouter</string>
			<key>pfm_title</key>
			<string>Enable Google Cast</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>In light of the fact that soft-fail, online revocation checks provide no effective security benefit, they are disabled by default in Google Chrome version 19 and later. By setting this policy to true, the previous behavior is restored and online OCSP/CRL checks will be performed.</string>
			<key>pfm_description_reference</key>
			<string>In light of the fact that soft-fail, online revocation checks provide no effective security benefit, they are disabled by default in Google Chrome version 19 and later. By setting this policy to true, the previous behavior is restored and online OCSP/CRL checks will be performed.

If the policy is not set, or is set to false, then Google Chrome will not perform online revocation checks in Google Chrome 19 and later.</string>
			<key>pfm_name</key>
			<string>EnableOnlineRevocationChecks</string>
			<key>pfm_title</key>
			<string>Whether online OCSP/CRL checks are performed</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>When this setting is enabled, Google Chrome allows SHA-1 signed certificates as long as they successfully validate and chain to a locally-installed CA certificates.</string>
			<key>pfm_description_reference</key>
			<string>When this setting is enabled, Google Chrome allows SHA-1 signed certificates as long as they successfully validate and chain to a locally-installed CA certificates.

Note that this policy depends on the operating system certificate verification stack allowing SHA-1 signatures. If an OS update changes the OS handling of SHA-1 certificates, this policy may no longer have effect.  Further, this policy is intended as a temporary workaround to give enterprises more time to move away from SHA-1.  This policy will be removed on or around January 1st 2019.

If this policy is not set, or it is set to false, then Google Chrome follows the publicly announced SHA-1 deprecation schedule.</string>
			<key>pfm_name</key>
			<string>EnableSha1ForLocalAnchors</string>
			<key>pfm_title</key>
			<string>Whether SHA-1 signed certificates issued by local trust anchors are allowed</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>When this setting is enabled, Google Chrome allows certificates issued by Symantec Corporation's Legacy PKI operations to be trusted if they otherwise successfully validate and chain to a recognized CA certificate.</string>
			<key>pfm_description_reference</key>
			<string>When this setting is enabled, Google Chrome allows certificates issued by Symantec Corporation's Legacy PKI operations to be trusted if they otherwise successfully validate and chain to a recognized CA certificate.

Note that this policy depends on the operating system still recognizing certificates from Symantec's legacy infrastructure. If an OS update changes the OS handling of such certificates, this policy no longer has effect.  Further, this policy is intended as a temporary workaround to give enterprises more time to transition away from legacy Symantec certificates.  This policy will be removed on or around January 1st 2019.

If this policy is not set, or it is set to false, then Google Chrome follows the publicly announced deprecation schedule.

See https://g.co/chrome/symantecpkicerts for more details on this deprecation.</string>
			<key>pfm_name</key>
			<string>EnableSymantecLegacyInfrastructure</string>
			<key>pfm_title</key>
			<string>Whether to enable trust in Symantec Corporation's Legacy PKI Infrastructure</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Controls which app/extension types are allowed to be installed and limits runtime access.</string>
			<key>pfm_description_reference</key>
			<string>Controls which app/extension types are allowed to be installed and limits runtime access.

This setting white-lists the allowed types of extension/apps that can be installed in Google Chrome and which hosts they can interact with. The value is a list of strings, each of which should be one of the following: "extension", "theme", "user_script", "hosted_app", "legacy_packaged_app", "platform_app". See the Google Chrome extensions documentation for more information on these types.

Note that this policy also affects extensions and apps to be force-installed via ExtensionInstallForcelist.

If this setting is configured, extensions/apps which have a type that is not on the list will not be installed.

If this settings is left not-configured, no restrictions on the acceptable extension/app types are enforced.</string>
			<key>pfm_name</key>
			<string>ExtensionAllowedTypes</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Types of extensions/apps that are allowed to be installed</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to specify which extensions the users can NOT install. Extensions already installed will be disabled if blacklisted, without a way for the user to enable them. Once an extension disabled due to the blacklist is removed from it, it will automatically get re-enabled.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to specify which extensions the users can NOT install. Extensions already installed will be disabled if blacklisted, without a way for the user to enable them. Once an extension disabled due to the blacklist is removed from it, it will automatically get re-enabled.

A blacklist value of '*' means all extensions are blacklisted unless they are explicitly listed in the whitelist.

If this policy is left not set the user can install any extension in Google Chrome.</string>
			<key>pfm_name</key>
			<string>ExtensionInstallBlacklist</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Extension IDs the user should be prevented from installing (or * for all)</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies a list of apps and extensions that are installed silently,
without user interaction, and which cannot be uninstalled nor
disabled by the user. All permissions requested by the
apps/extensions are granted implicitly, without user interaction,
including any additional permissions requested by future versions of
the app/extension. Furthermore, permissions are granted for the
enterprise.deviceAttributes and enterprise.platformKeys extension
APIs. (These two APIs are not available to apps/extensions that are
not force-installed.)</string>
			<key>pfm_description_reference</key>
			<string>Specifies a list of apps and extensions that are installed silently,
without user interaction, and which cannot be uninstalled nor
disabled by the user. All permissions requested by the
apps/extensions are granted implicitly, without user interaction,
including any additional permissions requested by future versions of
the app/extension. Furthermore, permissions are granted for the
enterprise.deviceAttributes and enterprise.platformKeys extension
APIs. (These two APIs are not available to apps/extensions that are
not force-installed.)

This policy takes precedence over a potentially conflicting ExtensionInstallBlacklist policy. If an app or extension that previously had been force-installed is removed from this list, it is automatically uninstalled by Google Chrome.

For Windows instances that are not joined to a Microsoft® Active Directory® domain, forced installation is limited to apps and extensions listed in the Chrome Web Store.

Note that the source code of any extension may be altered by users via Developer Tools (potentially rendering the extension dysfunctional). If this is a concern, the DeveloperToolsDisabled policy should be set.

Each list item of the policy is a string that contains an extension ID and, optionally, an "update" URL separated by a semicolon (;). The extension ID is the 32-letter string found e.g. on chrome://extensions when in developer mode. The "update" URL, if specified, should point to an Update Manifest XML document as described at https://developer.chrome.com/extensions/autoupdate. By default, the Chrome Web Store's update URL is used (which currently is "https://clients2.google.com/service/update2/crx"). Note that the "update" URL set in this policy is only used for the initial installation; subsequent updates of the extension employ the update URL indicated in the extension's manifest. Note also that specifying the "update" URL explicitly was mandatory in Google Chrome versions up to and including 67.

For example, gbchcmhmhahfdphkhkmpfmihenigjmpp;https://clients2.google.com/service/update2/crx installs the Chrome Remote Desktop app from the standard Chrome Web Store "update" URL. For more information about hosting extensions, see: https://developer.chrome.com/extensions/hosting.

If this policy is left not set, no apps or extensions are installed automatically and the user can uninstall any app or extension in Google Chrome.</string>
			<key>pfm_name</key>
			<string>ExtensionInstallForcelist</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Extension/App IDs and update URLs to be silently installed</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to specify which URLs are allowed to install extensions, apps, and themes.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to specify which URLs are allowed to install extensions, apps, and themes.

Starting in Google Chrome 21, it is more difficult to install extensions, apps, and user scripts from outside the Chrome Web Store. Previously, users could click on a link to a *.crx file, and Google Chrome would offer to install the file after a few warnings. After Google Chrome 21, such files must be downloaded and dragged onto the Google Chrome settings page. This setting allows specific URLs to have the old, easier installation flow.

Each item in this list is an extension-style match pattern (see https://developer.chrome.com/extensions/match_patterns). Users will be able to easily install items from any URL that matches an item in this list. Both the location of the *.crx file and the page where the download is started from (i.e. the referrer) must be allowed by these patterns.

ExtensionInstallBlacklist takes precedence over this policy. That is, an extension on the blacklist won't be installed, even if it happens from a site on this list.</string>
			<key>pfm_name</key>
			<string>ExtensionInstallSources</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>URL patterns to allow extension, app, and user script installs from</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to specify which extensions are not subject to the blacklist.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to specify which extensions are not subject to the blacklist.

A blacklist value of * means all extensions are blacklisted and users can only install extensions listed in the whitelist.

By default, all extensions are whitelisted, but if all extensions have been blacklisted by policy, the whitelist can be used to override that policy.</string>
			<key>pfm_name</key>
			<string>ExtensionInstallWhitelist</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Extension IDs to exempt from the blacklist</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures extension management settings for Google Chrome. A default configuration can be set for the special ID "*"</string>
			<key>pfm_description_reference</key>
			<string>Configures extension management settings for Google Chrome.

This policy controls multiple settings, including settings controlled by any existing extension-related policies. This policy will override any legacy policies if both are set.

This policy maps an extension ID or an update URL to its configuration. With an extension ID, configuration will be applied to the specified extension only. A default configuration can be set for the special ID "*", which will apply to all extensions that don't have a custom configuration set in this policy. With an update URL, configuration will be applied to all extensions with the exact update URL stated in manifest of this extension, as described at https://developer.chrome.com/extensions/autoupdate.

For a full description of possible settings and structure of this policy please visit https://www.chromium.org/administrators/policy-list-3/extension-settings-full</string>
			<key>pfm_documentation_source</key>
			<string>https://www.chromium.org/administrators/policy-list-3/extension-settings-full</string>
			<key>pfm_name</key>
			<string>ExtensionSettings</string>
			<key>pfm_title</key>
			<string>Extension management settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_description_reference</key>
					<string></string>
					<key>pfm_name</key>
					<string>{{key}}</string>
					<key>pfm_title</key>
					<string>Extension ID</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_description_reference</key>
					<string></string>
					<key>pfm_name</key>
					<string>{{value}}</string>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_hidden</key>
					<string>container</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Maps to a string indicating the installation mode for the extension.</string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_name</key>
							<string>installation_mode</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_range_list</key>
							<array>
								<string>allowed</string>
								<string>blocked</string>
								<string>force_installed</string>
								<string>normal_installed</string>
							</array>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Maps to a string indicating where Chrome can download a force_installed or normal_installed extension.</string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_name</key>
							<string>update_url</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Maps to a list of strings indicating the blocked API permissions for the extension.</string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_name</key>
							<string>blocked_permissions</string>
							<key>pfm_type</key>
							<string>array</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Maps to a version string.</string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_name</key>
							<string>minimum_version_required</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Each item in this list is an extension-style match pattern.</string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_name</key>
							<string>install_sources</string>
							<key>pfm_type</key>
							<string>array</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>This setting whitelists the allowed types of extension/apps that can be installed in Google Chrome.</string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_name</key>
							<string>allowed_types</string>
							<key>pfm_type</key>
							<string>array</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_range_list</key>
									<array>
										<string>extension</string>
										<string>theme</string>
										<string>user_script</string>
										<string>hosted_app</string>
										<string>legacy_packaged_app</string>
										<string>platform_app</string>
									</array>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>This maps to a string specifying the error message to display to users if they're blocked from installing an extension.</string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_name</key>
							<string>blocked_install_message</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Maps to a list of strings representing hosts whose webpages the extension will be blocked from modifying.</string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_name</key>
							<string>runtime_blocked_hosts</string>
							<key>pfm_type</key>
							<string>array</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Maps to a list of strings representing hosts that an extension can interact with regardless of whether they are listed in "runtime_blocked_hosts".</string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_name</key>
							<string>runtime_allowed_hosts</string>
							<key>pfm_type</key>
							<string>array</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is set to true, user has to sign in to Google Chrome with their profile before using the browser. And the default value of BrowserGuestModeEnabled will be set to false. Note that existing unsigned profiles will be locked and inaccessible after enabling this policy. For more information, see help center article.</string>
			<key>pfm_description_reference</key>
			<string>If this policy is set to true, user has to sign in to Google Chrome with their profile before using the browser. And the default value of BrowserGuestModeEnabled will be set to false. Note that existing unsigned profiles will be locked and inaccessible after enabling this policy. For more information, see help center article.

If this policy is set to false or not configured, user can use the browser without sign in to Google Chrome.</string>
			<key>pfm_name</key>
			<string>ForceBrowserSignin</string>
			<key>pfm_title</key>
			<string>Enable force sign in for Google Chrome</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If set to enabled this policy forces the profile to be switched to ephemeral mode. If this policy is specified as an OS policy (e.g. GPO on Windows) it will apply to every profile on the system; if the policy is set as a Cloud policy it will apply only to a profile signed in with a managed account.</string>
			<key>pfm_description_reference</key>
			<string>If set to enabled this policy forces the profile to be switched to ephemeral mode. If this policy is specified as an OS policy (e.g. GPO on Windows) it will apply to every profile on the system; if the policy is set as a Cloud policy it will apply only to a profile signed in with a managed account.

In this mode the profile data is persisted on disk only for the length of the user session. Features like browser history, extensions and their data, web data like cookies and web databases are not preserved after the browser is closed. However this does not prevent the user from downloading any data to disk manually, save pages or print them.

If the user has enabled sync all this data is preserved in their sync profile just like with regular profiles. Incognito mode is also available if not explicitly disabled by policy.

If the policy is set to disabled or left not set signing in leads to regular profiles.</string>
			<key>pfm_name</key>
			<string>ForceEphemeralProfiles</string>
			<key>pfm_title</key>
			<string>Ephemeral profile</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Forces queries in Google Web Search to be done with SafeSearch set to active and prevents users from changing this setting.</string>
			<key>pfm_description_reference</key>
			<string>Forces queries in Google Web Search to be done with SafeSearch set to active and prevents users from changing this setting.

If you enable this setting, SafeSearch in Google Search is always active.

If you disable this setting or do not set a value, SafeSearch in Google Search is not enforced.</string>
			<key>pfm_name</key>
			<string>ForceGoogleSafeSearch</string>
			<key>pfm_title</key>
			<string>Force Google SafeSearch</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enforces a minimum Restricted Mode on YouTube and prevents users from
picking a less restricted mode.</string>
			<key>pfm_description_reference</key>
			<string>0 - Do not enforce Restricted Mode on YouTube
1 - Enforce at least Moderate Restricted Mode on YouTube
2 - Enforce Strict Restricted Mode for YouTube
Enforces a minimum Restricted Mode on YouTube and prevents users from
picking a less restricted mode.

If this setting is set to Strict, Strict Restricted Mode on YouTube is always active.

If this setting is set to Moderate, the user may only pick Moderate Restricted Mode
and Strict Restricted Mode on YouTube, but cannot disable Restricted Mode.

If this setting is set to Off or no value is set, Restricted Mode on YouTube is not enforced by Google Chrome. External policies such as YouTube policies might still enforce Restricted Mode, though.</string>
			<key>pfm_name</key>
			<string>ForceYouTubeRestrict</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Do not enforce Restricted Mode on YouTube</string>
				<string>Enforce at least Moderate Restricted Mode on YouTube</string>
				<string>Enforce Strict Restricted Mode for YouTube</string>
			</array>
			<key>pfm_title</key>
			<string>Force minimum YouTube Restricted Mode</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is set to true or left unset, hardware acceleration will be enabled unless a certain GPU feature is blacklisted.</string>
			<key>pfm_description_reference</key>
			<string>If this policy is set to true or left unset, hardware acceleration will be enabled unless a certain GPU feature is blacklisted.

If this policy is set to false, hardware acceleration will be disabled.</string>
			<key>pfm_name</key>
			<string>HardwareAccelerationModeEnabled</string>
			<key>pfm_title</key>
			<string>Use hardware acceleration when available</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Hide the Chrome Web Store app and footer link from the New Tab Page and Google Chrome OS app launcher.</string>
			<key>pfm_description_reference</key>
			<string>Hide the Chrome Web Store app and footer link from the New Tab Page and Google Chrome OS app launcher.

When this policy is set to true, the icons are hidden.

When this policy is set to false or is not configured, the icons are visible.</string>
			<key>pfm_name</key>
			<string>HideWebStoreIcon</string>
			<key>pfm_title</key>
			<string>Hide the web store from the New Tab Page and app launcher</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the type of the default home page in Google Chrome and prevents users from changing home page preferences. The home page can either be set to a URL you specify or set to the New Tab Page.</string>
			<key>pfm_description_reference</key>
			<string>Configures the type of the default home page in Google Chrome and prevents users from changing home page preferences. The home page can either be set to a URL you specify or set to the New Tab Page.

If you enable this setting, the New Tab Page is always used for the home page, and the home page URL location is ignored.

If you disable this setting, the user's homepage will never be the New Tab Page, unless its URL is set to 'chrome://newtab'.

If you enable or disable this setting, users cannot change their homepage type in Google Chrome.

Leaving this policy not set will allow the user to choose whether the new tab page is their home page on their own.

This policy is not available on Windows instances that are not joined
to a Microsoft® Active Directory® domain.</string>
			<key>pfm_name</key>
			<string>HomepageIsNewTabPage</string>
			<key>pfm_title</key>
			<string>Use New Tab Page as homepage</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the default home page URL in Google Chrome and prevents users from changing it.</string>
			<key>pfm_description_reference</key>
			<string>Configures the default home page URL in Google Chrome and prevents users from changing it.

The home page is the page opened by the Home button. The pages that open on startup are controlled by the RestoreOnStartup policies.

The home page type can either be set to a URL you specify here or set to the New Tab Page. If you select the New Tab Page, then this policy does not take effect.

If you enable this setting, users cannot change their home page URL in Google Chrome, but they can still choose the New Tab Page as their home page.

Leaving this policy not set will allow the user to choose their home page on their own if HomepageIsNewTabPage is not set too.

This policy is not available on Windows instances that are not joined
to a Microsoft® Active Directory® domain.</string>
			<key>pfm_name</key>
			<string>HomepageLocation</string>
			<key>pfm_title</key>
			<string>Home page URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This policy enables HTTP/0.9 on ports other than 80 for HTTP and 443 for HTTPS.</string>
			<key>pfm_description_reference</key>
			<string>This policy enables HTTP/0.9 on ports other than 80 for HTTP and 443 for HTTPS.

This policy is disabled by default, and if enabled, leaves users open to the security issue https://crbug.com/600352.

This policy is intended to give enterprises a chance to migrate exising servers off of HTTP/0.9, and will be removed in the future.

If this policy is not set, HTTP/0.9 will be disabled on non-default ports.</string>
			<key>pfm_name</key>
			<string>Http09OnNonDefaultPortsEnabled</string>
			<key>pfm_title</key>
			<string>Enable HTTP/0.9 support on non-default ports</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to display images.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to display images.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultImagesSetting' policy if it is set, or the user's personal configuration otherwise.

Note that previously this policy was erroneously enabled on Android, but this functionality has never been fully supported on Android.</string>
			<key>pfm_name</key>
			<string>ImagesAllowedForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allow images on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are not allowed to display images.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are not allowed to display images.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultImagesSetting' policy if it is set, or the user's personal configuration otherwise.

Note that previously this policy was erroneously enabled on Android, but this functionality has never been fully supported on Android.</string>
			<key>pfm_name</key>
			<string>ImagesBlockedForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Block images on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This policy forces the autofill form data to be imported from the previous default browser if enabled. If enabled, this policy also affects the import dialog.</string>
			<key>pfm_description_reference</key>
			<string>This policy forces the autofill form data to be imported from the previous default browser if enabled. If enabled, this policy also affects the import dialog.

If disabled, the autofill form data is not imported.

If it is not set, the user may be asked whether to import, or importing may happen automatically.</string>
			<key>pfm_name</key>
			<string>ImportAutofillFormData</string>
			<key>pfm_title</key>
			<string>Import autofill form data from default browser on first run</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This policy forces bookmarks to be imported from the current default browser if enabled. If enabled, this policy also affects the import dialog.</string>
			<key>pfm_description_reference</key>
			<string>This policy forces bookmarks to be imported from the current default browser if enabled. If enabled, this policy also affects the import dialog.

If disabled, no bookmarks are imported.

If it is not set, the user may be asked whether to import, or importing may happen automatically.</string>
			<key>pfm_name</key>
			<string>ImportBookmarks</string>
			<key>pfm_title</key>
			<string>Import bookmarks from default browser on first run</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This policy forces the browsing history to be imported from the current default browser if enabled. If enabled, this policy also affects the import dialog.</string>
			<key>pfm_description_reference</key>
			<string>This policy forces the browsing history to be imported from the current default browser if enabled. If enabled, this policy also affects the import dialog.

If disabled, no browsing history is imported.

If it is not set, the user may be asked whether to import, or importing may happen automatically.</string>
			<key>pfm_name</key>
			<string>ImportHistory</string>
			<key>pfm_title</key>
			<string>Import browsing history from default browser on first run</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This policy forces the home page to be imported from the current default browser if enabled.</string>
			<key>pfm_description_reference</key>
			<string>This policy forces the home page to be imported from the current default browser if enabled.

If disabled, the home page is not imported.

If it is not set, the user may be asked whether to import, or importing may happen automatically.</string>
			<key>pfm_name</key>
			<string>ImportHomepage</string>
			<key>pfm_title</key>
			<string>Import of homepage from default browser on first run</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This policy forces the saved passwords to be imported from the previous default browser if enabled. If enabled, this policy also affects the import dialog.</string>
			<key>pfm_description_reference</key>
			<string>This policy forces the saved passwords to be imported from the previous default browser if enabled. If enabled, this policy also affects the import dialog.

If disabled, the saved passwords are not imported.

If it is not set, the user may be asked whether to import, or importing may happen automatically.</string>
			<key>pfm_name</key>
			<string>ImportSavedPasswords</string>
			<key>pfm_title</key>
			<string>Import saved passwords from default browser on first run</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This policy forces search engines to be imported from the current default browser if enabled. If enabled, this policy also affects the import dialog.</string>
			<key>pfm_description_reference</key>
			<string>This policy forces search engines to be imported from the current default browser if enabled. If enabled, this policy also affects the import dialog.

If disabled, the default search engine is not imported.

If it is not set, the user may be asked whether to import, or importing may happen automatically.</string>
			<key>pfm_name</key>
			<string>ImportSearchEngine</string>
			<key>pfm_title</key>
			<string>Import search engines from default browser on first run</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies whether the user may open pages in Incognito mode in Google Chrome.</string>
			<key>pfm_description_reference</key>
			<string>0 - Incognito mode available
1 - Incognito mode disabled
2 - Incognito mode forced
Specifies whether the user may open pages in Incognito mode in Google Chrome.

If 'Enabled' is selected or the policy is left unset, pages may be opened in Incognito mode.

If 'Disabled' is selected, pages may not be opened in Incognito mode.

If 'Forced' is selected, pages may be opened ONLY in Incognito mode.</string>
			<key>pfm_name</key>
			<string>IncognitoModeAvailability</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Incognito mode available</string>
				<string>Incognito mode disabled</string>
				<string>Incognito mode forced</string>
			</array>
			<key>pfm_title</key>
			<string>Incognito mode availability</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If the policy is enabled, each of the named origins in a
comma-separated list will run in its own process. This will also isolate
origins named by subdomains; e.g. specifying https://example.com/ will
also cause https://foo.example.com/ to be isolated as part of the
https://example.com/ site.
If the policy is disabled, no explicit Site Isolation will happen and field trials of IsolateOrigins and SitePerProcess will be disabled. Users will still be able to enable IsolateOrigins manually.
If the policy is not configured, the user will be able to change this setting.
On Google Chrome OS, it is recommended to also set the DeviceLoginScreenIsolateOrigins device policy to the same value. If the values specified by the two policies don't match, a delay may be incurred when entering a user session while the value specified by user policy is being applied.</string>
			<key>pfm_description_reference</key>
			<string>If the policy is enabled, each of the named origins in a
comma-separated list will run in its own process. This will also isolate
origins named by subdomains; e.g. specifying https://example.com/ will
also cause https://foo.example.com/ to be isolated as part of the
https://example.com/ site.
If the policy is disabled, no explicit Site Isolation will happen and field trials of IsolateOrigins and SitePerProcess will be disabled. Users will still be able to enable IsolateOrigins manually.
If the policy is not configured, the user will be able to change this setting.
On Google Chrome OS, it is recommended to also set the DeviceLoginScreenIsolateOrigins device policy to the same value. If the values specified by the two policies don't match, a delay may be incurred when entering a user session while the value specified by user policy is being applied.

NOTE: This policy does not apply on Android. To enable IsolateOrigins on Android, use the IsolateOriginsAndroid policy setting.</string>
			<key>pfm_name</key>
			<string>IsolateOrigins</string>
			<key>pfm_title</key>
			<string>Enable Site Isolation for specified origins</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to run JavaScript.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to run JavaScript.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultJavaScriptSetting' policy if it is set, or the user's personal configuration otherwise.</string>
			<key>pfm_name</key>
			<string>JavaScriptAllowedForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allow JavaScript on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are not allowed to run JavaScript.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are not allowed to run JavaScript.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultJavaScriptSetting' policy if it is set, or the user's personal configuration otherwise.</string>
			<key>pfm_name</key>
			<string>JavaScriptBlockedForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Block JavaScript on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is set, Google Chrome will try to register itself and apply associated cloud policy for all profiles.</string>
			<key>pfm_description_reference</key>
			<string>If this policy is set, Google Chrome will try to register itself and apply associated cloud policy for all profiles.

The value of this policy is an Enrollment token that can be retrieved from the Google Admin console.</string>
			<key>pfm_name</key>
			<string>MachineLevelUserCloudPolicyEnrollmentToken</string>
			<key>pfm_title</key>
			<string>The enrollment token of cloud policy on desktop</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures a list of managed bookmarks.</string>
			<key>pfm_description_reference</key>
			<string>Configures a list of managed bookmarks.

The policy consists of a list of bookmarks whereas each bookmark is a dictionary containing the keys "name" and "url" which hold the bookmark's name and its target. A subfolder may be configured by defining a bookmark without an "url" key but with an additional "children" key which itself contains a list of bookmarks as defined above (some of which may be folders again). Google Chrome amends incomplete URLs as if they were submitted via the Omnibox, for example "google.com" becomes "https://google.com/".

These bookmarks are placed in a folder that can't be modified by the user (but the user can choose to hide it from the bookmark bar). By default the folder name is "Managed bookmarks" but it can be customized by adding to the list of bookmarks a dictionary containing the key "toplevel_name" with the desired folder name as the value.

Managed bookmarks are not synced to the user account and can't be modified by extensions.</string>
			<key>pfm_name</key>
			<string>ManagedBookmarks</string>
			<key>pfm_title</key>
			<string>Managed Bookmarks</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>ManagedBookmark</string>
					<key>pfm_title</key>
					<string></string>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Name of the bookmark.</string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_name</key>
							<string>name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>URL for the bookmark.</string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_name</key>
							<string>url</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<!--
						<dict>
							<key>pfm_description</key>
							<string>Folder contents</string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_name</key>
							<string>children</string>
							<key>pfm_type</key>
							<string>array</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string></string>
									<key>pfm_name</key>
									<string>ManagedBookmark</string>
									<key>pfm_title</key>
									<string></string>
									<key>pfm_type</key>
									<string>dictionary</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>Name of the bookmark.</string>
											<key>pfm_description_reference</key>
											<string></string>
											<key>pfm_name</key>
											<string>name</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_description</key>
											<string>URL for the bookmark.</string>
											<key>pfm_description_reference</key>
											<string></string>
											<key>pfm_name</key>
											<string>url</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
								</dict>
							</array>
						</dict>
							-->
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the maximal number of simultaneous connections to the proxy server.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the maximal number of simultaneous connections to the proxy server.

Some proxy servers can not handle high number of concurrent connections per client and this can be solved by setting this policy to a lower value.

The value of this policy should be lower than 100 and higher than 6 and the default value is 32.

Some web apps are known to consume many connections with hanging GETs, so lowering below 32 may lead to browser networking hangs if too many such web apps are open. Lower below the default at your own risk.

If this policy is left not set the default value will be used which is 32.</string>
			<key>pfm_name</key>
			<string>MaxConnectionsPerProxy</string>
			<key>pfm_title</key>
			<string>Maximal number of concurrent connections to the proxy server</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the maximum delay in milliseconds between receiving a policy invalidation and fetching the new policy from the device management service.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the maximum delay in milliseconds between receiving a policy invalidation and fetching the new policy from the device management service.

Setting this policy overrides the default value of 5000 milliseconds. Valid values for this policy are in the range from 1000 (1 second) to 300000 (5 minutes). Any values not in this range will be clamped to the respective boundary.

Leaving this policy not set will make Google Chrome use the default value of 5000 milliseconds.</string>
			<key>pfm_name</key>
			<string>MaxInvalidationFetchDelay</string>
			<key>pfm_title</key>
			<string>Maximum fetch delay after a policy invalidation</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the cache size that Google Chrome will use for storing cached media files on the disk.</string>
			<key>pfm_description_reference</key>
			<string>Configures the cache size that Google Chrome will use for storing cached media files on the disk.

If you set this policy, Google Chrome will use the provided cache size regardless whether the user has specified the '--media-cache-size' flag or not. The value specified in this policy is not a hard boundary but rather a suggestion to the caching system, any value below a few megabytes is too small and will be rounded up to a sane minimum.

If the value of this policy is 0, the default cache size will be used but the user will not be able to change it.

If this policy is not set the default size will be used and the user will be able to override it with the --media-cache-size flag.</string>
			<key>pfm_name</key>
			<string>MediaCacheSize</string>
			<key>pfm_title</key>
			<string>Set media disk cache size</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is set to true, Google Cast will connect to Cast devices on all IP addresses, not just RFC1918/RFC4913 private addresses.</string>
			<key>pfm_description_reference</key>
			<string>If this policy is set to true, Google Cast will connect to Cast devices on all IP addresses, not just RFC1918/RFC4913 private addresses.

If this policy is set to false, Google Cast will connect to Cast devices on RFC1918/RFC4913 private addresses only.

If this policy is not set, Google Cast will connect to Cast devices on RFC1918/RFC4913 private addresses only, unless the CastAllowAllIPs feature is enabled.

If the policy "EnableMediaRouter" is set to false, then this policy's value would have no effect.</string>
			<key>pfm_name</key>
			<string>MediaRouterCastAllowAllIPs</string>
			<key>pfm_title</key>
			<string>Allow Google Cast to connect to Cast devices on all IP addresses.</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables anonymous reporting of usage and crash-related data about Google Chrome to Google and prevents users from changing this setting.</string>
			<key>pfm_description_reference</key>
			<string>Enables anonymous reporting of usage and crash-related data about Google Chrome to Google and prevents users from changing this setting.

If this setting is enabled, anonymous reporting of usage and crash-related
data is sent to Google.  If it is disabled, this information is not sent
to Google.  In both cases, users cannot change or override the setting.
If this policy is left not set, the setting will be what the user chose
upon installation / first run.

This policy is not available on Windows instances that are not joined to
a Microsoft® Active Directory® domain.  (For Chrome OS, see
DeviceMetricsReportingEnabled.)</string>
			<key>pfm_name</key>
			<string>MetricsReportingEnabled</string>
			<key>pfm_title</key>
			<string>Enable reporting of usage and crash-related data</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to specify which native messaging hosts that should not be loaded.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to specify which native messaging hosts that should not be loaded.

A blacklist value of '*' means all native messaging hosts are blacklisted unless they are explicitly listed in the whitelist.

If this policy is left not set Google Chrome will load all installed native messaging hosts.</string>
			<key>pfm_name</key>
			<string>NativeMessagingBlacklist</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Names of the forbidden native messaging hosts (or * for all)</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables user-level installation of Native Messaging hosts.</string>
			<key>pfm_description_reference</key>
			<string>Enables user-level installation of Native Messaging hosts.

If this setting is enabled then Google Chrome allows usage of Native Messaging hosts installed on user level.

If this setting is disabled then Google Chrome will only use Native Messaging hosts installed on system level.

If this setting is left not set Google Chrome will allow usage of user-level Native Messaging hosts.</string>
			<key>pfm_name</key>
			<string>NativeMessagingUserLevelHosts</string>
			<key>pfm_title</key>
			<string>Allow user-level Native Messaging hosts (installed without admin permissions)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to specify which native messaging hosts are not subject to the blacklist.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to specify which native messaging hosts are not subject to the blacklist.

A blacklist value of * means all native messaging hosts are blacklisted and only native messaging hosts listed in the whitelist will be loaded.

By default, all native messaging hosts are whitelisted, but if all native messaging hosts have been blacklisted by policy, the whitelist can be used to override that policy.</string>
			<key>pfm_name</key>
			<string>NativeMessagingWhitelist</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Names of the native messaging hosts to exempt from the blacklist</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>(Deprecated in 50, removed in 52. After 52, if value 1 is set, it will be treated as 0 - predict network actions on any network connection.)
Enables network prediction in Google Chrome and prevents users from changing this setting.</string>
			<key>pfm_description_reference</key>
			<string>0 - Predict network actions on any network connection
1 - Predict network actions on any network that is not cellular.
(Deprecated in 50, removed in 52. After 52, if value 1 is set, it will be treated as 0 - predict network actions on any network connection.)
2 - Do not predict network actions on any network connection
Enables network prediction in Google Chrome and prevents users from changing this setting.

This controls DNS prefetching, TCP and SSL preconnection and prerendering of web pages.

If you set this policy, users cannot change or override this setting in Google Chrome.

If this policy is left not set, network prediction will be enabled but the user will be able to change it.</string>
			<key>pfm_name</key>
			<string>NetworkPredictionOptions</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Predict network actions on any network connection</string>
				<string>Predict network actions on any network that is not cellular.</string>
				<string>Do not predict network actions on any network connection</string>
			</array>
			<key>pfm_title</key>
			<string>Enable network prediction</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the default New Tab page URL and prevents users from changing it.</string>
			<key>pfm_description_reference</key>
			<string>Configures the default New Tab page URL and prevents users from changing it.

The New Tab page is the page opened when new tabs are created (including the one opened in new windows).

This policy does not decide which pages are to be opened on start up. Those are controlled by the RestoreOnStartup policies. Yet this policy does affect the Home Page if that is set to open the New Tab page, as well as the startup page if that is set to open the New Tab page.

If the policy is not set or left empty the default new tab page is used.

This policy is not available on Windows instances that are not joined to a Microsoft® Active Directory® domain.</string>
			<key>pfm_name</key>
			<string>NewTabPageLocation</string>
			<key>pfm_title</key>
			<string>New Tab page URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to display notifications.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to display notifications.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultNotificationsSetting' policy if it is set, or the user's personal configuration otherwise.</string>
			<key>pfm_name</key>
			<string>NotificationsAllowedForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allow notifications on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are not allowed to display notifications.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are not allowed to display notifications.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultNotificationsSetting' policy if it is set, or the user's personal configuration otherwise.</string>
			<key>pfm_name</key>
			<string>NotificationsBlockedForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Block notifications on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Controls whether NTLMv2 is enabled.</string>
			<key>pfm_description_reference</key>
			<string>Controls whether NTLMv2 is enabled.

All recent versions of Samba and Windows servers support NTLMv2. This should only be disabled for backwards compatibility and reduces the security of authentication.

If this policy is not set, the default is true and NTLMv2 is enabled.</string>
			<key>pfm_name</key>
			<string>NtlmV2Enabled</string>
			<key>pfm_title</key>
			<string>Whether NTLMv2 authentication is enabled.</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The policy specifies a list of origins (URLs) or hostname patterns (such as "*.example.com") to be treated as secure contexts. The intent is to allow organizations to set up a staging server for internal web development, so that their developers can test out features requiring secure contexts without having to deploy TLS on the staging server.
Setting a list of URLs in this policy has the same effect as setting the command-line flag '--unsafely-treat-insecure-origin-as-secure' to a comma-separated list of the same URLs. If the policy is set, it will override the command-line flag.
For more information on secure contexts, see https://www.w3.org/TR/secure-contexts/</string>
			<key>pfm_description_reference</key>
			<string>The policy specifies a list of origins (URLs) or hostname patterns (such as "*.example.com") to be treated as secure contexts. The intent is to allow organizations to set up a staging server for internal web development, so that their developers can test out features requiring secure contexts without having to deploy TLS on the staging server.
Setting a list of URLs in this policy has the same effect as setting the command-line flag '--unsafely-treat-insecure-origin-as-secure' to a comma-separated list of the same URLs. If the policy is set, it will override the command-line flag.
For more information on secure contexts, see https://www.w3.org/TR/secure-contexts/</string>
			<key>pfm_name</key>
			<string>OverrideSecurityRestrictionsOnInsecureOrigin</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Origins or hostname patterns to be treated as secure context.</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Strips privacy and security sensitive parts of https:// URLs before passing them on to PAC scripts (Proxy Auto Config) used by Google Chrome during proxy resolution.</string>
			<key>pfm_description_reference</key>
			<string>Strips privacy and security sensitive parts of https:// URLs before passing them on to PAC scripts (Proxy Auto Config) used by Google Chrome during proxy resolution.

When True, the security feature is enabled, and https:// URLs are
stripped before submitting them to a PAC script. In this manner the PAC
script is not able to view data that is ordinarily protected by an
encrypted channel (such as the URL's path and query).

When False, the security feature is disabled, and PAC scripts are
implicitly granted the ability to view all components of an https://
URL. This applies to all PAC scripts regardless of origin (including
those fetched over an insecure transport, or discovered insecurely
through WPAD).

This defaults to True (security feature enabled), except for Chrome OS
enterprise users for which this currently defaults to False.

It is recommended that this be set to True. The only reason to set it to
False is if it causes a compatibility problem with existing PAC scripts.

The desire is to remove this override in the future.</string>
			<key>pfm_name</key>
			<string>PacHttpsUrlStrippingEnabled</string>
			<key>pfm_title</key>
			<string>Enable PAC URL stripping (for https://)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this setting is enabled, users can have Google Chrome memorize passwords and provide them automatically the next time they log in to a site.</string>
			<key>pfm_description_reference</key>
			<string>If this setting is enabled, users can have Google Chrome memorize passwords and provide them automatically the next time they log in to a site.

If this settings is disabled, users cannot save new passwords but they
may still use passwords that have been saved previously.

If this policy is enabled or disabled, users cannot change or override it in Google Chrome. If this policy is unset, password saving is allowed (but can be turned off by the user).</string>
			<key>pfm_name</key>
			<string>PasswordManagerEnabled</string>
			<key>pfm_title</key>
			<string>Enable saving passwords to the password manager</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configure the change password URL (HTTP and HTTPS schemes only). Password protection service will send users to this URL to change their password after seeing a warning in the browser.
In order for Google Chrome to correctly capture the new password fingerprint on this change password page, please make sure your change password page follows the guidelines on https://www.chromium.org/developers/design-documents/create-amazing-password-forms.</string>
			<key>pfm_description_reference</key>
			<string>Configure the change password URL (HTTP and HTTPS schemes only). Password protection service will send users to this URL to change their password after seeing a warning in the browser.
In order for Google Chrome to correctly capture the new password fingerprint on this change password page, please make sure your change password page follows the guidelines on https://www.chromium.org/developers/design-documents/create-amazing-password-forms.

If this setting is enabled, then password protection service will send users to this URL to change their password after seeing a warning in the browser.
If this setting is disabled or not set, then password protection service will send users to https://myaccounts.google.com to change their password.
This policy is not available on Windows instances that are not joined to a Microsoft® Active Directory® domain.</string>
			<key>pfm_name</key>
			<string>PasswordProtectionChangePasswordURL</string>
			<key>pfm_title</key>
			<string>Configure the change password URL.</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configure the list of enterprise login URLs (HTTP and HTTPS schemes only). Fingerprint of password will be captured on these URLs and used for password reuse detection.
In order for Google Chrome to correctly capture password fingerprints, please make sure your login pages follow the guidelines on https://www.chromium.org/developers/design-documents/create-amazing-password-forms.</string>
			<key>pfm_description_reference</key>
			<string>Configure the list of enterprise login URLs (HTTP and HTTPS schemes only). Fingerprint of password will be captured on these URLs and used for password reuse detection.
In order for Google Chrome to correctly capture password fingerprints, please make sure your login pages follow the guidelines on https://www.chromium.org/developers/design-documents/create-amazing-password-forms.

If this setting is enabled, then password protection service will capture fingerprint of password on these URLs for password reuse detection purpose.
If this setting is disabled or not set, then password protection service will only capture password fingerprint on https://accounts.google.com.
This policy is not available on Windows instances that are not joined to a Microsoft® Active Directory® domain.</string>
			<key>pfm_name</key>
			<string>PasswordProtectionLoginURLs</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Configure the list of enterprise login URLs where password protection service should capture fingerprint of password.</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to control the triggering of passwore protection warning. Password protection alerts users when they reuse their protected password on potentially suspicious sites.</string>
			<key>pfm_description_reference</key>
			<string>0 - Password protection warning is off
1 - Password protection warning is triggered by password reuse
2 - Password protection warning is triggered by password reuse on phishing page
Allows you to control the triggering of passwore protection warning. Password protection alerts users when they reuse their protected password on potentially suspicious sites.

You can use 'PasswordProtectionLoginURLs' and 'PasswordProtectionChangePasswordURL' policies to configure which password to protect.

If this policy is set to 'PasswordProtectionWarningOff', no password protection warning will be shown.
If this policy is set to 'PasswordProtectionWarningOnPasswordReuse', password protection warning will be shown when the user reuses their protected password on a non-whitelisted site.
If this policy is set to 'PasswordProtectionWarningOnPhishingReuse', password protection warning will be shown when the user reuses their protected password on a phishing site.
If this policy is left unset, password protection service will only protect Google passwords but the user will be able to change this setting.</string>
			<key>pfm_name</key>
			<string>PasswordProtectionWarningTrigger</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Password protection warning is off</string>
				<string>Password protection warning is triggered by password reuse</string>
				<string>Password protection warning is triggered by password reuse on phishing page</string>
			</array>
			<key>pfm_title</key>
			<string>Password protection warning trigger</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to run the Flash plugin.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to run the Flash plugin.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultPluginsSetting' policy if it is set, or the user's personal configuration otherwise.</string>
			<key>pfm_name</key>
			<string>PluginsAllowedForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allow the Flash plugin on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are not allowed to run the Flash plugin.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are not allowed to run the Flash plugin.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultPluginsSetting' policy if it is set, or the user's personal configuration otherwise.</string>
			<key>pfm_name</key>
			<string>PluginsBlockedForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Block the Flash plugin on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to open popups.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to open popups.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultPopupsSetting' policy if it is set, or the user's personal configuration otherwise.</string>
			<key>pfm_name</key>
			<string>PopupsAllowedForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allow popups on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are not allowed to open popups.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are not allowed to open popups.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultPopupsSetting' policy if it is set, or the user's personal configuration otherwise.</string>
			<key>pfm_name</key>
			<string>PopupsBlockedForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Block popups on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Causes Google Chrome to use the system default printer as the default choice in Print Preview instead of the most recently used printer.</string>
			<key>pfm_description_reference</key>
			<string>Causes Google Chrome to use the system default printer as the default choice in Print Preview instead of the most recently used printer.

If you disable this setting or do not set a value, Print Preview will use the most recently used printer as the default destination choice.

If you enable this setting, Print Preview will use the OS system default printer as the default destination choice.</string>
			<key>pfm_name</key>
			<string>PrintPreviewUseSystemDefaultPrinter</string>
			<key>pfm_title</key>
			<string>Use System Default Printer as Default</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables printing in Google Chrome and prevents users from changing this setting.</string>
			<key>pfm_description_reference</key>
			<string>Enables printing in Google Chrome and prevents users from changing this setting.

If this setting is enabled or not configured, users can print.

If this setting is disabled, users cannot print from Google Chrome. Printing is disabled in the wrench menu, extensions, JavaScript applications, etc. It is still possible to print from plugins that bypass Google Chrome while printing. For example, certain Flash applications have the print option in their context menu, which is not covered by this policy.</string>
			<key>pfm_name</key>
			<string>PrintingEnabled</string>
			<key>pfm_title</key>
			<string>Enable printing</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to control the presentation of full-tab promotional and/or educational content in Google Chrome.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to control the presentation of full-tab promotional and/or educational content in Google Chrome.

If not configured or enabled (set to true), Google Chrome may show full-tab content to users to provide product information.

If disabled (set to false), Google Chrome will not show full-tab content to users to provide product information.

This setting controls the presentation of the welcome pages that help users sign into Google Chrome, choose it as their default browser, or otherwise inform them of product features.</string>
			<key>pfm_name</key>
			<string>PromotionalTabsEnabled</string>
			<key>pfm_title</key>
			<string>Enable showing full-tab promotional content</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If the policy is enabled, the user will be asked where to save each file before downloading.
If the policy is disabled, downloads will start immediately, and the user will not be asked where to save the file.
If the policy is not configured, the user will be able to change this setting.</string>
			<key>pfm_description_reference</key>
			<string>If the policy is enabled, the user will be asked where to save each file before downloading.
If the policy is disabled, downloads will start immediately, and the user will not be asked where to save the file.
If the policy is not configured, the user will be able to change this setting.</string>
			<key>pfm_name</key>
			<string>PromptForDownloadLocation</string>
			<key>pfm_title</key>
			<string>Ask where to save each file before downloading</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Google Chrome will bypass any proxy for the list of hosts given here.</string>
			<key>pfm_description_reference</key>
			<string>Google Chrome will bypass any proxy for the list of hosts given here.

This policy only takes effect if you have selected manual proxy settings at 'Choose how to specify proxy server settings'.

You should leave this policy not set if you have selected any other mode for setting proxy policies.

For more detailed examples, visit:
https://www.chromium.org/developers/design-documents/network-settings#TOC-Command-line-options-for-proxy-sett.</string>
			<key>pfm_name</key>
			<string>ProxyBypassList</string>
			<key>pfm_title</key>
			<string>Comma-separated list of proxy bypass rules</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to specify the proxy server used by Google Chrome and prevents users from changing proxy settings.</string>
			<key>pfm_description_reference</key>
			<string>direct - Never use a proxy
auto_detect - Auto detect proxy settings
pac_script - Use a .pac proxy script
fixed_servers - Use fixed proxy servers
system - Use system proxy settings
Allows you to specify the proxy server used by Google Chrome and prevents users from changing proxy settings.

If you choose to never use a proxy server and always connect directly, all other options are ignored.

If you choose to use system proxy settings, all other options are ignored.

If you choose to auto detect the proxy server, all other options are ignored.

If you choose fixed server proxy mode, you can specify further options in 'Address or URL of proxy server' and 'Comma-separated list of proxy bypass rules'. Only the HTTP proxy server with the highest priority is available for ARC-apps.

If you choose to use a .pac proxy script, you must specify the URL to the script in 'URL to a proxy .pac file'.

For detailed examples, visit:
https://www.chromium.org/developers/design-documents/network-settings#TOC-Command-line-options-for-proxy-sett.

If you enable this setting, Google Chrome and ARC-apps ignore all proxy-related options specified from the command line.

Leaving this policy not set will allow the users to choose the proxy settings on their own.</string>
			<key>pfm_name</key>
			<string>ProxyMode</string>
			<key>pfm_range_list</key>
			<array>
				<string>direct</string>
				<string>auto_detect</string>
				<string>pac_script</string>
				<string>fixed_servers</string>
				<string>system</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Never use a proxy</string>
				<string>Auto detect proxy settings</string>
				<string>Use a .pac proxy script</string>
				<string>Use fixed proxy servers</string>
				<string>Use system proxy settings</string>
			</array>
			<key>pfm_title</key>
			<string>Choose how to specify proxy server settings</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>You can specify a URL to a proxy .pac file here.</string>
			<key>pfm_description_reference</key>
			<string>You can specify a URL to a proxy .pac file here.

This policy only takes effect if you have selected manual proxy settings at 'Choose how to specify proxy server settings'.

You should leave this policy not set if you have selected any other mode for setting proxy policies.

For detailed examples, visit:
https://www.chromium.org/developers/design-documents/network-settings#TOC-Command-line-options-for-proxy-sett.</string>
			<key>pfm_name</key>
			<string>ProxyPacUrl</string>
			<key>pfm_title</key>
			<string>URL to a proxy .pac file</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>You can specify the URL of the proxy server here.</string>
			<key>pfm_description_reference</key>
			<string>You can specify the URL of the proxy server here.

This policy only takes effect if you have selected manual proxy settings at 'Choose how to specify proxy server settings'.

You should leave this policy not set if you have selected any other mode for setting proxy policies.

For more options and detailed examples, visit:
https://www.chromium.org/developers/design-documents/network-settings#TOC-Command-line-options-for-proxy-sett.</string>
			<key>pfm_name</key>
			<string>ProxyServer</string>
			<key>pfm_title</key>
			<string>Address or URL of proxy server</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is set to true or not set usage of QUIC protocol in Google Chrome is allowed.
If this policy is set to false usage of QUIC protocol is disallowed.</string>
			<key>pfm_description_reference</key>
			<string>If this policy is set to true or not set usage of QUIC protocol in Google Chrome is allowed.
If this policy is set to false usage of QUIC protocol is disallowed.</string>
			<key>pfm_name</key>
			<string>QuicAllowed</string>
			<key>pfm_title</key>
			<string>Allow QUIC protocol</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to register a list of protocol handlers. This can only be a recommended policy. The property |protocol| should be set to the scheme such as 'mailto' and the property |url| should be set to the URL pattern of the application that handles the scheme. The pattern can include a '%s', which if present will be replaced by the handled URL.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to register a list of protocol handlers. This can only be a recommended policy. The property |protocol| should be set to the scheme such as 'mailto' and the property |url| should be set to the URL pattern of the application that handles the scheme. The pattern can include a '%s', which if present will be replaced by the handled URL.

The protocol handlers registered by policy are merged with the ones registered by the user and both are available for use. The user can override the protocol handlers installed by policy by installing a new default handler, but cannot remove a protocol handler registered by policy.</string>
			<key>pfm_name</key>
			<string>RegisteredProtocolHandlers</string>
			<key>pfm_title</key>
			<string>Register protocol handlers</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Notify users that Google Chrome must be relaunched to apply a pending update.</string>
			<key>pfm_description_reference</key>
			<string>1 - Show a recurring prompt to the user indicating that a relaunch is recommended
2 - Show a recurring prompt to the user indicating that a relaunch is required
Notify users that Google Chrome must be relaunched to apply a pending update.

This policy setting enables notifications to inform the user that a browser relaunch is recommended or required. If not set, Google Chrome indicates to the user that a relaunch is needed via subtle changes to its menu. If set to 'Recommended', a recurring warning will be shown to the user that a relaunch is recommended. The user can dismiss this warning to defer the relaunch. If set to 'Required', a recurring warning will be shown to the user indicating that a browser relaunch will be forced once the notification period passes. This period is seven days by default, and may be configured via the RelaunchNotificationPeriod policy setting.

The user's session is restored following the relaunch.</string>
			<key>pfm_name</key>
			<string>RelaunchNotification</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Show a recurring prompt to the user indicating that a relaunch is recommended</string>
				<string>Show a recurring prompt to the user indicating that a relaunch is required</string>
			</array>
			<key>pfm_title</key>
			<string>Notify a user that a browser relaunch is recommended or required</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set the time period, in milliseconds, over which users are notified that Google Chrome must be relaunched or that a Google Chrome OS device must be restarted to apply a pending update.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set the time period, in milliseconds, over which users are notified that Google Chrome must be relaunched or that a Google Chrome OS device must be restarted to apply a pending update.

Over this time period, the user will be repeatedly informed of the need for an update. For Google Chrome OS devices, a restart notification appears in the system tray when an upgrade is detected. This notification changes color once half of the notification period passes, and again once the full notification period has passed. For Google Chrome browsers, the app menu changes to indicate that a relaunch is needed once one third of the notification period passes. This notification changes color once two thirds of the notification period passes, and again once the full notification period has passed. The additional notifications enabled by the RelaunchNotification policy for browsers follow this same schedule.

If not set, the default period of 345600000 milliseconds (four days) is used for Google Chrome OS devices and 604800000 milliseconds (one week) for browsers.</string>
			<key>pfm_name</key>
			<string>RelaunchNotificationPeriod</string>
			<key>pfm_title</key>
			<string>Time period (milliseconds)</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this setting is enabled or not configured, then users can opt to pair clients and hosts at connection time, eliminating the need to enter a PIN every time.</string>
			<key>pfm_description_reference</key>
			<string>If this setting is enabled or not configured, then users can opt to pair clients and hosts at connection time, eliminating the need to enter a PIN every time.

If this setting is disabled, then this feature will not be available.</string>
			<key>pfm_name</key>
			<string>RemoteAccessHostAllowClientPairing</string>
			<key>pfm_title</key>
			<string>Enable or disable PIN-less authentication for remote access hosts</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this setting is enabled, then gnubby authentication requests will be proxied across a remote host connection.</string>
			<key>pfm_description_reference</key>
			<string>If this setting is enabled, then gnubby authentication requests will be proxied across a remote host connection.

If this setting is disabled or not configured, gnubby authentication requests will not be proxied.</string>
			<key>pfm_name</key>
			<string>RemoteAccessHostAllowGnubbyAuth</string>
			<key>pfm_title</key>
			<string>Allow gnubby authentication for remote access hosts</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables usage of relay servers when remote clients are trying to establish a connection to this machine.</string>
			<key>pfm_description_reference</key>
			<string>Enables usage of relay servers when remote clients are trying to establish a connection to this machine.

If this setting is enabled, then remote clients can use relay servers to connect to this machine when a direct connection is not available (e.g. due to firewall restrictions).

Note that if the policy RemoteAccessHostFirewallTraversal is disabled, this policy will be ignored.

If this policy is left not set the setting will be enabled.</string>
			<key>pfm_name</key>
			<string>RemoteAccessHostAllowRelayedConnection</string>
			<key>pfm_title</key>
			<string>Enable the use of relay servers by the remote access host</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the required client domain names that will be imposed on remote access clients and prevents users from changing it.</string>
			<key>pfm_description_reference</key>
			<string>Configures the required client domain names that will be imposed on remote access clients and prevents users from changing it.

If this setting is enabled, then only clients from one of the specified domains can connect to the host.

If this setting is disabled or not set, then the default policy for the connection type is applied. For remote assistance, this allows clients from any domain to connect to the host; for anytime remote access, only the host owner can connect.

This setting will override RemoteAccessHostClientDomain, if present.

See also RemoteAccessHostDomainList.</string>
			<key>pfm_name</key>
			<string>RemoteAccessHostClientDomainList</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Configure the required domain names for remote access clients</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the required host domain names that will be imposed on remote access hosts and prevents users from changing it.</string>
			<key>pfm_description_reference</key>
			<string>Configures the required host domain names that will be imposed on remote access hosts and prevents users from changing it.

If this setting is enabled, then hosts can be shared only using accounts registered on one of the specified domain names.

If this setting is disabled or not set, then hosts can be shared using any account.

This setting will override RemoteAccessHostDomain, if present.

See also RemoteAccessHostClientDomainList.</string>
			<key>pfm_name</key>
			<string>RemoteAccessHostDomainList</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Configure the required domain names for remote access hosts</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables usage of STUN servers when remote clients are trying to establish a connection to this machine.</string>
			<key>pfm_description_reference</key>
			<string>Enables usage of STUN servers when remote clients are trying to establish a connection to this machine.

If this setting is enabled, then remote clients can discover and connect to this machines even if they are separated by a firewall.

If this setting is disabled and outgoing UDP connections are filtered by the firewall, then this machine will only allow connections from client machines within the local network.

If this policy is left not set the setting will be enabled.</string>
			<key>pfm_name</key>
			<string>RemoteAccessHostFirewallTraversal</string>
			<key>pfm_title</key>
			<string>Enable firewall traversal from remote access host</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this setting is enabled, then the remote access host compares the name of the local user (that the host is associated with) and the name of the Google account registered as the host owner (i.e. "johndoe" if the host is owned by "johndoe@example.com" Google account).  The remote access host will not start if the name of the host owner is different from the name of the local user that the host is associated with.  RemoteAccessHostMatchUsername policy should be used together with RemoteAccessHostDomain to also enforce that the Google account of the host owner is associated with a specific domain (i.e. "example.com").</string>
			<key>pfm_description_reference</key>
			<string>If this setting is enabled, then the remote access host compares the name of the local user (that the host is associated with) and the name of the Google account registered as the host owner (i.e. "johndoe" if the host is owned by "johndoe@example.com" Google account).  The remote access host will not start if the name of the host owner is different from the name of the local user that the host is associated with.  RemoteAccessHostMatchUsername policy should be used together with RemoteAccessHostDomain to also enforce that the Google account of the host owner is associated with a specific domain (i.e. "example.com").

If this setting is disabled or not set, then the remote access host can be associated with any local user.</string>
			<key>pfm_name</key>
			<string>RemoteAccessHostMatchUsername</string>
			<key>pfm_title</key>
			<string>Require that the name of the local user and the remote access host owner match</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables curtaining of remote access hosts while a connection is in progress.</string>
			<key>pfm_description_reference</key>
			<string>Enables curtaining of remote access hosts while a connection is in progress.

If this setting is enabled, then hosts' physical input and output devices are disabled while a remote connection is in progress.

If this setting is disabled or not set, then both local and remote users can interact with the host when it is being shared.</string>
			<key>pfm_name</key>
			<string>RemoteAccessHostRequireCurtain</string>
			<key>pfm_title</key>
			<string>Enable curtaining of remote access hosts</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the TalkGadget prefix that will be used by remote access hosts and prevents users from changing it.</string>
			<key>pfm_description_reference</key>
			<string>Configures the TalkGadget prefix that will be used by remote access hosts and prevents users from changing it.

If specified, this prefix is prepended to the base TalkGadget name to create a full domain name for the TalkGadget. The base TalkGadget domain name is '.talkgadget.google.com'.

If this setting is enabled, then hosts will use the custom domain name when accessing the TalkGadget instead of the default domain name.

If this setting is disabled or not set, then the default TalkGadget domain name ('chromoting-host.talkgadget.google.com') will be used for all hosts.

Remote access clients are not affected by this policy setting. They will always use 'chromoting-client.talkgadget.google.com' to access the TalkGadget.</string>
			<key>pfm_name</key>
			<string>RemoteAccessHostTalkGadgetPrefix</string>
			<key>pfm_title</key>
			<string>Configure the TalkGadget prefix for remote access hosts</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is set, the remote access host will require authenticating clients to obtain an authentication token from this URL in order to connect. Must be used in conjunction with RemoteAccessHostTokenValidationUrl.</string>
			<key>pfm_description_reference</key>
			<string>If this policy is set, the remote access host will require authenticating clients to obtain an authentication token from this URL in order to connect. Must be used in conjunction with RemoteAccessHostTokenValidationUrl.

This feature is currently disabled server-side.</string>
			<key>pfm_name</key>
			<string>RemoteAccessHostTokenUrl</string>
			<key>pfm_title</key>
			<string>URL where remote access clients should obtain their authentication token</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is set, the host will use a client certificate with the given issuer CN to authenticate to RemoteAccessHostTokenValidationUrl. Set it to "*" to use any available client certificate.</string>
			<key>pfm_description_reference</key>
			<string>If this policy is set, the host will use a client certificate with the given issuer CN to authenticate to RemoteAccessHostTokenValidationUrl. Set it to "*" to use any available client certificate.

This feature is currently disabled server-side.</string>
			<key>pfm_name</key>
			<string>RemoteAccessHostTokenValidationCertificateIssuer</string>
			<key>pfm_title</key>
			<string>Client certificate for connecting to RemoteAccessHostTokenValidationUrl</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is set, the remote access host will use this URL to validate authentication tokens from remote access clients, in order to accept connections. Must be used in conjunction with RemoteAccessHostTokenUrl.</string>
			<key>pfm_description_reference</key>
			<string>If this policy is set, the remote access host will use this URL to validate authentication tokens from remote access clients, in order to accept connections. Must be used in conjunction with RemoteAccessHostTokenUrl.

This feature is currently disabled server-side.</string>
			<key>pfm_name</key>
			<string>RemoteAccessHostTokenValidationUrl</string>
			<key>pfm_title</key>
			<string>URL for validating remote access client authentication token</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Restricts the UDP port range used by the remote access host in this machine.</string>
			<key>pfm_description_reference</key>
			<string>Restricts the UDP port range used by the remote access host in this machine.

If this policy is left not set, or if it is set to an empty string, the remote access host will be allowed to use any available port, unless the policy RemoteAccessHostFirewallTraversal is disabled, in which case the remote access host will use UDP ports in the 12400-12409 range.</string>
			<key>pfm_name</key>
			<string>RemoteAccessHostUdpPortRange</string>
			<key>pfm_title</key>
			<string>Restrict the UDP port range used by the remote access host</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to specify the behavior on startup.</string>
			<key>pfm_description_reference</key>
			<string>5 - Open New Tab Page
1 - Restore the last session
4 - Open a list of URLs
Allows you to specify the behavior on startup.

If you choose 'Open New Tab Page' the New Tab Page will always be opened when you start Google Chrome.

If you choose 'Restore the last session', the URLs that were open last time Google Chrome was closed will be reopened and the browsing session will be restored as it was left.
Choosing this option disables some settings that rely on sessions or that perform actions on exit (such as Clear browsing data on exit or session-only cookies).

If you choose 'Open a list of URLs', the list of 'URLs to open on startup' will be opened when a user starts Google Chrome.

If you enable this setting, users cannot change or override it in Google Chrome.

Disabling this setting is equivalent to leaving it not configured. The user will still be able to change it in Google Chrome.

This policy is not available on Windows instances that are not joined
to a Microsoft® Active Directory® domain.</string>
			<key>pfm_name</key>
			<string>RestoreOnStartup</string>
			<key>pfm_range_list</key>
			<array>
				<integer>5</integer>
				<integer>1</integer>
				<integer>4</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Open New Tab Page</string>
				<string>Restore the last session</string>
				<string>Open a list of URLs</string>
			</array>
			<key>pfm_title</key>
			<string>Action on startup</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If 'Open a list of URLs' is selected as the startup action, this allows you to specify the list of URLs that are opened. If left not set no URL will be opened on start up.</string>
			<key>pfm_description_reference</key>
			<string>If 'Open a list of URLs' is selected as the startup action, this allows you to specify the list of URLs that are opened. If left not set no URL will be opened on start up.

This policy only works if the 'RestoreOnStartup' policy is set to 'RestoreOnStartupIsURLs'.

This policy is not available on Windows instances that are not joined
to a Microsoft® Active Directory® domain.</string>
			<key>pfm_name</key>
			<string>RestoreOnStartupURLs</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>URLs to open on startup</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Contains a regular expression which is used to determine which users can sign in to Google Chrome.</string>
			<key>pfm_description_reference</key>
			<string>Contains a regular expression which is used to determine which users can sign in to Google Chrome.

An appropriate error is displayed if a user tries to log in with a username that does not match this pattern.

If this policy is left not set or blank, then any user can sign in to Google Chrome.</string>
			<key>pfm_name</key>
			<string>RestrictSigninToPattern</string>
			<key>pfm_title</key>
			<string>Restrict which users are allowed to sign in to Google Chrome</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If you enable this setting, all Flash content embedded on websites that have been set to allow Flash in content settings -- either by the user or by enterprise policy -- will be run, including content from other origins or small content.</string>
			<key>pfm_description_reference</key>
			<string>If you enable this setting, all Flash content embedded on websites that have been set to allow Flash in content settings -- either by the user or by enterprise policy -- will be run, including content from other origins or small content.

To control which websites are allowed to run Flash, see the "DefaultPluginsSetting", "PluginsAllowedForUrls", and "PluginsBlockedForUrls" policies.

If this setting is disabled or not set, Flash content from other origins or small content might be blocked.</string>
			<key>pfm_name</key>
			<string>RunAllFlashInAllowMode</string>
			<key>pfm_title</key>
			<string>Extend Flash content setting to all content</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Chrome shows a warning page when users navigate to sites that have SSL errors. By default or when this policy is set to true, users are allowed to click through these warning pages.
Setting this policy to false disallows users to click through any warning page.</string>
			<key>pfm_description_reference</key>
			<string>Chrome shows a warning page when users navigate to sites that have SSL errors. By default or when this policy is set to true, users are allowed to click through these warning pages.
Setting this policy to false disallows users to click through any warning page.</string>
			<key>pfm_name</key>
			<string>SSLErrorOverrideAllowed</string>
			<key>pfm_title</key>
			<string>Allow proceeding from the SSL warning page</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Warning: The max TLS version policy will be entirely removed from Google Chrome around version 72 (around January 2019).</string>
			<key>pfm_description_reference</key>
			<string>tls1.2 - TLS 1.2
tls1.3 - TLS 1.3
Warning: The max TLS version policy will be entirely removed from Google Chrome around version 72 (around January 2019).

If this policy is not configured then Google Chrome uses the default maximum version.

Otherwise it may be set to one of the following values: "tls1.2" or "tls1.3". When set, Google Chrome will not use SSL/TLS versions greater than the specified version. An unrecognized value will be ignored.</string>
			<key>pfm_name</key>
			<string>SSLVersionMax</string>
			<key>pfm_range_list</key>
			<array>
				<string>tls1.2</string>
				<string>tls1.3</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>TLS 1.2</string>
				<string>TLS 1.3</string>
			</array>
			<key>pfm_title</key>
			<string>Maximum SSL version enabled</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is not configured then Google Chrome uses a default minimum version which is TLS 1.0.</string>
			<key>pfm_description_reference</key>
			<string>tls1 - TLS 1.0
tls1.1 - TLS 1.1
tls1.2 - TLS 1.2
If this policy is not configured then Google Chrome uses a default minimum version which is TLS 1.0.

Otherwise it may be set to one of the following values: "tls1", "tls1.1" or "tls1.2". When set, Google Chrome will not use SSL/TLS versions less than the specified version. An unrecognized value will be ignored.</string>
			<key>pfm_name</key>
			<string>SSLVersionMin</string>
			<key>pfm_range_list</key>
			<array>
				<string>tls1</string>
				<string>tls1.1</string>
				<string>tls1.2</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>TLS 1.0</string>
				<string>TLS 1.1</string>
				<string>TLS 1.2</string>
			</array>
			<key>pfm_title</key>
			<string>Minimum SSL version enabled</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables Google Chrome's Safe Browsing feature and prevents users from changing this setting.</string>
			<key>pfm_description_reference</key>
			<string>Enables Google Chrome's Safe Browsing feature and prevents users from changing this setting.

If you enable this setting, Safe Browsing is always active.

If you disable this setting, Safe Browsing is never active.

If you enable or disable this setting, users cannot change or override the "Enable phishing and malware protection" setting in Google Chrome.

If this policy is left not set, this will be enabled but the user will be able to change it.

See https://developers.google.com/safe-browsing for more info on Safe Browsing.

This policy is not available on Windows instances that are not joined to a Microsoft® Active Directory® domain.</string>
			<key>pfm_name</key>
			<string>SafeBrowsingEnabled</string>
			<key>pfm_title</key>
			<string>Enable Safe Browsing</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables Google Chrome's Safe Browsing Extended Reporting and prevents users from changing this setting.</string>
			<key>pfm_description_reference</key>
			<string>Enables Google Chrome's Safe Browsing Extended Reporting and prevents users from changing this setting.

Extended Reporting sends some system information and page content to Google servers to help detect dangerous apps and sites.

If the setting is set to true, then reports will be created and sent whenever necessary (such as when a security interstitial is shown).

If the setting is set to false, reports will never be sent.

If this policy is set to true or false, the user will not be able to modify the setting.

If this policy is left unset, the user will be able to change the setting and decide whether to send reports or not.

See https://developers.google.com/safe-browsing for more info on Safe Browsing.</string>
			<key>pfm_name</key>
			<string>SafeBrowsingExtendedReportingEnabled</string>
			<key>pfm_title</key>
			<string>Enable Safe Browsing Extended Reporting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configure the list of domains which Safe Browsing will trust. This means:
Safe Browsing will not check for dangerous resources (e.g. phishing, malware, or unwanted software) if their URLs match these domains.
Safe Browsing's download protection service will not check downloads hosted on these domains.
Safe Browsing's password protection service will not check for password reuse if the page URL matches these domains.</string>
			<key>pfm_description_reference</key>
			<string>Configure the list of domains which Safe Browsing will trust. This means:
Safe Browsing will not check for dangerous resources (e.g. phishing, malware, or unwanted software) if their URLs match these domains.
Safe Browsing's download protection service will not check downloads hosted on these domains.
Safe Browsing's password protection service will not check for password reuse if the page URL matches these domains.

If this setting is enabled, then Safe Browsing will trust these domains.
If this setting is disabled or not set, then default Safe Browsing protection is applied to all resources.
This policy is not available on Windows instances that are not joined to a Microsoft® Active Directory® domain.</string>
			<key>pfm_name</key>
			<string>SafeBrowsingWhitelistDomains</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Configure the list of domains on which Safe Browsing will not trigger warnings.</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This policy controls the application of the SafeSites URL filter.
This filter uses the Google Safe Search API to classify URLs as pornographic or not.</string>
			<key>pfm_description_reference</key>
			<string>0 - Do not filter sites for adult content
1 - Filter top level sites (but not embedded iframes) for adult content
This policy controls the application of the SafeSites URL filter.
This filter uses the Google Safe Search API to classify URLs as pornographic or not.

When this policy is not configured or set to "Do not filter sites for adult content", sites will not be filtered.

When this policy is set to "Filter top level sites for adult content", sites classified as pornographic will be filtered.</string>
			<key>pfm_name</key>
			<string>SafeSitesFilterBehavior</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Do not filter sites for adult content</string>
				<string>Filter top level sites (but not embedded iframes) for adult content</string>
			</array>
			<key>pfm_title</key>
			<string>Control SafeSites adult content filtering.</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disables saving browser history in Google Chrome and prevents users from changing this setting.</string>
			<key>pfm_description_reference</key>
			<string>Disables saving browser history in Google Chrome and prevents users from changing this setting.

If this setting is enabled, browsing history is not saved. This setting also disables tab syncing.

If this setting is disabled or not set, browsing history is saved.</string>
			<key>pfm_name</key>
			<string>SavingBrowserHistoryDisabled</string>
			<key>pfm_title</key>
			<string>Disable saving browser history</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables search suggestions in Google Chrome's omnibox and prevents users from changing this setting.</string>
			<key>pfm_description_reference</key>
			<string>Enables search suggestions in Google Chrome's omnibox and prevents users from changing this setting.

If you enable this setting, search suggestions are used.

If you disable this setting, search suggestions are never used.

If you enable or disable this setting, users cannot change or override this setting in Google Chrome.

If this policy is left not set, this will be enabled but the user will be able to change it.</string>
			<key>pfm_name</key>
			<string>SearchSuggestEnabled</string>
			<key>pfm_title</key>
			<string>Enable search suggestions</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies URLs and domains for which no prompt will be shown when attestation certificates from Security Keys are requested. Additionally, a signal will be sent to the Security Key indicating that individual attestation may be used. Without this, users will be prompted in Chrome 65+ when sites request attestation of Security Keys.</string>
			<key>pfm_description_reference</key>
			<string>Specifies URLs and domains for which no prompt will be shown when attestation certificates from Security Keys are requested. Additionally, a signal will be sent to the Security Key indicating that individual attestation may be used. Without this, users will be prompted in Chrome 65+ when sites request attestation of Security Keys.

URLs (like https://example.com/some/path) will only match as U2F appIDs. Domains (like example.com) only match as webauthn RP IDs. Thus, to cover both U2F and webauthn APIs for a given site, both the appID URL and domain would need to be listed.</string>
			<key>pfm_name</key>
			<string>SecurityKeyPermitAttestation</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>URLs/domains automatically permitted direct Security Key attestation</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables or disables the apps shortcut in the bookmark bar.</string>
			<key>pfm_description_reference</key>
			<string>Enables or disables the apps shortcut in the bookmark bar.

If this policy is not set then the user can choose to show or hide the apps shortcut from the bookmark bar context menu.

If this policy is configured then the user can't change it, and the apps shortcut is always shown or never shown.</string>
			<key>pfm_name</key>
			<string>ShowAppsShortcutInBookmarkBar</string>
			<key>pfm_title</key>
			<string>Show the apps shortcut in the bookmark bar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is set to true, the Cast toolbar icon will always be shown on the toolbar or the overflow menu, and users will not be able to remove it.</string>
			<key>pfm_description_reference</key>
			<string>If this policy is set to true, the Cast toolbar icon will always be shown on the toolbar or the overflow menu, and users will not be able to remove it.

If this policy is set to false or is not set, users will be able to pin or remove the icon via its contextual menu.

If the policy "EnableMediaRouter" is set to false, then this policy's value would have no effect, and the toolbar icon would not be shown.</string>
			<key>pfm_name</key>
			<string>ShowCastIconInToolbar</string>
			<key>pfm_title</key>
			<string>Show the Google Cast toolbar icon</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Shows the Home button on Google Chrome's toolbar.</string>
			<key>pfm_description_reference</key>
			<string>Shows the Home button on Google Chrome's toolbar.

If you enable this setting, the Home button is always shown.

If you disable this setting, the Home button is never shown.

If you enable or disable this setting, users cannot change or override this setting in Google Chrome.

Leaving this policy not set will allow the user to choose whether to show the home button.</string>
			<key>pfm_name</key>
			<string>ShowHomeButton</string>
			<key>pfm_title</key>
			<string>Show Home button on toolbar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>You might want to look at the IsolateOrigins policy setting to get the best of both worlds, isolation and limited impact for users, by using IsolateOrigins with a list of the sites you want to isolate. This setting, SitePerProcess, isolates all sites.
If the policy is enabled, each site will run in its own process.
If the policy is disabled, no explicit Site Isolation will happen and field trials of IsolateOrigins and SitePerProcess will be disabled. Users will still be able to enable SitePerProcess manually.
If the policy is not configured, the user will be able to change this setting.
On Google Chrome OS, it is recommended to also set the DeviceLoginScreenSitePerProcess device policy to the same value. If the values specified by the two policies don't match, a delay may be incurred when entering a user session while the value specified by user policy is being applied.</string>
			<key>pfm_description_reference</key>
			<string>You might want to look at the IsolateOrigins policy setting to get the best of both worlds, isolation and limited impact for users, by using IsolateOrigins with a list of the sites you want to isolate. This setting, SitePerProcess, isolates all sites.
If the policy is enabled, each site will run in its own process.
If the policy is disabled, no explicit Site Isolation will happen and field trials of IsolateOrigins and SitePerProcess will be disabled. Users will still be able to enable SitePerProcess manually.
If the policy is not configured, the user will be able to change this setting.
On Google Chrome OS, it is recommended to also set the DeviceLoginScreenSitePerProcess device policy to the same value. If the values specified by the two policies don't match, a delay may be incurred when entering a user session while the value specified by user policy is being applied.

NOTE: This policy does not apply on Android. To enable SitePerProcess on Android, use the SitePerProcessAndroid policy setting.</string>
			<key>pfm_name</key>
			<string>SitePerProcess</string>
			<key>pfm_title</key>
			<string>Enable Site Isolation for every site</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Google Chrome can use a Google web service to help resolve spelling errors. If this setting is enabled, then this service is always used. If this setting is disabled, then this service is never used.</string>
			<key>pfm_description_reference</key>
			<string>Google Chrome can use a Google web service to help resolve spelling errors. If this setting is enabled, then this service is always used. If this setting is disabled, then this service is never used.

Spell checking can still be performed using a downloaded dictionary; this policy only controls the usage of the online service.

If this setting is not configured then users can choose whether the spell checking service should be used or not.</string>
			<key>pfm_name</key>
			<string>SpellCheckServiceEnabled</string>
			<key>pfm_title</key>
			<string>Enable or disable spell checking web service</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If this policy is not set or enabled, the user is allowed to use spellcheck.</string>
			<key>pfm_description_reference</key>
			<string>If this policy is not set or enabled, the user is allowed to use spellcheck.

If this policy is disabled, the user is not allowed to use spellcheck. The SpellcheckLanguage policy will also be ignored when this policy is disabled.</string>
			<key>pfm_name</key>
			<string>SpellcheckEnabled</string>
			<key>pfm_title</key>
			<string>Enable spellcheck</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If set to false, supervised-user creation by this user will be disabled. Any existing supervised users will still be available.</string>
			<key>pfm_description_reference</key>
			<string>If set to false, supervised-user creation by this user will be disabled. Any existing supervised users will still be available.

If set to true or not configured, supervised users can be created and managed by this user.</string>
			<key>pfm_name</key>
			<string>SupervisedUserCreationEnabled</string>
			<key>pfm_title</key>
			<string>Enable creation of supervised users</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Suppresses the warning that appears when Google Chrome is running on a computer or operating system that is no longer supported.</string>
			<key>pfm_description_reference</key>
			<string>Suppresses the warning that appears when Google Chrome is running on a computer or operating system that is no longer supported.</string>
			<key>pfm_name</key>
			<string>SuppressUnsupportedOSWarning</string>
			<key>pfm_title</key>
			<string>Suppress the unsupported OS warning</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disables data synchronization in Google Chrome using Google-hosted synchronization services and prevents users from changing this setting.</string>
			<key>pfm_description_reference</key>
			<string>Disables data synchronization in Google Chrome using Google-hosted synchronization services and prevents users from changing this setting.

If you enable this setting, users cannot change or override this setting in Google Chrome.

If this policy is left not set Google Sync will be available for the user to choose whether to use it or not.

To fully disable Google Sync, it is recommended that you disable the Google Sync service in the Google Admin console.

This policy should not be enabled when RoamingProfileSupportEnabled policy is set to enabled as that feature shares the same client side functionality. The Google-hosted synchronization is disabled in this case completely.</string>
			<key>pfm_name</key>
			<string>SyncDisabled</string>
			<key>pfm_title</key>
			<string>Disable synchronization of data with Google</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If set to false, the 'End process' button is disabled in the Task Manager.</string>
			<key>pfm_description_reference</key>
			<string>If set to false, the 'End process' button is disabled in the Task Manager.

If set to true or not configured, the user can end processes in the Task Manager.</string>
			<key>pfm_name</key>
			<string>TaskManagerEndProcessEnabled</string>
			<key>pfm_title</key>
			<string>Enable ending processes in Task Manager</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables the integrated Google Translate service on Google Chrome.</string>
			<key>pfm_description_reference</key>
			<string>Enables the integrated Google Translate service on Google Chrome.

If you enable this setting, Google Chrome will offer translation functionality to the user by showing an integrated translate toolbar (when appropriate) and a translate option on the right-click context menu.

If you disable this setting, all built-in translate features will be disabled.

If you enable or disable this setting, users cannot change or override this setting in Google Chrome.

If this setting is left not set the user can decide to use this function or not.</string>
			<key>pfm_name</key>
			<string>TranslateEnabled</string>
			<key>pfm_title</key>
			<string>Enable Translate</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This policy prevents the user from loading web pages from blacklisted URLs. The blacklist provides a list of URL patterns that specify which URLs will be blacklisted.</string>
			<key>pfm_description_reference</key>
			<string>This policy prevents the user from loading web pages from blacklisted URLs. The blacklist provides a list of URL patterns that specify which URLs will be blacklisted.

A URL pattern has to be formatted according to https://www.chromium.org/administrators/url-blacklist-filter-format.

Exceptions can be defined in the URL whitelist policy. These policies are limited to 1000 entries; subsequent entries will be ignored.

Note that it is not recommended to block internal 'chrome://*' URLs since this may lead to unexpected errors.

If this policy is not set no URL will be blacklisted in the browser.</string>
			<key>pfm_name</key>
			<string>URLBlacklist</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Block access to a list of URLs</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows access to the listed URLs, as exceptions to the URL blacklist.</string>
			<key>pfm_description_reference</key>
			<string>Allows access to the listed URLs, as exceptions to the URL blacklist.

See the description of the URL blacklist policy for the format of entries of this list.

This policy can be used to open exceptions to restrictive blacklists. For example, '*' can be blacklisted to block all requests, and this policy can be used to allow access to a limited list of URLs. It can be used to open exceptions to certain schemes, subdomains of other domains, ports, or specific paths.

The most specific filter will determine if a URL is blocked or allowed. The whitelist takes precedence over the blacklist.

This policy is limited to 1000 entries; subsequent entries will be ignored.

If this policy is not set there will be no exceptions to the blacklist from the 'URLBlacklist' policy.</string>
			<key>pfm_name</key>
			<string>URLWhitelist</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allow access to a list of URLs</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enable URL-keyed anonymized data collection in Google Chrome and prevents users from changing this setting.</string>
			<key>pfm_description_reference</key>
			<string>Enable URL-keyed anonymized data collection in Google Chrome and prevents users from changing this setting.

URL-keyed anonymized data collection sends URLs of pages the user visits to Google to make searches and browsing better.

If you enable this policy, URL-keyed anonymized data collection is always active.

If you disable this policy, URL-keyed anonymized data collection is never active.

If this policy is left not set, URL-keyed anonymized data collection will be enabled but the user will be able to change it.</string>
			<key>pfm_name</key>
			<string>UrlKeyedAnonymizedDataCollectionEnabled</string>
			<key>pfm_title</key>
			<string>Enable URL-keyed anonymized data collection</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the directory that Google Chrome will use for storing user data.</string>
			<key>pfm_description_reference</key>
			<string>Configures the directory that Google Chrome will use for storing user data.

If you set this policy, Google Chrome will use the provided directory regardless whether the user has specified the '--user-data-dir' flag or not. To avoid data loss or other unexpected errors this policy should not be set to a volume's root directory or to a directory used for other purposes, because Google Chrome manages its contents.

See https://www.chromium.org/administrators/policy-list-3/user-data-directory-variables for a list of variables that can be used.

If this policy is left not set the default profile path will be used and the user will be able to override it with the '--user-data-dir' command line flag.</string>
			<key>pfm_name</key>
			<string>UserDataDir</string>
			<key>pfm_title</key>
			<string>Set user data directory</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If enabled or not configured (default), the user will be prompted for
video capture access except for URLs configured in the
VideoCaptureAllowedUrls list which will be granted access without prompting.</string>
			<key>pfm_description_reference</key>
			<string>If enabled or not configured (default), the user will be prompted for
video capture access except for URLs configured in the
VideoCaptureAllowedUrls list which will be granted access without prompting.

When this policy is disabled, the user will never be prompted and video
capture only be available to URLs configured in VideoCaptureAllowedUrls.

This policy affects all types of video inputs and not only the built-in camera.</string>
			<key>pfm_name</key>
			<string>VideoCaptureAllowed</string>
			<key>pfm_title</key>
			<string>Allow or deny video capture</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Patterns in this list will be matched against the security
origin of the requesting URL.  If a match is found, access to audio
capture devices will be granted without prompt.</string>
			<key>pfm_description_reference</key>
			<string>Patterns in this list will be matched against the security
origin of the requesting URL.  If a match is found, access to audio
capture devices will be granted without prompt.

NOTE: Until version 45, this policy was only supported in Kiosk mode.</string>
			<key>pfm_name</key>
			<string>VideoCaptureAllowedUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>URLs that will be granted access to video capture devices without prompt</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows to turn off WPAD (Web Proxy Auto-Discovery) optimization in Google Chrome.</string>
			<key>pfm_description_reference</key>
			<string>Allows to turn off WPAD (Web Proxy Auto-Discovery) optimization in Google Chrome.

If this policy is set to false, WPAD optimization is disabled causing Google Chrome to wait longer for DNS-based WPAD servers.  If the policy is not set or is enabled, WPAD optimization is enabled.

Independent of whether or how this policy is set, the WPAD optimization setting cannot be changed by users.</string>
			<key>pfm_name</key>
			<string>WPADQuickCheckEnabled</string>
			<key>pfm_title</key>
			<string>Enable WPAD optimization</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This policy allows users of the WebDriver feature to override
policies which can interfere with its operation.</string>
			<key>pfm_description_reference</key>
			<string>This policy allows users of the WebDriver feature to override
policies which can interfere with its operation.

Currently this policy disables SitePerProcess and IsolateOrigins policies.

If the policy is enabled, WebDriver will be able to override incomaptible
policies.
If the policy is disabled or not configured, WebDriver will not be allowed
to override incompatible policies.</string>
			<key>pfm_name</key>
			<string>WebDriverOverridesIncompatiblePolicies</string>
			<key>pfm_title</key>
			<string>Allow WebDriver to Override Incompatible Policies</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If the policy is set, the UDP port range used by WebRTC is restricted to the specified port interval (endpoints included).</string>
			<key>pfm_description_reference</key>
			<string>If the policy is set, the UDP port range used by WebRTC is restricted to the specified port interval (endpoints included).

If the policy is not set, or if it is set to the empty string or an invalid port range, WebRTC is allowed to use any available local UDP port.</string>
			<key>pfm_name</key>
			<string>WebRtcUdpPortRange</string>
			<key>pfm_title</key>
			<string>Restrict the range of local UDP ports used by WebRTC</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to ask the user to grant them access to a USB device.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are allowed to ask the user to grant them access to a USB device.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultWebUsbGuardSetting' policy if it is set, or the user's personal configuration otherwise.

URL patterns in this policy should not clash with ones configured via WebUsbBlockedForUrls. It is unspecified which of the two policies takes precedence if a URL matches with both.</string>
			<key>pfm_name</key>
			<string>WebUsbAskForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allow WebUSB on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows you to set a list of url patterns that specify sites which are prevented from asking the user to grant them access to a USB device.</string>
			<key>pfm_description_reference</key>
			<string>Allows you to set a list of url patterns that specify sites which are prevented from asking the user to grant them access to a USB device.

If this policy is left not set the global default value will be used for all sites either from the 'DefaultWebUsbGuardSetting' policy if it is set, or the user's personal configuration otherwise.

URL patterns in this policy should not clash with ones configured via WebUsbAskForUrls. It is unspecified which of the two policies takes precedence if a URL matches with both.</string>
			<key>pfm_name</key>
			<string>WebUsbBlockedForUrls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Block WebUSB on these sites</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Google Chrome</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>
