<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://www.barebones.com/products/bbedit/index.html</string>
	<key>pfm_description</key>
	<string>BBEdit settings</string>
	<key>pfm_documentation</key>
	<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html</string>
	<key>pfm_domain</key>
	<string>com.barebones.bbedit</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-08-21T10:35:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures BBEdit settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>BBEdit</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.barebones.bbedit</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.barebones.bbedit</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Appearance</string>
				<string>Expert Prefs</string>
				<string>Licenses</string>
				<string>Updates</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Appearance</key>
				<array>
					<string>AlwaysUseSystemAppearanceForTitleBar</string>
					<string>ShowIconsInSidebarLists</string>
					<string>UseSystemAppearanceWhenInDarkMode</string>
				</array>
				<key>Expert Prefs</key>
				<array>
					<string>PFC_SegmentedControl_ExpertPrefs</string>
					<string>AllowShiftRightToIndentWhitespaceOnlyLines</string>
					<string>AllowVolumeMountDuringStateRestore</string>
					<string>AskForUnguessableFileEncoding</string>
					<string>AskXcodeForOpenFileByName</string>
					<string>AutoRevealSelectedDocumentInProjectList</string>
					<string>AutoSaveIntervalInMinutes_v2</string>
					<string>BalanceIncludesDelimiters</string>
					<string>BRIEFStateTimeout</string>
					<string>CloseOFBNWindowAfterOpeningSelection</string>
					<string>CommentWholeLineWithInsertionPoint</string>
					<string>CounterpartSiblingSearchNames</string>
					<string>DefaultLanguageNameForNewDocuments</string>
					<string>Diff_IgnoreRCSKeywords</string>
					<string>DisableCtagsScanOnRemoteVolumes</string>
					<string>DisablePassiveFTP</string>
					<string>Editor_AlwaysOpenQuickFind</string>
					<string>Editor_AutoWordCountSizeThreshold</string>
					<string>Editor_ControlArrowCamelCase</string>
					<string>Editor_ControlArrowHScroll</string>
					<string>Editor_DeleteIndentationWhitespaceToTabStop</string>
					<string>Editor_SpellCheckLengthLimit</string>
					<string>EnableAutoSave_v2</string>
					<string>EnableSSHCompression</string>
					<string>FTPShowParentDir</string>
					<string>FindAndReplaceHistorySize</string>
					<string>FindDialog_UsesFindScrap</string>
					<string>FixedWidthFontSmoothingThreshold</string>
					<string>FlashBalancePointsWhenNavigating</string>
					<string>FontSmoothingThreshold</string>
					<string>FullScreenWidthThreshold</string>
					<string>FullScreenWindowsHogScreen</string>
					<string>GitToolPathOverride</string>
					<string>HTMLImageMarkupCreatesSizeAttributes</string>
					<string>HTMLImageMarkupUseInlineStyleForImageSize</string>
					<string>HTMLImageMarkupUsesFileNameForAlt</string>
					<string>LegacyUndoSelectionBehavior</string>
					<string>MarkupPanelAutoPrefillRecommendedAttributeNames</string>
					<string>MarkupToolsMisc_SkipXMLFilesWhenScanningFolders</string>
					<string>MaxDocumentLengthForCompletionTokenizer</string>
					<string>MostRecentItemsGroupLimit</string>
					<string>MoveModelessWindowsToActiveSpace</string>
					<string>MoveModelessWindowsToActiveSpace_FindWindow</string>
					<string>MoveModelessWindowsToActiveSpace_MultiFileFindWindow</string>
					<string>MoveModelessWindowsToActiveSpace_OpenFileByNameWindow</string>
					<string>NSRecentDocumentsLimit:Folders</string>
					<string>NSRecentDocumentsLimit:Images</string>
					<string>NSRecentDocumentsLimit:Projects</string>
					<string>OpenByNameMaxWildcardMatches</string>
					<string>OpenPanelShowsFrontDocumentDirectory</string>
					<string>OpenPDFsAsText</string>
					<string>PrecomposeUnicodeWhenPasting</string>
					<string>ProjectsListCanAcquireKeyboardFocus</string>
					<string>ProjectsOpenItemsOnSingleClick</string>
					<string>PromptToReopenRemoteDocuments</string>
					<string>QuickTimeImages</string>
					<string>RecentItems_RememberTempFiles</string>
					<string>ReopenRemoteDocuments</string>
					<string>ReplaceAllResultsIncludeTiming</string>
					<string>ReportReplaceAllResults</string>
					<string>SFTPConnectionTimeout</string>
					<string>SSHServerKeepaliveInterval</string>
					<string>SaveTitledDocumentsBeforeSleeping</string>
					<string>SaveDocumentStateForTempFiles</string>
					<string>ScriptEditorBundleID</string>
					<string>ShowFullPathsInSearchResults</string>
					<string>ShowSVNSwitchedItems</string>
					<string>SkipSCMAdminDirsWhenScanningFolders</string>
					<string>SubversionToolPathOverride</string>
					<string>SurfNextPreviousInDisplayOrder</string>
					<string>TerminalBundleID</string>
					<string>UseClippingsForCompletion</string>
					<string>UseDashForReferenceLookups</string>
					<string>UseInlineStylesForCopiedHTML</string>
					<string>UseResourceForkForDocumentState</string>
					<string>UseSeparatorsInUnixScriptOutput</string>
					<string>UseTabKeyAsCompletionTrigger</string>
					<string>UseXMLMarkupRulesForHTML5</string>
					<string>WarnMalformedUTF8</string>
					<string>WriteExtendedAttributes</string>
					<string>ZoomWindowsInPlace</string>
				</array>
				<key>Licenses</key>
				<array>
					<string>BBEditRegisteredOwner:11.0</string>
					<string>BBEditSerialNumber:11.0</string>
					<string>BBEditRegisteredOwner:12.0</string>
					<string>BBEditSerialNumber:12.0</string>
					<string>BBEditRegisteredOwner:13.0</string>
					<string>BBEditSerialNumber:13.0</string>
					<string>BBEditRegisteredOwner:14.0</string>
					<string>BBEditSerialNumber:14.0</string>
				</array>
				<key>Updates</key>
				<array>
					<string>SUAllowsAutomaticUpdates</string>
					<string>SUAutomaticallyUpdate</string>
					<string>SUEnableAutomaticChecks</string>
					<string>SUFeedURL</string>
					<string>SUScheduledCheckInterval</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>11.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>BBEdit will use a light or dark (system-defined) appearance for the window title bar, appropriate to the color scheme. If you would prefer that BBEdit always use the system standard - light - appearance, set this preference to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#appearance</string>
			<key>pfm_name</key>
			<string>AlwaysUseSystemAppearanceForTitleBar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>11.0</string>
			<key>pfm_description</key>
			<string>Organization registered to BBEdit 11 license.</string>
			<key>pfm_name</key>
			<string>BBEditRegisteredOwner:11.0</string>
			<key>pfm_title</key>
			<string>BBEdit Registered Owner v11</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>11.0</string>
			<key>pfm_description</key>
			<string>BBEdit 11 license.</string>
			<key>pfm_name</key>
			<string>BBEditSerialNumber:11.0</string>
			<key>pfm_title</key>
			<string>BBEdit License v11</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>12.0</string>
			<key>pfm_description</key>
			<string>Organization registered to BBEdit 12 license.</string>
			<key>pfm_name</key>
			<string>BBEditRegisteredOwner:12.0</string>
			<key>pfm_title</key>
			<string>BBEdit Registered Owner v12</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>12.0</string>
			<key>pfm_description</key>
			<string>BBEdit 12 license.</string>
			<key>pfm_name</key>
			<string>BBEditSerialNumber:12.0</string>
			<key>pfm_title</key>
			<string>BBEdit License v12</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>13.0</string>
			<key>pfm_description</key>
			<string>Organization registered to BBEdit 13 license.</string>
			<key>pfm_name</key>
			<string>BBEditRegisteredOwner:13.0</string>
			<key>pfm_title</key>
			<string>BBEdit Registered Owner v13</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>13.0</string>
			<key>pfm_description</key>
			<string>BBEdit 13 license.</string>
			<key>pfm_name</key>
			<string>BBEditSerialNumber:13.0</string>
			<key>pfm_title</key>
			<string>BBEdit License v13</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>14.0</string>
			<key>pfm_description</key>
			<string>Organization registered to BBEdit 14 license.</string>
			<key>pfm_name</key>
			<string>BBEditRegisteredOwner:14.0</string>
			<key>pfm_title</key>
			<string>BBEdit Registered Owner v14</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>14.0</string>
			<key>pfm_description</key>
			<string>BBEdit 14 license.</string>
			<key>pfm_name</key>
			<string>BBEditSerialNumber:14.0</string>
			<key>pfm_title</key>
			<string>BBEdit License v14</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>When displaying file names in the sidebars of disk browsers, projects, and multi-document editing windows, BBEdit will include the item's icon, as reported by the system. If you would prefer to suppress the icon, which allows a few more items to be displayed in the same amount of vertical space, set this preference to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/notes-13.0.html</string>
			<key>pfm_name</key>
			<string>ShowIconsInSidebarLists</string>
			<key>pfm_title</key>
			<string>Show Icons in Sidebar Lists</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_ExpertPrefs</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Clippings, Editing &amp; Text Completion</string>
				<string>File Comparison</string>
				<string>FTP / SFTP</string>
				<string>HTML Tools</string>
				<string>Language Support</string>
				<string>Other Apps</string>
				<string>Projects</string>
				<string>R &amp; W Files</string>
				<string>Sleep &amp; Autosave</string>
				<string>Source Control</string>
				<string>Text Display &amp; Coloring</string>
				<string>Text Search &amp; Replace</string>
				<string>Windows &amp; UI Tweaking</string>
				<string>Misc.</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Clippings, Editing &amp; Text Completion</key>
				<array>
					<string>AllowShiftRightToIndentWhitespaceOnlyLines</string>
					<string>BalanceIncludesDelimiters</string>
					<string>BRIEFStateTimeout</string>
					<string>CommentWholeLineWithInsertionPoint</string>
					<string>Editor_AutoWordCountSizeThreshold</string>
					<string>Editor_ControlArrowCamelCase</string>
					<string>Editor_ControlArrowHScroll</string>
					<string>Editor_DeleteIndentationWhitespaceToTabStop</string>
					<string>Editor_SpellCheckLengthLimit</string>
					<string>FlashBalancePointsWhenNavigating</string>
					<string>LegacyUndoSelectionBehavior</string>
					<string>MaxDocumentLengthForCompletionTokenizer</string>
					<string>PrecomposeUnicodeWhenPasting</string>
					<string>UseClippingsForCompletion</string>
					<string>UseTabKeyAsCompletionTrigger</string>
				</array>
				<key>FTP / SFTP</key>
				<array>
					<string>DisablePassiveFTP</string>
					<string>EnableSSHCompression</string>
					<string>FTPShowParentDir</string>
					<string>SFTPConnectionTimeout</string>
					<string>SSHServerKeepaliveInterval</string>
				</array>
				<key>File Comparison</key>
				<array>
					<string>Diff_IgnoreRCSKeywords</string>
				</array>
				<key>HTML Tools</key>
				<array>
					<string>HTMLImageMarkupCreatesSizeAttributes</string>
					<string>HTMLImageMarkupUseInlineStyleForImageSize</string>
					<string>HTMLImageMarkupUsesFileNameForAlt</string>
					<string>MarkupPanelAutoPrefillRecommendedAttributeNames</string>
					<string>MarkupToolsMisc_SkipXMLFilesWhenScanningFolders</string>
					<string>UseXMLMarkupRulesForHTML5</string>
				</array>
				<key>Language Support</key>
				<array>
					<string>CounterpartSiblingSearchNames</string>
					<string>DefaultLanguageNameForNewDocuments</string>
					<string>UseDashForReferenceLookups</string>
				</array>
				<key>Misc.</key>
				<array>
					<string>DisableCtagsScanOnRemoteVolumes</string>
					<string>OpenByNameMaxWildcardMatches</string>
					<string>OpenPanelShowsFrontDocumentDirectory</string>
					<string>UseInlineStylesForCopiedHTML</string>
					<string>UseSeparatorsInUnixScriptOutput</string>
					<string>SkipSCMAdminDirsWhenScanningFolders</string>
				</array>
				<key>Other Apps</key>
				<array>
					<string>AskXcodeForOpenFileByName</string>
					<string>ScriptEditorBundleID</string>
					<string>TerminalBundleID</string>
				</array>
				<key>Projects</key>
				<array>
					<string>AutoRevealSelectedDocumentInProjectList</string>
					<string>ProjectsListCanAcquireKeyboardFocus</string>
					<string>ProjectsOpenItemsOnSingleClick</string>
				</array>
				<key>R &amp; W Files</key>
				<array>
					<string>AskForUnguessableFileEncoding</string>
					<string>OpenPDFsAsText</string>
					<string>QuickTimeImages</string>
					<string>SaveDocumentStateForTempFiles</string>
					<string>UseResourceForkForDocumentState</string>
					<string>WarnMalformedUTF8</string>
					<string>WriteExtendedAttributes</string>
				</array>
				<key>Sleep &amp; Autosave</key>
				<array>
					<string>AllowVolumeMountDuringStateRestore</string>
					<string>AutoSaveIntervalInMinutes_v2</string>
					<string>EnableAutoSave_v2</string>
					<string>PromptToReopenRemoteDocuments</string>
					<string>ReopenRemoteDocuments</string>
					<string>SaveTitledDocumentsBeforeSleeping</string>
				</array>
				<key>Source Control</key>
				<array>
					<string>GitToolPathOverride</string>
					<string>ShowSVNSwitchedItems</string>
					<string>SkipSCMAdminDirsWhenScanningFolders</string>
					<string>SubversionToolPathOverride</string>
				</array>
				<key>Text Display &amp; Coloring</key>
				<array>
					<string>FixedWidthFontSmoothingThreshold</string>
					<string>FontSmoothingThreshold</string>
				</array>
				<key>Text Search &amp; Replace</key>
				<array>
					<string>FindAndReplaceHistorySize</string>
					<string>FindDialog_UsesFindScrap</string>
					<string>Editor_AlwaysOpenQuickFind</string>
					<string>ReplaceAllResultsIncludeTiming</string>
					<string>ReportReplaceAllResults</string>
					<string>ShowFullPathsInSearchResults</string>
				</array>
				<key>Windows &amp; UI Tweaking</key>
				<array>
					<string>CloseOFBNWindowAfterOpeningSelection</string>
					<string>FullScreenWidthThreshold</string>
					<string>FullScreenWindowsHogScreen</string>
					<string>MostRecentItemsGroupLimit</string>
					<string>MoveModelessWindowsToActiveSpace</string>
					<string>MoveModelessWindowsToActiveSpace_FindWindow</string>
					<string>MoveModelessWindowsToActiveSpace_MultiFileFindWindow</string>
					<string>MoveModelessWindowsToActiveSpace_OpenFileByNameWindow</string>
					<string>NSRecentDocumentsLimit:Folders</string>
					<string>NSRecentDocumentsLimit:Images</string>
					<string>NSRecentDocumentsLimit:Projects</string>
					<string>RecentItems_RememberTempFiles</string>
					<string>SurfNextPreviousInDisplayOrder</string>
					<string>ZoomWindowsInPlace</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>By default, the "Shift Right" command on the Text menu will not add indentation to lines that are empty or consist entirely of white space. If you would prefer to indent every line, regardless of its whitespace-only nature, set this preference to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#clip</string>
			<key>pfm_name</key>
			<string>AllowShiftRightToIndentWhitespaceOnlyLines</string>
			<key>pfm_title</key>
			<string>Allow Shift Right to Indent Whitespace Only Lines</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>By default, the "Balance" command (or double-clicking on a delimiter to balance) does not include the delimiters in the resulting selection. If you would like for it to do so, set this preference to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#clip</string>
			<key>pfm_name</key>
			<string>BalanceIncludesDelimiters</string>
			<key>pfm_title</key>
			<string>Balance Includes Delimiters</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>10</real>
			<key>pfm_description</key>
			<string>The progressive (BRIEF compatible) behavior of the Home and End keys operates within a specific time period; if you wait longer than that, the behavior state resets. The factory default timeout period is ten seconds.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#clip</string>
			<key>pfm_name</key>
			<string>BRIEFStateTimeout</string>
			<key>pfm_range_min</key>
			<real>0.1</real>
			<key>pfm_title</key>
			<string>Brief State Timeout</string>
			<key>pfm_type</key>
			<string>real</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>When using the Un/Comment command, if nothing is selected, BBEdit will use the line comment delimiter to comment (or uncomment) the entire line. If you would prefer that BBEdit insert the line-comment delimiter at the insertion point instead, set this preference to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#clip</string>
			<key>pfm_name</key>
			<string>CommentWholeLineWithInsertionPoint</string>
			<key>pfm_title</key>
			<string>Comment Whole Line with Insertion Point</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>16777216</integer>
			<key>pfm_description</key>
			<string>Automatic word counting is disabled for documents over a set size threshold, in order to avoid needless delays when working on very large documents. The factory default is 16M characters - 16777216 -, but you may change this limit. Setting to 0 disables the limit check entirely.</string>
			<key>pfm_name</key>
			<string>Editor_AutoWordCountSizeThreshold</string>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Auto Word Count Size Threshold</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>characters</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Since "Find All Misspelled Words" is pretty much pointless on files over a certain size, the maximum amount of text checked by this command is limited to 1M - 1024 squared - characters. This may be adjusted. Setting to 0 supresses the limit altogether.</string>
			<key>pfm_name</key>
			<string>Editor_SpellCheckLengthLimit</string>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Spell Check Length Limit</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>characters</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>12.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>BBEdit supports "camel case" navigation: press Control-left-arrow or Control-right-arrow to jump to the next (or previous) transition from lower-case to upper-case characters (or a word boundary, whichever comes first).

Note that this use of Control-left-arrow and Control-right-arrow replaces the pre-8.5 behavior of using these key combinations to scroll horizontally. If you prefer the old behavior, set these this preference to 'false'.</string>
			<key>pfm_name</key>
			<string>Editor_ControlArrowCamelCase</string>
			<key>pfm_title</key>
			<string>Control Arrow Camel Case</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>12.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>BBEdit supports "camel case" navigation: press Control-left-arrow or Control-right-arrow to jump to the next (or previous) transition from lower-case to upper-case characters (or a word boundary, whichever comes first).

Note that this use of Control-left-arrow and Control-right-arrow replaces the pre-8.5 behavior of using these key combinations to scroll horizontally. If you prefer the old behavior, set these this preference to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#clip</string>
			<key>pfm_name</key>
			<string>Editor_ControlArrowHScroll</string>
			<key>pfm_title</key>
			<string>Control Arrow Horizontal Scroll</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>When you backspace from the insertion point, BBEdit will delete a tab stop's worth of spaces if there are only spaces (and tabs) between the insertion point and the start of the line on which you're editing. This may be disabled by setting this preference to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#clip</string>
			<key>pfm_name</key>
			<string>Editor_DeleteIndentationWhitespaceToTabStop</string>
			<key>pfm_title</key>
			<string>Delete Indentation Whitespace to Tab Stop</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>When you use the right-arrow key to navigate over a closing delimiter (right paren/brace/bracket/curly quote), the opening delimiter will be briefly highlighted. If you wish to turn this off, set this preference to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#clip</string>
			<key>pfm_name</key>
			<string>FlashBalancePointsWhenNavigating</string>
			<key>pfm_title</key>
			<string>Flash Balance Points When Navigating</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When performing an Undo or Redo and the selection range changes, the Undo/Redo operation will select the affected text, rather than updating the Undo/Redo state to include the actual current selection range. If however you prefer the classic behavior (as implemented from the beginning of time up through BBEdit 11.6), you may obtain set this preference to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#clip</string>
			<key>pfm_name</key>
			<string>LegacyUndoSelectionBehavior</string>
			<key>pfm_title</key>
			<string>Undo Selection (Legacy)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Since "Find All Misspelled Words" is pretty much pointless on files over a certain size, the maximum amount of text checked by this command is limited to 1M - 1024 squared - characters. This may be adjusted. Setting to 0 supresses the limit altogether.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#clip</string>
			<key>pfm_name</key>
			<string>MaxDocumentLengthForCompletionTokenizer</string>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Misspelled Word Character Limit</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>characters</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If you find that you frequently need to bring in text which contains combining Unicode characters (as are frequently found in PDFs generated on other platforms, for example), it can be desirable to preprocess the combining characters into one composed character where possible. This is not a general need, but if you run into it often enough, you can tell BBEdit to combine the characters for you by setting this preference to 'true'.
Despite the name, the precomposition is done when BBEdit imports the Clipboard from other applications, not when the paste is actually done.

Note that this requires an additional copy of the Clipboard when the application imports the text, and for very large pastes, there may be a noticeable delay while the text gets precomposed. Thus, you should only turn on this setting when you are frequently working with text that contains combining Unicode characters</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#clip</string>
			<key>pfm_name</key>
			<string>PrecomposeUnicodeWhenPasting</string>
			<key>pfm_title</key>
			<string>Precompose Unicode When Pasting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Setting this to a non-existent URL will disable the ability for users to manually check for updates. Useful when you intend to use your own software distribution mechanism to deploy updates.</string>
			<key>pfm_documentation_url</key>
			<string>https://sparkle-project.org/documentation/customization/</string>
			<key>pfm_format</key>
			<string>^https://.*$</string>
			<key>pfm_name</key>
			<string>SUFeedURL</string>
			<key>pfm_title</key>
			<string>Sparkle Feed URL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://127.0.0.1</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Controls automatic update checks.</string>
			<key>pfm_documentation_url</key>
			<string>https://sparkle-project.org/documentation/customization/</string>
			<key>pfm_name</key>
			<string>SUEnableAutomaticChecks</string>
			<key>pfm_title</key>
			<string>Enable Automatic Update Checks</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>86400</integer>
			<key>pfm_description</key>
			<string>Controls the automatic update check interval. The default is 1 day (86400 seconds). Setting to 0 disables updates.</string>
			<key>pfm_documentation_url</key>
			<string>https://sparkle-project.org/documentation/customization/</string>
			<key>pfm_name</key>
			<string>SUScheduledCheckInterval</string>
			<key>pfm_title</key>
			<string>Automatic Update Check Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Controls the automatic update install prompt. When enabled, presents users with the option to allow automatic download and install of available updates. If disabled, disallows automatic updates and requires manual installation every time.</string>
			<key>pfm_documentation_url</key>
			<string>https://sparkle-project.org/documentation/customization/</string>
			<key>pfm_name</key>
			<string>SUAllowsAutomaticUpdates</string>
			<key>pfm_title</key>
			<string>Automatic Update Install Prompt</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Controls automatic silent updates. If enabled, users will not be informed about updates and updates will be silently installed when the app quits.</string>
			<key>pfm_documentation_url</key>
			<string>https://sparkle-project.org/documentation/customization/</string>
			<key>pfm_name</key>
			<string>SUAutomaticallyUpdate</string>
			<key>pfm_title</key>
			<string>Enable Automatic Silent Updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If there is a partial word to the immediate left of the insertion point, the "Insert Clipping..." command will attempt to autocomplete that word based clipping names in the current and universal set (using a "begins with" style match.) If you wish to disable the autocompletion, set this preference to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#clip</string>
			<key>pfm_name</key>
			<string>UseClippingsForCompletion</string>
			<key>pfm_title</key>
			<string>Use Clippings for Completion</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If there is a partial word to the immediate left of the insertion point, the "Insert Clipping..." command will attempt to autocomplete that word based clipping names in the current and universal set using a "begins with" style match. If you wish to disable the autocompletion, set this preference to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#appearance</string>
			<key>pfm_name</key>
			<string>UseSystemAppearanceWhenInDarkMode</string>
			<key>pfm_title</key>
			<string>Use System Appearance When in Dark Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>To use the Tab key to trigger text completion, set this preference to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#clip</string>
			<key>pfm_name</key>
			<string>UseTabKeyAsCompletionTrigger</string>
			<key>pfm_title</key>
			<string>Use Tab Key as Completion Trigger</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Settings are available for disabling passive FTP, in order to deal with hosts that misbehave when sent the PASV command.

Passive FTP can be disabled per host, per domain, or globally.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#ftp</string>
			<key>pfm_name</key>
			<string>DisablePassiveFTP</string>
			<key>pfm_title</key>
			<string>Disable Passive FTP</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>On FTP servers, when using 'Show items starting with ".",' the FTP server may return the `.` and `..` items as part of the listing. This is normal, but if you don't want to see these items, you can hide them.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#ftp</string>
			<key>pfm_name</key>
			<string>FTPShowParentDir</string>
			<key>pfm_title</key>
			<string>Show FTP Parent Directories</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Some servers don't work correctly when SSH compression is enabled. To work around this, SSH compression can be disabled per host, per domain, or globally.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#ftp</string>
			<key>pfm_name</key>
			<string>EnableSSHCompression</string>
			<key>pfm_title</key>
			<string>Enable SSH Compression</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Most of the time, the default timeout for connecting to an SFTP server will suffice; however, if the server is heavily loaded it may take longer to respond.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#ftp</string>
			<key>pfm_name</key>
			<string>SFTPConnectionTimeout</string>
			<key>pfm_title</key>
			<string>SFTP Connection Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>90</integer>
			<key>pfm_description</key>
			<string>If you have problems with your SSH server closing the connection after a period of non-use (which will subsequently cause errors in BBEdit), you can tell BBEdit to send a periodic "keepalive" message to while connected to the server.

This is configurable per host, per domain, or globally. Determining the appropriate value may require some experimentation, but 90 seconds is probably a good starting point.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#ftp</string>
			<key>pfm_name</key>
			<string>SSHServerKeepaliveInterval</string>
			<key>pfm_title</key>
			<string>SSH Server Keepalive Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>When comparing text files, BBEdit will canonicalize RCS keywords to their unexpanded state, so that the values of RCS keywords are not significant to the differences calculations. If you wish, you can disable this, so that any chance in the RCS keywords on a line will cause the line to appear in the differences.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#diff</string>
			<key>pfm_name</key>
			<string>Diff_IgnoreRCSKeywords</string>
			<key>pfm_title</key>
			<string>Ignore RCS Keywords</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>When doing Check Syntax, Check Links, Update, or Update Images on a folder (including a web site), BBEdit will skip XML files (that is, files determined to be XML either by mapping their file name extensions, or by inspection of their contents). If you prefer to include such files, set this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#html</string>
			<key>pfm_name</key>
			<string>MarkupToolsMisc_SkipXMLFilesWhenScanningFolders</string>
			<key>pfm_title</key>
			<string>Skip XML Files When Scanning Folders</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Ordinarily, BBEdit will generate XHTML-style markup in HTML5 documents (those with a "&lt;!DOCTYPE HTML&gt;" declaration). If you wish, you can suppress this by setting this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#html</string>
			<key>pfm_name</key>
			<string>UseXMLMarkupRulesForHTML5</string>
			<key>pfm_title</key>
			<string>Use XML Markup Rules for HTML5</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>When generating image markup as a result of dropping an image file into an HTML document, BBEdit will generate an "alt" attribute for the image tag, whose value is the file's name. If you would prefer for the "alt" attribute to be omitted (which will result in an error when checking syntax), you can disable this by setting this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#html</string>
			<key>pfm_name</key>
			<string>HTMLImageMarkupUsesFileNameForAlt</string>
			<key>pfm_title</key>
			<string>Undo Selection (Legacy)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>When you drop an image file into an HTML document to generate an image tag, BBEdit will generate "width" and "height" tags based on information in the file itself. If you would prefer to omit these, set these to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#html</string>
			<key>pfm_name</key>
			<string>HTMLImageMarkupCreatesSizeAttributes</string>
			<key>pfm_title</key>
			<string>HTML Image Markup with Image Tags</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If HTMLImageMarkupCreatesSizeAttributes is turned on, you can instruct BBEdit to generate inline styles for image sizes, instead of height and width by setting this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#html</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>HTMLImageMarkupCreatesSizeAttributes</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>HTMLImageMarkupCreatesSizeAttributes</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>HTMLImageMarkupUseInlineStyleForImageSize</string>
			<key>pfm_title</key>
			<string>HTML Image Markup Inline Styles</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>When you invoke the Markup Panel to create a new tag, it will automatically fill in attribute names for "promoted" attributes. If there are any attributes that you don't want to be present in the generated markup, just leave their values blank, and the panel will omit them (unless the attributes are required).

If you wish, you can suppress the auto fill by setting this to 'false'.

Turning off the auto fill will cause the "gear" to appear in the markup panel, and clicking it will manually fill in the promoted attributes for you.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#html</string>
			<key>pfm_name</key>
			<string>MarkupPanelAutoPrefillRecommendedAttributeNames</string>
			<key>pfm_title</key>
			<string>Prefill Recommended Attribute Names in Markup</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If Xcode is running, Open Selection and Open File by Name will ask it for a path to the file name; if something useful comes back, BBEdit will open it. If for some reason you are using Xcode but don't want BBEdit to do this, you can turn it off by setting this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#inte</string>
			<key>pfm_name</key>
			<string>AskXcodeForOpenFileByName</string>
			<key>pfm_title</key>
			<string>Ask XCode to Open File by Name</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>By default, BBEdit will open AppleScript files using whatever application the OS claims is capable of doing so. If you wish to override this, change the "ScriptEditorBundleID" preference to the bundle ID of your preferred script editor.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#inte</string>
			<key>pfm_name</key>
			<string>ScriptEditorBundleID</string>
			<key>pfm_title</key>
			<string>Preferred Script Editor BundleID</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>com.latenightsw.ScriptDebugger</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The "Run in Terminal" and "Go Here in Terminal" commands will use Apple's "Terminal" application by default. If you would like to use a different one, set this here.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#inte</string>
			<key>pfm_name</key>
			<string>TerminalBundleID</string>
			<key>pfm_title</key>
			<string>Preferred Terminal BundleID</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>com.example.TerminalAppBundleID</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If Dash is installed, BBEdit will use it for "Find in Reference", in preference to any predefined or custom reference lookup URLs.

You could, if you wanted, turn off Dash support by default and then enable it for specific languages.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#inte</string>
			<key>pfm_name</key>
			<string>UseDashForReferenceLookups</string>
			<key>pfm_title</key>
			<string>Use Dash for Reference Lookups</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If you like, you can set the default language for new untitled documents.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#lang</string>
			<key>pfm_name</key>
			<string>DefaultLanguageNameForNewDocuments</string>
			<key>pfm_title</key>
			<string>Default Language for New Documents</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Markdown</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>When the active document is either a source or a header file, the "Open Counterpart" command will now search the siblings of this file's parent for eligible counterparts. By default, BBEdit will only search in such folders if their names match one of the following patterns (including wildcards): `inc*`, `source`, `src`, or `*priv*`. If you wish to add additional qualifying names, you may do so by setting "CounterpartSiblingSearchNames" to contain a comma-delimited list of folder name patterns.

Any whitespace surrounding the provided names will be stripped.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#lang</string>
			<key>pfm_name</key>
			<string>CounterpartSiblingSearchNames</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>In project windows, the file list does not accept keyboard focus by default, unless the editing view is hidden. You can modify this so that the file list gets the focus whenever you click on it, set this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#proj</string>
			<key>pfm_name</key>
			<string>ProjectsListCanAcquireKeyboardFocus</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Project windows will ordinarily open an item in the file list for editing when you click on it and the editing view is visible. To require a double-click, set this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#proj</string>
			<key>pfm_name</key>
			<string>ProjectsOpenItemsOnSingleClick</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>BBEdit will not automatically reveal documents in the project list when you select them;  View =&gt; Reveal in Project List works for this purpose. If you want automatic revealing, set to this to 'true'</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#proj</string>
			<key>pfm_name</key>
			<string>AutoRevealSelectedDocumentInProjectList</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>BBEdit ordinarily recognizes image files as images, and will open them into image windows (or ignore them when filtering for text files). To have images possibly treated as text files, which can be potentially dangerous, set this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#read</string>
			<key>pfm_name</key>
			<string>QuickTimeImages</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>By default, PDFs are considered text files and so may be opened and searched along with all other text files. To have PDFs treated as a special file type - (they will be ignored for any operation that requires a text file - set this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#read</string>
			<key>pfm_name</key>
			<string>OpenPDFsAsText</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>To control whether BBEdit warns you when opening a malformed UTF-8 file, set this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#read</string>
			<key>pfm_name</key>
			<string>WarnMalformedUTF8</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Ordinarily, BBEdit will only ask you to choose a file's encoding when it can't otherwise figure out what the encoding is, and your "if the file's encoding can't be guessed" preference is a UTF-8 or UTF-16 variant. This should be fine for general use, but if for some reason you always want BBEdit to ask you when it can't guess a file's encoding, even if your preference would do the job, you can set this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#read</string>
			<key>pfm_name</key>
			<string>AskForUnguessableFileEncoding</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Beginning with version 8.0, BBEdit stores document state (window position and various settings) in a central repository in your BBEdit preferences folder. If you wish, you can ask BBEdit to store document state in the resource fork of the document's file by setting this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#read</string>
			<key>pfm_name</key>
			<string>UseResourceForkForDocumentState</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>By default, BBEdit will not store document state for documents located in any of the canonical locations for temporary files. This also includes the "svn-commit.tmp" files used for Subversion commits. If you wish, you can change this by setting this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#read</string>
			<key>pfm_name</key>
			<string>SaveDocumentStateForTempFiles</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>By default, BBEdit will avoid writing extended attributes - HFS Type/Creator - to volumes which don't natively support them - i.e. to avoid creating the ._FILE - when it is safe to do so. We'll be able to re-open the document correctly later. If desired, you can fine-tune this behavior.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#read</string>
			<key>pfm_name</key>
			<string>WriteExtendedAttributes</string>
			<key>pfm_range_list</key>
			<array>
				<string>always</string>
				<string>never</string>
				<string>smart</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Always write the HFS file type and creator: the pre-8.6 behavior</string>
				<string>Never set the HFS file type and creator, even if the document's volume supports it</string>
				<string>Smart: Write HFS file type and creator only if the document's volume supports it</string>
			</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Document auto-save for crash recovery is on by default, to change this set this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#read</string>
			<key>pfm_name</key>
			<string>EnableAutoSave_v2</string>
			<key>pfm_title</key>
			<string>Enable AutoSave</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If document auto-save for crash recovery is on, this preference will define the default save time interval.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#read</string>
			<key>pfm_name</key>
			<string>AutoSaveIntervalInMinutes_v2</string>
			<key>pfm_title</key>
			<string>AutoSave Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>minutes</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>The "Sleep" command does not save any documents in place, since it creates an auto-save file for any open documents with unsaved changes. However, if you want BBEdit to save any titled - i.e. opened from an existing file - documents to disk before sleeping, you can set this preference to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#read</string>
			<key>pfm_name</key>
			<string>SaveTitledDocumentsBeforeSleeping</string>
			<key>pfm_title</key>
			<string>Save Titled Documents Before Sleeping</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>BBEdit provides control over whether documents on remote servers - FTP/SFTP - or unmounted volumes are opened when automatically reopening documents at application startup. You can modify its behavior by setting this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#read</string>
			<key>pfm_name</key>
			<string>AllowVolumeMountDuringStateRestore</string>
			<key>pfm_title</key>
			<string>Allow Volume Mount During State Restore</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If set to 'true', BBEdit will attempt to mount a volume containing a document it wants to reopen. Defaults to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#read</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>AllowVolumeMountDuringStateRestore</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>AllowVolumeMountDuringStateRestore</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ReopenRemoteDocuments</string>
			<key>pfm_title</key>
			<string>Reopen Remote Documents</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If set to 'false', BBEdit will not attempt to open any documents that were opened from FTP/SFTP servers. Defaults to 'true'.  If set to 'false', BBEdit will open remote documents without asking, if ReopenRemoteDocuments is set to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#read</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>ReopenRemoteDocuments</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>PromptToReopenRemoteDocuments</string>
			<key>pfm_title</key>
			<string>Prompt to Reopen Remote Documents</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>When scanning folders for various purposes - multi-file search, Find differences, and others -, SCM administrative directories are specifically ignored, even if "Search Invisible Folders" is turned on: CVS, .svn, .git, .hg, .bzr. This avoids potential disasters that can result from indiscriminate search and replace in such directories. If, however, you choose to live dangerously, you can allow BBEdit to see inside of these directories by setting this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#sour</string>
			<key>pfm_name</key>
			<string>SkipSCMAdminDirsWhenScanningFolders</string>
			<key>pfm_title</key>
			<string>Skip SCM Admin Directories When Scanning Folders</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>BBEdit will ordinarily select the appropriate command-line tool for communicating with the SCM system, based on your $PATH environment variable. If you find that an undesired command-line tool is running within BBEdit but the desired tool is being invoked from a Terminal command line, examine your tool installation and $PATH setup for errors.

However, for specific cases in which it is necessary to force BBEdit to use a particular tool, you may do by specifying the path.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#sour</string>
			<key>pfm_name</key>
			<string>GitToolPathOverride</string>
			<key>pfm_title</key>
			<string>Git Path Override</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/path/to/git/binary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>BBEdit will ordinarily select the appropriate command-line tool for communicating with the SCM system, based on your $PATH environment variable. If you find that an undesired command-line tool is running within BBEdit but the desired tool is being invoked from a Terminal command line, examine your tool installation and $PATH setup for errors.

However, for specific cases in which it is necessary to force BBEdit to use a particular tool, you may do so by specifying the path.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#sour</string>
			<key>pfm_name</key>
			<string>SubversionToolPathOverride</string>
			<key>pfm_title</key>
			<string>Subversion Tool Path Override</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/path/to/svn/binary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>"Show Working Copy Status" for svn does not include switched items. If this affects you and you would prefer to see switched items, you may make them visibile by setting this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#sour</string>
			<key>pfm_name</key>
			<string>ShowSVNSwitchedItems</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>8</integer>
			<key>pfm_description</key>
			<string>Whether or not BBEdit uses text smoothing - antialiasing - may be adjusted separately for fixed-width and for proportional fonts. The factory default smoothing thresholds are 8pt for fixed width fonts, and 4pt for proportional fonts, respectively.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#textd</string>
			<key>pfm_name</key>
			<string>FixedWidthFontSmoothingThreshold</string>
			<key>pfm_title</key>
			<string>Fixed Width Font Smoothing Threshold</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>pt</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>4</integer>
			<key>pfm_description</key>
			<string>Whether or not BBEdit uses text smoothing - antialiasing - may be adjusted separately for fixed-width and for proportional fonts. Font sizes above the specified FixedWidthFontSmoothingThreshold are smoothed; font sizes below the threshold are not.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#textd</string>
			<key>pfm_name</key>
			<string>FontSmoothingThreshold</string>
			<key>pfm_title</key>
			<string>Font Smoothing Threshold</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>pt</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Like many Mac OS X applications, BBEdit supports the "Find Scrap", a feature of the OS that enables sharing of the "search for" string between applications. Some applications put inappropriate content - such as Web search strings - on the Find Scrap, which can cause the "search for" string in BBEdit's Find dialog to be replaced when you didn't expect it.

To tell BBEdit not to import the Find Scrap into its Find window, nor to export the "search for" string to the Find Scrap, set this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#texts</string>
			<key>pfm_name</key>
			<string>FindDialog_UsesFindScrap</string>
			<key>pfm_title</key>
			<string>Use Find Scrap</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>The Live Search bar is not visible by default, but appears when you choose "Live Search" from the Search menu. If you would like the Live Search bar to be visible in each new document that you create or open, set this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#texts</string>
			<key>pfm_name</key>
			<string>Editor_AlwaysOpenQuickFind</string>
			<key>pfm_title</key>
			<string>Always Open Quick Find</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When performing a single-file "Replace All" operation, BBEdit can show a confirmation sheet showing the number of replacements performed. If you would like to see this confirmation, set this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#texts</string>
			<key>pfm_name</key>
			<string>ReportReplaceAllResults</string>
			<key>pfm_title</key>
			<string>Replace All Confirmation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If you want to amaze and impress your friends and family with just how fast BBEdit's "Replace All" is, set this to 'true'.

When set to 'true', the sheet, or growl notification, will display the amount of time required for the "Replace All" operation.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#texts</string>
			<key>pfm_name</key>
			<string>ReplaceAllResultsIncludeTiming</string>
			<key>pfm_title</key>
			<string>Replace All w/ Timing</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If you like BBEdit to show the full paths of files listed in search results windows, set this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#texts</string>
			<key>pfm_name</key>
			<string>ShowFullPathsInSearchResults</string>
			<key>pfm_title</key>
			<string>Show Full Paths in Search Results</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>16</integer>
			<key>pfm_description</key>
			<string>By default, BBEdit will remember the 16 most recent search and replace strings/patterns for the popup menu in the Find and Multi-File Search windows. Setting the history to zero makes it infinite.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#texts</string>
			<key>pfm_name</key>
			<string>FindAndReplaceHistorySize</string>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Find &amp; Replace History Size</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When using the "Previous Document" and "Next Document" commands on the View menu, or the navigation arrows in the navigation bar, the order in which BBEdit navigates documents is determined by the order in which they were opened. If you prefer, these commands can be made to navigate the documents in the order shown in the file list by setting this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_name</key>
			<string>SurfNextPreviousInDisplayOrder</string>
			<key>pfm_title</key>
			<string>Navigate Documents by File List Order</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>BBEdit attempts to move windows as little as possible when you zoom them. To override this and let BBEdit place the window in the upper left-hand corner of the screen, set this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_name</key>
			<string>ZoomWindowsInPlace</string>
			<key>pfm_title</key>
			<string>Zoom Windows in Place</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>By default, the application will allow windows to take up the entire screen when entering full screen mode. If desired, you may prevent this and instruct the application to figure out whether a window should be made the full width of the screen by setting this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_name</key>
			<string>FullScreenWindowsHogScreen</string>
			<key>pfm_title</key>
			<string>Full Screen Windows Hog Screen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>When entering full screen mode, the application figures out whether the window width should be increased to take up the full screen width, or not, based on the width of the window relative to the width of the screen that it's on. The threshold at which the window is made to take up the entire screen width can be set. This setting requires that FullScreenWindowsHogScreen be turned on
NEED FLOAT NUMBER MIN &amp; MAX</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>FullScreenWindowsHogScreen</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>FullScreenWindowsHogScreen</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>FullScreenWidthThreshold</string>
			<key>pfm_range_max</key>
			<real>1</real>
			<key>pfm_range_min</key>
			<real>0.0</real>
			<key>pfm_title</key>
			<string>Full Screen Width Threshold</string>
			<key>pfm_type</key>
			<string>real</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The "Remember the … most recently used items" setting in the Application preferences applies to all item types. So, if it's set to 15, BBEdit will remember 15 text documents, 15 folders, 15 projects, 15 images, and so on. If you want finer control, you can construct an expert pref using the name of the document type as it appears in the menu, and if that name contains spaces, you'll need to quote it.

If you don't want to remember any recent documents of a particular type - they won't appear in the menu, either -, you can set its limit to 0</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_name</key>
			<string>NSRecentDocumentsLimit:Projects</string>
			<key>pfm_title</key>
			<string>Recent Projects Limit</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>projects</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The "Remember the … most recently used items" setting in the Application preferences applies to all item types. So, if it's set to 15, BBEdit will remember 15 text documents, 15 folders, 15 projects, 15 images, and so on. If you want finer control, you can construct an expert pref using the name of the document type as it appears in the menu, and if that name contains spaces, you'll need to quote it.

If you don't want to remember any recent documents of a particular type - they won't appear in the menu, either -, you can set its limit to 0</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_name</key>
			<string>NSRecentDocumentsLimit:Folders</string>
			<key>pfm_title</key>
			<string>Recent Folders # Limit</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>folders</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The "Remember the … most recently used items" setting in the Application preferences applies to all item types. So, if it's set to 15, BBEdit will remember 15 text documents, 15 folders, 15 projects, 15 images, and so on. If you want finer control, you can construct an expert pref using the name of the document type as it appears in the menu, and if that name contains spaces, you'll need to quote it.

If you don't want to remember any recent documents of a particular type - they won't appear in the menu, either -, you can set its limit to 0</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_name</key>
			<string>NSRecentDocumentsLimit:Images</string>
			<key>pfm_title</key>
			<string>Recent Images # Limit</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>images</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The "Remember the … most recently used items" setting in the Application preferences applies to all item types. So, if it's set to 15, BBEdit will remember 15 text documents, 15 folders, 15 projects, 15 images, and so on. If you want finer control, you can construct an expert pref using the name of the document type as it appears in the menu, and if that name contains spaces, you'll need to quote it.

You can also control the number of items shown in the "Most Recently Used" group.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_name</key>
			<string>MostRecentItemsGroupLimit</string>
			<key>pfm_title</key>
			<string>Most recent items group limit</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>recent items</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>By default, BBEdit does not remember recent items opened from any of the canonical locations for temporary files. This also includes the "svn-commit.tmp" files used for Subversion commits. If desired, you can change this by setting this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_name</key>
			<string>RecentItems_RememberTempFiles</string>
			<key>pfm_title</key>
			<string>Remember Temp Files</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>By default, the "Open File by Name" window stays open when you click the "Open" button. However, if you would prefer for it to act more like a modal dialog, set this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_name</key>
			<string>CloseOFBNWindowAfterOpeningSelection</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When using Spaces, you can control whether BBEdit's modeless dialog boxes - Find, Multi-File Search, and Open File by Name - get moved to the active space when switching spaces. By default, this is allowed for the Find, Multi-File Search, and Open File by Name windows. To control whether windows of these types are moved to the active space, set this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_name</key>
			<string>MoveModelessWindowsToActiveSpace_FindWindow</string>
			<key>pfm_title</key>
			<string>Move Find Window to Active Space</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When using Spaces, you can control whether BBEdit's modeless dialog boxes - Find, Multi-File Search, and Open File by Name - get moved to the active space when switching spaces. By default, this is allowed for the Find, Multi-File Search, and Open File by Name windows. To control whether windows of these types are moved to the active space, set this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_name</key>
			<string>MoveModelessWindowsToActiveSpace_MultiFileFindWindow</string>
			<key>pfm_title</key>
			<string>Move Multi-File Find Window to Active Space</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When using Spaces, you can control whether BBEdit's modeless dialog boxes - Find, Multi-File Search, and Open File by Name - get moved to the active space when switching spaces. By default, this is allowed for the Find, Multi-File Search, and Open File by Name windows. To control whether windows of these types are moved to the active space, set this to 'true'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_name</key>
			<string>MoveModelessWindowsToActiveSpace_OpenFileByNameWindow</string>
			<key>pfm_title</key>
			<string>Move Open File by Name Window to active space</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When using Spaces, you can control whether BBEdit's modeless dialog boxes - Find, Multi-File Search, and Open File by Name - get moved to the active space when switching spaces. By default, this is allowed for the Find, Multi-File Search, and Open File by Name windows. To control whether windows of these types are moved to the active space, set this to 'true'.

This preference sets the default behavior for any of the defined window types for which a default is not explicitly specified.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#wind</string>
			<key>pfm_name</key>
			<string>MoveModelessWindowsToActiveSpace</string>
			<key>pfm_title</key>
			<string>Move All Window types to active space</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>The "Copy as Styled HTML" and "Save as Styled HTML" commands normally generate style information inline. If you want to use an embedded style sheet instead, set this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#misc</string>
			<key>pfm_name</key>
			<string>UseInlineStylesForCopiedHTML</string>
			<key>pfm_title</key>
			<string>Use Inline Styles for Copied HTML</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>When editing files that are on remote file servers - AFP, NFS, SMB, etc. -, BBEdit will not look for directory-relative ctags data files. This is a particular performance win when the file is located on a volume mounted via MacFUSE/SSH or similar, or if the file server is over a slow or high-latency link.

To enable scanning for tags files on remote volumes, set this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#misc</string>
			<key>pfm_name</key>
			<string>DisableCtagsScanOnRemoteVolumes</string>
			<key>pfm_title</key>
			<string>Disable Ctags Scan on Remote Volumes</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>200</integer>
			<key>pfm_description</key>
			<string>When searching for matches, Open File by Name limits the number of matches to a reasonable maximum. The factory default is 200.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#misc</string>
			<key>pfm_name</key>
			<string>OpenByNameMaxWildcardMatches</string>
			<key>pfm_title</key>
			<string>Open by Name Max Wilcard Matches</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>matches</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Ordinarily, the output from Unix scripts run within BBEdit is delimited with line separators - except when the script output is sent to a new untitled document. If you wish to suppress the separators, you can set this to 'false'.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#misc</string>
			<key>pfm_name</key>
			<string>UseSeparatorsInUnixScriptOutput</string>
			<key>pfm_title</key>
			<string>Use Separators in Unix Script Output</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>By default, the Open panel implements the standard system behavior of displaying the same folder that was viewed the last time you used the Open command. If you wish, you may instead have the Open panel display the directory containing the active document by setting this to 'true'.

If the active document is untitled or was opened from an FTP/SFTP server, or if there are no documents open, the Open panel will show you the last-used directory.</string>
			<key>pfm_documentation_url</key>
			<string>https://www.barebones.com/support/bbedit/ExpertPreferences.html#misc</string>
			<key>pfm_name</key>
			<string>OpenPanelShowsFrontDocumentDirectory</string>
			<key>pfm_title</key>
			<string>Open Panel Shows Active Document Directory</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_title</key>
	<string>BBEdit</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>5</integer>
</dict>
</plist>
