<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_app_url</key>
		<string>https://www.dragonframe.com</string>
		<key>pfm_description</key>
		<string>Dragonframe 4 settings</string>
		<key>pfm_domain</key>
		<string>com.dzed.Dragonframe4</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_last_modified</key>
		<date>2019-09-03T21:43:00Z</date>
		<key>pfm_subkeys</key>
		<array>
			<dict>
				<key>pfm_default</key>
				<string>Configures Dragonframe 4 settings</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>Dragonframe 4</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>https://www.dragonframe.com</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>https://www.dragonframe.com</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string/>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Set to FALSE to disable automatic update checks</string>
				<key>pfm_name</key>
				<string>updates.autoCheck</string>
				<key>pfm_title</key>
				<string>Automatic Update Checks</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Suppress update messaging. Correct value is the whole version number, e.g. 4.3.2. Multiple versions can be specified.</string>
				<key>pfm_name</key>
				<string>updates.ignoreVersion.DRAGON4</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>Version</string>
						<key>pfm_type</key>
						<string>string</string>
						<key>pfm_value_placeholder</key>
						<string>9.9.9</string>
					</dict>
				</array>
				<key>pfm_title</key>
				<string>Suppress Update Messages</string>
				<key>pfm_type</key>
				<string>array</string>
			</dict>
		</array>
		<key>pfm_targets</key>
		<array>
			<string>system</string>
			<string>user</string>
		</array>
		<key>pfm_title</key>
		<string>Dragonframe 4</string>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_version</key>
		<integer>1</integer>
	</dict>
</plist>
