<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://www.office.com</string>
	<key>pfm_description</key>
	<string>Microsoft Excel settings</string>
	<key>pfm_documentation_url</key>
	<string>https://docs.google.com/spreadsheets/d/1ESX5td0y0OP3jdzZ-C2SItm-TUi-iA_bcHCBvaoCumw/edit#gid=0</string>
	<key>pfm_domain</key>
	<string>com.microsoft.Excel</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2019-01-18T00:10:00Z</date>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Microsoft Excel settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Microsoft Excel</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.Excel</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.Excel</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.27.0</string>
			<key>pfm_description</key>
			<string>Prevent user from signing in to any O365 service.</string>
			<key>pfm_description_reference</key>
			<string>This will prevent user from signing in to any O365 service. This has the added effect of making sure users store no data online via microsoft servers.

* As of 16.13.0 these options work again.
            0 - all accounts allowed
            1 - prevent institutional accounts - only MSA (personal) accounts
            2 - prevent MSA (personal) accounts - only institution accounts
            4 - no accounts allowed to sign in</string>
			<key>pfm_name</key>
			<string>SignInOptions</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
				<integer>4</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>All accounts allowed</string>
				<string>Only personal accounts (MSA)</string>
				<string>Only institution accounts</string>
				<string>No accounts allowed</string>
			</array>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the "Smile" feature.</string>
			<key>pfm_description_reference</key>
			<string>This key when set to false will deactivate the ability for users to use the "Smile" feature.</string>
			<key>pfm_name</key>
			<string>SendASmileEnabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Set to false to send minimal heartbeat data, no application usage, and no environment details.</string>
			<key>pfm_description_reference</key>
			<string>Set to false to send minimal heartbeat data, no application usage, and no environment details.</string>
			<key>pfm_name</key>
			<string>SendAllTelemetryEnabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the "What's New" dialog and Office 365 activation prompt on first launch.</string>
			<key>pfm_description_reference</key>
			<string>Controls the original "What's New" dialog and Office 365 activation prompt on first launch.</string>
			<key>pfm_name</key>
			<string>kSubUIAppCompletedFirstRunSetup1507</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.13.1</string>
			<key>pfm_description</key>
			<string>Disable the "Connected Services" screen when updating from pre-16.13. (MSA-based accounts).</string>
			<key>pfm_description_reference</key>
			<string>MSA-based Key to suppress a screen on update from pre-16.13 called "Connected Services" with an Accept button on it. If you wish to suppress this new dialog for MSA-based accounts set this key to TRUE.</string>
			<key>pfm_name</key>
			<string>kFRETelemetryConsentKey</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.13.1</string>
			<key>pfm_description</key>
			<string>Disable the "Connected Services" screen when updating from pre-16.13. (OrgID accounts).</string>
			<key>pfm_description_reference</key>
			<string>OrgID-based Key to suppress a screen on update from pre-16.13 called "Connected Services" with an OK button on it. If you wish to suppress this new dialog for OrgID users set this key to TRUE.</string>
			<key>pfm_name</key>
			<string>kFREEnterpriseTelemetryInfoKey</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.32</string>
			<key>pfm_description</key>
			<string>Array of sequential ints to disable the "What's New" dialog on first lauch after upgrades.</string>
			<key>pfm_description_reference</key>
			<string>Controls the dynamic "What's New" dialog on first lauch after upgrades. An array of sequential ints. This may change due to MS Bug VSO #1476177.</string>
			<key>pfm_name</key>
			<string>OUIWhatsNewShownItemIds</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Int</string>
					<key>pfm_description_reference</key>
					<string></string>
					<key>pfm_name</key>
					<string>OUIWhatsNewShownItemId</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.17</string>
			<key>pfm_description</key>
			<string>Disable the "Use Intelligent Services?" pop-up dialog when updating from pre-16.17.</string>
			<key>pfm_description_reference</key>
			<string>Users who are activated with O365 will see a new "Use Intelligent Services?" pop-up dialog in Word, Excel &amp; PowerPoint after updating to 16.17. The net effect of doing this will enable Researcher (Word), Translate (Word, Excel, PowerPoint), Smart Lookup (Word, PowerPoint), and QuickStarter (PowerPoint). Set to TRUE to auto-accept. Requires "kFREIntelligenceServicesConsentV2Key" as well.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>kFREIntelligenceServicesConsentV2Key</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>kFREIntelligenceServicesConsentV2Key</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>PII_And_Intelligent_Services_Preference</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.17</string>
			<key>pfm_description</key>
			<string>Disable the "Use Intelligent Services?" pop-up dialog when updating from pre-16.17.</string>
			<key>pfm_description_reference</key>
			<string>Users who are activated with O365 will see a new "Use Intelligent Services?" pop-up dialog in Word, Excel &amp; PowerPoint after updating to 16.17. The net effect of doing this will enable Researcher (Word), Translate (Word, Excel, PowerPoint), Smart Lookup (Word, PowerPoint), and QuickStarter (PowerPoint). Set to TRUE to auto-accept. Requires "PII_And_Intelligent_Services_Preference" as well.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>PII_And_Intelligent_Services_Preference</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>PII_And_Intelligent_Services_Preference</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>kFREIntelligenceServicesConsentV2Key</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.20</string>
			<key>pfm_description</key>
			<string>Disables Excel from using a Default password when attempting to unlock encrypted files.</string>
			<key>pfm_description_reference</key>
			<string>By default, when Excel opens an encrypted file, Excel tries to use a default password to decrypt the file. This preference prevents Excel, version 16.20 or higher, from trying a default decryption password.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>TryDefaultPassword</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>TryDefaultPassword</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>TryDefaultPassword</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string></string>
			<key>pfm_description</key>
			<string>Sends crash reports even if telemetry is disabled.</string>
			<key>pfm_description_reference</key>
			<string>This will stop your client devices sending us usage telemetry and asking questions to your users, but if the app crashes, we'll still invoke our Error Reporting dialog and get the call-stack back here so we can see if you're running into problems. The issue here is that if you don't enable crash reporting, we are completely blind as to whether folks out there are having problems or not. Relevant for those who disable telemetry through the SendAllTelemetryEnabled key.</string>
			<key>pfm_name</key>
			<string>SendCrashReportsEvenWithTelemetryDisabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Microsoft Excel</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>
