<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://github.com/macadmins/supportcompanion/releases</string>
	<key>pfm_description</key>
	<string>Support Companion settings</string>
	<key>pfm_documentation_url</key>
	<string>https://github.com/macadmins/supportcompanion</string>
	<key>pfm_domain</key>
	<string>com.github.macadmins.SupportCompanion</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2024-12-05T14:27:55Z</date>
	<key>pfm_macos_min</key>
	<string>14.0</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Support Companion configuration preferences</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Support Companion</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.github.macadmins.SupportCompanion</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.github.macadmins.SupportCompanion</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Home</string>
				<string>Menu</string>
				<string>Notifications</string>
				<string>Branding</string>
				<string>Mode</string>
				<string>Tray menu</string>
				<string>Desktop Info</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Branding</key>
				<array>
					<string>BrandName</string>
					<string>AccentColor</string>
					<string>BrandLogo</string>
					<string>BrandLogoLight</string>
				</array>
				<key>Desktop Info</key>
				<array>
					<string>ShowDesktopInfo</string>
					<string>DesktopInfoWindowPosition</string>
					<string>DesktopInfoLevel</string>
					<string>DesktopInfoHideItems</string>
					<string>DesktopInfoBackgroundOpacity</string>
					<string>DesktopInfoFontSize</string>
				</array>
				<key>Home</key>
				<array>
					<string>HiddenCards</string>
					<string>HiddenActions</string>
					<string>SupportEmail</string>
					<string>SupportPhone</string>
					<string>SupportPageUrl</string>
					<string>ChangePasswordUrl</string>
					<string>ChangePasswordMode</string>
					<string>LogFolders</string>
					<string>CustomCardPath</string>
				</array>
				<key>Menu</key>
				<array>
					<string>KnowledgeBaseUrl</string>
					<string>MenuShowIdentity</string>
					<string>MenuShowApps</string>
					<string>MenuShowSelfService</string>
					<string>MenuShowCompanyPortal</string>
					<string>MenuShowKnowledgeBase</string>
				</array>
				<key>Mode</key>
				<array>
					<string>Mode</string>
				</array>
				<key>Notifications</key>
				<array>
					<string>NotificationInterval</string>
					<string>NotificationTitle</string>
					<string>NotificationImage</string>
					<string>SoftwareUpdateNotificationMessage</string>
					<string>SoftwareUpdateNotificationButtonText</string>
					<string>AppUpdateNotificationMessage</string>
					<string>AppUpdateNotificationButtonText</string>
				</array>
				<key>Tray menu</key>
				<array>
					<string>Actions</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If configured, a menu item "Knowledge base" will show up where the user can browse the page from the UI.</string>
			<key>pfm_name</key>
			<string>KnowledgeBaseUrl</string>
			<key>pfm_title</key>
			<string>Knowledge Base Url</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://google.com</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures whether to show the Identity menu item. Defaults to true</string>
			<key>pfm_name</key>
			<string>MenuShowIdentity</string>
			<key>pfm_title</key>
			<string>Show Identity Menu Item</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures whether to show the Apps menu item. Defaults to true</string>
			<key>pfm_name</key>
			<string>MenuShowApps</string>
			<key>pfm_title</key>
			<string>Show Apps Menu Item</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures whether to show the Self Service menu item. Defaults to true</string>
			<key>pfm_name</key>
			<string>MenuShowSelfService</string>
			<key>pfm_title</key>
			<string>Show Self Service Menu Item</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures whether to show the Company Portal menu item. Defaults to true</string>
			<key>pfm_name</key>
			<string>MenuShowCompanyPortal</string>
			<key>pfm_title</key>
			<string>Show Company Portal Menu Item</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures whether to show the Knowledge Base menu item. Defaults to true</string>
			<key>pfm_name</key>
			<string>MenuShowKnowledgeBase</string>
			<key>pfm_title</key>
			<string>Show Knowledge Base Menu Item</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<true/>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the name shown in the navigation menu.</string>
			<key>pfm_name</key>
			<string>BrandName</string>
			<key>pfm_title</key>
			<string>Brand Name</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>AwesomeCorp</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the brand color shown in the app, specify in hex format.</string>
			<key>pfm_name</key>
			<string>AccentColor</string>
			<key>pfm_title</key>
			<string>Accent Color</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>#FFFFFF</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the brand logo shown in the apps side menu. Specify a Base64 string.</string>
			<key>pfm_name</key>
			<string>BrandLogo</string>
			<key>pfm_title</key>
			<string>Brand Logo</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Base64 String</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the brand logo shown in the apps side menu when light theme is used. Specify a base64 string</string>
			<key>pfm_name</key>
			<string>BrandLogoLight</string>
			<key>pfm_title</key>
			<string>Brand Logo Light</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Base64 String</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the URL to open when the user clicks on the Get Support button.</string>
			<key>pfm_name</key>
			<string>SupportPageUrl</string>
			<key>pfm_title</key>
			<string>Support Page URL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://awesomecorp.support</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the URL to open when the user clicks on the Change Password button.</string>
			<key>pfm_name</key>
			<string>ChangePasswordUrl</string>
			<key>pfm_title</key>
			<string>Change Password URL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://awesomecorp.support/changepassword</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the mode for the Change Password button, available modes are: local, SSOExtension, url. Defaults to local if not configured.</string>
			<key>pfm_name</key>
			<string>ChangePasswordMode</string>
			<key>pfm_range_list</key>
			<array>
				<string>local</string>
				<string>SSOExtension</string>
				<string>url</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Local</string>
				<string>SSO Extension</string>
				<string>URL</string>
			</array>
			<key>pfm_title</key>
			<string>Change Password Mode</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the email address shown when the user clicks on the Support Info button.</string>
			<key>pfm_name</key>
			<string>SupportEmail</string>
			<key>pfm_title</key>
			<string>Support Email</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>support@awesomecorp.io</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the phone number shown when the user clicks on the Support Info button.</string>
			<key>pfm_name</key>
			<string>SupportPhone</string>
			<key>pfm_title</key>
			<string>Support Phone</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>111-222-333-4444</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures which cards to hide, available cards are: DeviceInformation, Evergreen, Battery, Actions, ApplicationInstallProgress, Storage, DeviceManagement, PendingAppUpdates.</string>
			<key>pfm_name</key>
			<string>HiddenCards</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Hidden Cards</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures which actions to hide, available actions are: ChangePassword, Reboot, OpenManagementApp, GetSupport, GatherLogs, SoftwareUpdates, RestartIntuneAgent.</string>
			<key>pfm_name</key>
			<string>HiddenActions</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Hidden Actions</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the interval for notifications in hours for Application Updates and Software Updates notifications.</string>
			<key>pfm_name</key>
			<string>NotificationInterval</string>
			<key>pfm_range_max</key>
			<integer>24</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Notification Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the title for notifications for notifications. Defaults to Support Companion if not configured.</string>
			<key>pfm_name</key>
			<string>NotificationTitle</string>
			<key>pfm_title</key>
			<string>Notification Title</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>AwesomeCorp</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures an image to add to notifications. Local path should be specified.</string>
			<key>pfm_name</key>
			<string>NotificationImage</string>
			<key>pfm_title</key>
			<string>Notification Image</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Software Updates Available. Please update your device to the latest version.</string>
			<key>pfm_description</key>
			<string>Configures the message for notifications for Software Updates notifications. Defaults to "Software Updates Available. Please update your device to the latest version." if not configured.</string>
			<key>pfm_name</key>
			<string>SoftwareUpdateNotificationMessage</string>
			<key>pfm_title</key>
			<string>Software Update Notification Message</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Update Now 🚀</string>
			<key>pfm_description</key>
			<string>Configures the button text for notifications for Software Updates notifications. Defaults to "Update Now 🚀" if not configured.</string>
			<key>pfm_name</key>
			<string>SoftwareUpdateNotificationButtonText</string>
			<key>pfm_title</key>
			<string>Software Update Notification Button Text</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>App Updates Available. Please update your apps to the latest version.</string>
			<key>pfm_description</key>
			<string>Configures the message for notifications for App Updates notifications. Defaults to "App Updates Available. Please update your apps to the latest version." if not configured.</string>
			<key>pfm_name</key>
			<string>AppUpdateNotificationMessage</string>
			<key>pfm_title</key>
			<string>App Update Notification Message</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Update Now 🚀</string>
			<key>pfm_description</key>
			<string>Configures the button text for notifications for App Updates notifications. Defaults to "Update Now 🚀" if not configured.</string>
			<key>pfm_name</key>
			<string>AppUpdateNotificationButtonText</string>
			<key>pfm_title</key>
			<string>App Update Notification Button Text</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the app to show application info for either Munki, Intune or to use System profiler for app info. The app tries to dynamically detect which mode to use.</string>
			<key>pfm_name</key>
			<string>Mode</string>
			<key>pfm_range_list</key>
			<array>
				<string>Munki</string>
				<string>Intune</string>
				<string>SystemProfiler</string>
			</array>
			<key>pfm_title</key>
			<string>Mode</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the log folders to gather logs from. Only used when gathering logs. Defaults to "/Library/Logs/Microsoft" if not configured.</string>
			<key>pfm_name</key>
			<string>LogFolders</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>/Library/Managed Installs/Logs</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Log Folders</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures custom actions to add to the tray menu. See example below.</string>
			<key>pfm_name</key>
			<string>Actions</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Name of the action to show in the menu.</string>
							<key>pfm_name</key>
							<string>Name</string>
							<key>pfm_title</key>
							<string>Name</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>Awesome command</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Command to run when to item is clicked.</string>
							<key>pfm_name</key>
							<string>Command</string>
							<key>pfm_title</key>
							<string>Command</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>killall pboard</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>SF Symbol to show in the Self Service page in the UI.</string>
							<key>pfm_name</key>
							<string>Icon</string>
							<key>pfm_title</key>
							<string>Icon</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>questionmark</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>SF Symbol to show in the Self Service page in the UI.</string>
							<key>pfm_name</key>
							<string>IsPrivileged</string>
							<key>pfm_title</key>
							<string>Is Privileged</string>
							<key>pfm_type</key>
							<string>boolean</string>
							<key>pfm_value_placeholder</key>
							<true/>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Description to show in the Self Service page in the UI.</string>
							<key>pfm_name</key>
							<string>Description</string>
							<key>pfm_title</key>
							<string>Description</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>Restart the pboard service</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Actions</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Configures the desktop info widget.</string>
			<key>pfm_name</key>
			<string>ShowDesktopInfo</string>
			<key>pfm_title</key>
			<string>Show Desktop Info</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>LowerRight</string>
			<key>pfm_description</key>
			<string>Configures the position of the desktop info. Defaults to Lower Right.</string>
			<key>pfm_name</key>
			<string>DesktopInfoWindowPosition</string>
			<key>pfm_range_list</key>
			<array>
				<string>UpperLeft</string>
				<string>UpperRight</string>
				<string>LowerLeft</string>
				<string>LowerRight</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Upper Left</string>
				<string>Upper Right</string>
				<string>Lower Left</string>
				<string>Lower Right</string>
			</array>
			<key>pfm_title</key>
			<string>Desktop Position</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the level of information to show on the desktop. Defaults to 4.</string>
			<key>pfm_name</key>
			<string>DesktopInfoLevel</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
				<integer>4</integer>
				<integer>5</integer>
			</array>
			<key>pfm_title</key>
			<string>Desktop Info Level</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Use this array to determine which information to hide. Available items are: HostName, Model, SerialNumber, Processor, IPAddress, Memory, OSBuild, OSVersion, LastRestart, FileVault, StorageName, SupportPhone, SupportEmail. It is also possible to hide entire sections: Hardware Specifications, System Information, Network Information, Storage, Support.</string>
			<key>pfm_name</key>
			<string>DesktopInfoHideItems</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_range_list</key>
					<array>
						<string>HostName</string>
						<string>Model</string>
						<string>SerialNumber</string>
						<string>Processor</string>
						<string>IPAddress</string>
						<string>Memory</string>
						<string>OSBuild</string>
						<string>OSVersion</string>
						<string>LastRestart</string>
						<string>FileVault</string>
						<string>StorageName</string>
						<string>SupportPhone</string>
						<string>SupportEmail</string>
						<string>Hardware Specifications</string>
						<string>System Information</string>
						<string>Network Information</string>
						<string>Storage</string>
						<string>Support</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Host Name</string>
						<string>Model</string>
						<string>Serial Number</string>
						<string>Processor</string>
						<string>IP Address</string>
						<string>Memory</string>
						<string>OS Build</string>
						<string>OS Version</string>
						<string>Last Restart</string>
						<string>FileVault</string>
						<string>Storage Name</string>
						<string>Support Phone</string>
						<string>Support Email</string>
						<string>Hardware Specifications</string>
						<string>System Information</string>
						<string>Network Information</string>
						<string>Storage</string>
						<string>Support</string>
					</array>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Desktop Info Hide Items</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>1</real>
			<key>pfm_description</key>
			<string>Configures the opacity of the desktop info. Defaults to 0%.</string>
			<key>pfm_name</key>
			<string>DesktopInfoBackgroundOpacity</string>
			<key>pfm_range_list</key>
			<array>
				<real>0.10000000000000001</real>
				<real>0.20000000000000001</real>
				<real>0.29999999999999999</real>
				<real>0.40000000000000002</real>
				<real>0.5</real>
				<real>0.59999999999999998</real>
				<real>0.69999999999999996</real>
				<real>0.80000000000000004</real>
				<real>0.90000000000000002</real>
				<real>1</real>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>10%</string>
				<string>20%</string>
				<string>30%</string>
				<string>40%</string>
				<string>50%</string>
				<string>60%</string>
				<string>70%</string>
				<string>80%</string>
				<string>90%</string>
				<string>100%</string>
			</array>
			<key>pfm_title</key>
			<string>Desktop Info Background Opacity</string>
			<key>pfm_type</key>
			<string>real</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>14</integer>
			<key>pfm_description</key>
			<string>Configures the font size for the desktop info. Defaults to 14.</string>
			<key>pfm_name</key>
			<string>DesktopInfoFontSize</string>
			<key>pfm_range_max</key>
			<integer>24</integer>
			<key>pfm_range_min</key>
			<integer>8</integer>
			<key>pfm_title</key>
			<string>Desktop Info Font Size</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures a path to a JSON file containing custom widgets to show on the Home view.</string>
			<key>pfm_name</key>
			<string>CustomCardPath</string>
			<key>pfm_title</key>
			<string>Custom Card Path</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Library/Application Support/SupportCompanion/awesomecorp.json</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Support Companion</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
