<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://github.com/twocanoes/xcreds</string>
	<key>pfm_description</key>
	<string>XCreds OAuth Settings</string>
	<key>pfm_documentation_url</key>
	<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide</string>
	<key>pfm_domain</key>
	<string>com.twocanoes.xcreds</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-09-09T13:50:21Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures XCreds configuration preferences</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>XCreds</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.twocanoes.xcreds</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.twocanoes.xcreds</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The OIDC client id public identifier for the app.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#clientid</string>
			<key>pfm_name</key>
			<string>clientID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Client ID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Client Secret sometimes required by identity provider.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#clientsecret</string>
			<key>pfm_name</key>
			<string>clientSecret</string>
			<key>pfm_title</key>
			<string>Client Secret</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When set to true and the user account is created, the user will be a local admin.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#createadminuser</string>
			<key>pfm_name</key>
			<string>CreateAdminUser</string>
			<key>pfm_title</key>
			<string>Create User as Admin</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>https://login.microsoftonline.com/common/.well-known/openid-configuration</string>
			<key>pfm_description</key>
			<string>The discovery URL provided by your OIDC / Cloud provider.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#discoveryurl</string>
			<key>pfm_name</key>
			<string>discoveryURL</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Discovery URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Enabled FDE enabled at first login on APFS disks.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#enablefde</string>
			<key>pfm_name</key>
			<string>EnableFDE</string>
			<key>pfm_title</key>
			<string>Enable Full Disk Encryption (FDE)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Save the Personal Recovery Key (PRK) to disk for the MDM Escrow Service to collect.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#enablefderecoverykey</string>
			<key>pfm_name</key>
			<string>EnableFDERecoveryKey</string>
			<key>pfm_title</key>
			<string>Save PRK</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specify a custom path for the recovery key.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#enablefderecoverykeypath</string>
			<key>pfm_name</key>
			<string>EnableFDERecoveryKeyPath</string>
			<key>pfm_title</key>
			<string>FDE Recovery Key Path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Rotate the Personal Recovery Key (PRK).</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#enablefderekey</string>
			<key>pfm_name</key>
			<string>EnableFDERekey</string>
			<key>pfm_title</key>
			<string>Enable FDE Rekey</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>file:///System/Library/Desktop Pictures/Monterey Graphic.heic</string>
			<key>pfm_description</key>
			<string>URL to an image to show in the background while logging in.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#loginwindowbackgroundimageurl</string>
			<key>pfm_format</key>
			<string>(https?://|file:///).*</string>
			<key>pfm_name</key>
			<string>loginWindowBackgroundImageURL</string>
			<key>pfm_title</key>
			<string>Login Window Background Image URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Add a menu item for changing the password that will open this URL when the menu item is selected.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#passwordchangeurl</string>
			<key>pfm_format</key>
			<string>https?://.*</string>
			<key>pfm_name</key>
			<string>passwordChangeURL</string>
			<key>pfm_title</key>
			<string>Password Change URL for Menu</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>xcreds://auth/</string>
			<key>pfm_description</key>
			<string>URI to redirect to when authentication is complete.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#redirecturi</string>
			<key>pfm_name</key>
			<string>redirectURI</string>
			<key>pfm_title</key>
			<string>Redirect URI</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>3</integer>
			<key>pfm_description</key>
			<string>Number of hours for checking for password changes. Default is 3 hours. Minimum is 1 hour.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#refreshratehours</string>
			<key>pfm_name</key>
			<string>refreshRateHours</string>
			<key>pfm_range_max</key>
			<integer>168</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Password Change Check Rate</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>hours</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>profile openid offline_access</string>
			<key>pfm_description</key>
			<string>OIDC Scopes</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#scopes</string>
			<key>pfm_name</key>
			<string>scopes</string>
			<key>pfm_note</key>
			<string>All scopes should be lowercase and separated by single spaces</string>
			<key>pfm_title</key>
			<string>Scopes</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>When using Google IdP, a refresh token may need be requested in a non-standard way.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#shouldsetgoogleaccesstypetooffline</string>
			<key>pfm_name</key>
			<string>shouldSetGoogleAccessTypeToOffline</string>
			<key>pfm_title</key>
			<string>Request Google Refresh Token</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Determine if the mac login window or the cloud login window is shown by default</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#shouldshowcloudloginbydefault</string>
			<key>pfm_name</key>
			<string>shouldShowCloudLoginByDefault</string>
			<key>pfm_title</key>
			<string>Show Cloud Login By Default</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show the About Menu</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#shouldshowaboutmenu</string>
			<key>pfm_name</key>
			<string>shouldShowAboutMenu</string>
			<key>pfm_title</key>
			<string>Show About Menu</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show Configure WiFi button in XCreds Login.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#shouldshowconfigurewifibutton</string>
			<key>pfm_name</key>
			<string>shouldShowConfigureWifiButton</string>
			<key>pfm_title</key>
			<string>Show Configure WiFi</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If no settings are specified, preferences will not be shown on startup.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#shouldshowpreferencesonstart</string>
			<key>pfm_name</key>
			<string>shouldShowPreferencesOnStart</string>
			<key>pfm_title</key>
			<string>Show Preferences on Startup</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show the Mac Login Window button in XCreds Login.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#shouldshowmacloginbutton</string>
			<key>pfm_name</key>
			<string>shouldShowMacLoginButton</string>
			<key>pfm_title</key>
			<string>Show Mac Login Window button</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show message in XCreds Login reminding people to buy support.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#shouldshowsupportstatus</string>
			<key>pfm_name</key>
			<string>shouldShowSupportStatus</string>
			<key>pfm_title</key>
			<string>Show Support Status Message</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show Quit Menu Item in the menu.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#shouldshowquitmenu</string>
			<key>pfm_name</key>
			<string>shouldShowQuitMenu</string>
			<key>pfm_title</key>
			<string>Show Quit Menu Item</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show the version number and build number in the lower left corner of XCreds Login.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#shouldshowversioninfo</string>
			<key>pfm_name</key>
			<string>shouldShowVersionInfo</string>
			<key>pfm_title</key>
			<string>Show Version and Build Number</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Show debug local notifications.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#showdebug</string>
			<key>pfm_name</key>
			<string>showDebug</string>
			<key>pfm_title</key>
			<string>Show Debug Message</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>When a user uses cloud login, XCreds will try and figure out the local username based on the email or other data returned for the IdP. Use this value to force the local username for any cloud login. Provide only the shortname.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#username</string>
			<key>pfm_name</key>
			<string>username</string>
			<key>pfm_title</key>
			<string>Local Username</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Show prompt to verify cloud password before setting keychain and login.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#verifypassword</string>
			<key>pfm_name</key>
			<string>verifyPassword</string>
			<key>pfm_title</key>
			<string>Verify Cloud Password</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>hostname of the page that has the password field.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#idphostname</string>
			<key>pfm_name</key>
			<string>idpHostName</string>
			<key>pfm_title</key>
			<string>IDP Host Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>array of hostnames of the page that has the password field.</string>
			<key>pfm_name</key>
			<string>idpHostNames</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>idpHostName</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>idpHostNames</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>password element id of the html element that has the password.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#passwordelementid</string>
			<key>pfm_name</key>
			<string>passwordElementID</string>
			<key>pfm_title</key>
			<string>Password Element ID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.1</string>
			<key>pfm_default</key>
			<string>given_name</string>
			<key>pfm_description</key>
			<string>Local DS to OIDC Mapping for First Name</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#map_firstname</string>
			<key>pfm_name</key>
			<string>map_firstname</string>
			<key>pfm_note</key>
			<string>Map firstName to OIDC claim</string>
			<key>pfm_title</key>
			<string>First Name OIDC Mapping</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.1</string>
			<key>pfm_default</key>
			<string>family_name</string>
			<key>pfm_description</key>
			<string>Local DS to OIDC Mapping for Last Name</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#map_lastname</string>
			<key>pfm_name</key>
			<string>map_lastname</string>
			<key>pfm_note</key>
			<string>Map lastName to OIDC claim</string>
			<key>pfm_title</key>
			<string>Last Name OIDC Mapping</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.1</string>
			<key>pfm_default</key>
			<string>name</string>
			<key>pfm_description</key>
			<string>Local DS to OIDC Mapping for Name</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#map_fullname</string>
			<key>pfm_name</key>
			<string>map_fullname</string>
			<key>pfm_note</key>
			<string>Map fullName to OIDC claim</string>
			<key>pfm_title</key>
			<string>Full Name OIDC Mapping</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.1</string>
			<key>pfm_default</key>
			<string>name</string>
			<key>pfm_description</key>
			<string>Local DS to OIDC Mapping for Name</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/twocanoes/xcreds/wiki/AdminGuide#map_username</string>
			<key>pfm_name</key>
			<string>map_username</string>
			<key>pfm_note</key>
			<string>Map Username to OIDC claim</string>
			<key>pfm_title</key>
			<string>Username OIDC Mapping</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>XCreds</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>3</integer>
</dict>
</plist>
