<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://github.com/macadmins/nudge</string>
	<key>pfm_description</key>
	<string>Nudge settings</string>
	<key>pfm_documentation_url</key>
	<string>https://github.com/macadmins/nudge/wiki/Preferences</string>
	<key>pfm_domain</key>
	<string>com.github.macadmins.Nudge</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2024-07-29T11:47:04Z</date>
	<key>pfm_macos_min</key>
	<string>11.0</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Nudge settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Nudge</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.github.macadmins.Nudge</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.github.macadmins.Nudge</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Optional Features</string>
				<string>OS Version Requirements</string>
				<string>UX</string>
				<string>UI</string>
				<string>JSON Preferences File</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>JSON Preferences File</key>
				<array>
					<string>json-url</string>
				</array>
				<key>OS Version Requirements</key>
				<array>
					<string>osVersionRequirements</string>
				</array>
				<key>Optional Features</key>
				<array>
					<string>acceptableApplicationBundleIDs</string>
					<string>acceptableAssertionUsage</string>
					<string>acceptableAssertionApplicationNames</string>
					<string>acceptableCameraUsage</string>
					<string>acceptableScreenSharingUsage</string>
					<string>aggressiveUserExperience</string>
					<string>aggressiveUserFullScreenExperience</string>
					<string>attemptToBlockApplicationLaunches</string>
					<string>asynchronousSoftwareUpdate</string>
					<string>blockedApplicationBundleIDs</string>
					<string>disableSoftwareUpdateWorkflow</string>
					<string>terminateApplicationsOnLaunch</string>
					<string>attemptToFetchMajorUpgrade</string>
					<string>enforceMinorUpdates</string>
					<string>optionalFeatures</string>
				</array>
				<key>UI</key>
				<array>
					<string>actionButtonPath</string>
					<string>fallbackLanguage</string>
					<string>forceFallbackLanguage</string>
					<string>forceScreenShotIcon</string>
					<string>iconDarkPath</string>
					<string>iconLightPath</string>
					<string>screenShotDarkPath</string>
					<string>screenShotLightPath</string>
					<string>showDeferralCount</string>
					<string>simpleMode</string>
					<string>singleQuitButton</string>
					<string>updateElements</string>
					<string>userInterface</string>
				</array>
				<key>UX</key>
				<array>
					<string>allowedDeferrals</string>
					<string>allowedDeferralsUntilForcedSecondaryQuitButton</string>
					<string>allowGracePeriods</string>
					<string>allowUserQuitDeferrals</string>
					<string>approachingRefreshCycle</string>
					<string>approachingWindowTime</string>
					<string>elapsedRefreshCycle</string>
					<string>gracePeriodInstallDelay</string>
					<string>gracePeriodLaunchDelay</string>
					<string>gracePeriodPath</string>
					<string>imminentRefeshCycle</string>
					<string>imminentWindowTime</string>
					<string>initialRefreshCycle</string>
					<string>maxRandomDelayInSeconds</string>
					<string>noTimers</string>
					<string>nudgeRefreshCycle</string>
					<string>randomDelay</string>
					<string>userExperience</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>All optional features to enhance and customize the Nudge experience for your employer's needs.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/macadmins/nudge/wiki/Preferences#optionalfeatures---type-hash-default-value-</string>
			<key>pfm_name</key>
			<string>optionalFeatures</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.4</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>When a major upgrade is required, Nudge will attempt to download it through the softwareupdate binary.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#attempttofetchmajorupgrade---type-boolean-default-value-true-required-no</string>
					<key>pfm_name</key>
					<string>attemptToFetchMajorUpgrade</string>
					<key>pfm_title</key>
					<string>Attempt to Fetch Major Upgrade</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.7</string>
					<key>pfm_description</key>
					<string>The application Bundle ID which Nudge allows without taking focus. (You can specify one or more Bundle ID.)</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#acceptableapplicationbundleids---type-array-default-value--required-no</string>
					<key>pfm_name</key>
					<string>acceptableApplicationBundleIDs</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_title</key>
							<string>acceptableApplicationBundleIDs</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>us.zoom.xos</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Acceptable Application Bundle IDs</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.7</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>When enabled, Nudge will not activate or re-activate when assertions are currently set.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#acceptableassertionusage---type-boolean-default-value-false-required-no</string>
					<key>pfm_name</key>
					<string>acceptableAssertionUsage</string>
					<key>pfm_title</key>
					<string>Acceptable Assertion Usage</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.7</string>
					<key>pfm_description</key>
					<string>The application names using assertions which Nudge allows without taking focus. (You can specify one or more applications. To find the names please run /usr/bin/pmset -g assertions in terminal while the application is open and running)</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#acceptableassertionapplicationnames---type-array-default-value--required-no</string>
					<key>pfm_name</key>
					<string>acceptableAssertionApplicationNames</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_title</key>
							<string>acceptableAssertionApplicationNames</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>zoom.us</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Acceptable Assertion Application Names</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.7</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>When enabled, Nudge will not activate or re-activate when the camera is on.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#acceptablecameraUsage---type-boolean-default-value-false-required-no</string>
					<key>pfm_name</key>
					<string>acceptableCameraUsage</string>
					<key>pfm_note</key>
					<string>acceptableCameraUsage will be ignored by Nudge when the host computer has passed the required installation date.</string>
					<key>pfm_title</key>
					<string>Acceptable Camera Usage</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.7</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>When enabled, Nudge will not activate or re-activate when screen sharing is active.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#acceptablescreensharingusage---type-boolean-default-value-false-required-no</string>
					<key>pfm_name</key>
					<string>acceptableScreenSharingUsage</string>
					<key>pfm_title</key>
					<string>Acceptable Screen Sharing Usage</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.0</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>When disabled, Nudge will not hide all non-acceptableApplicationBundleIDs after the requiredInstallationDate or allowedDeferrals.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#aggressiveuserexperience---type-boolean-default-value-true-required-no</string>
					<key>pfm_name</key>
					<string>aggressiveUserExperience</string>
					<key>pfm_title</key>
					<string>Aggressive User Experience</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.7</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>When disabled, Nudge will not create a blurred background when the user is past the deferral window.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#aggressiveuserfullscreenexperience---type-boolean-default-value-true-required-no</string>
					<key>pfm_name</key>
					<string>aggressiveUserFullScreenExperience</string>
					<key>pfm_title</key>
					<string>Aggressive User Full Screen Experience</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.4</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>When disabled, Nudge will wait for Software Update to finish downloading (if any) updates before showing the UI.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#asynchronoussoftwareupdate---type-boolean-default-value-true-required-no</string>
					<key>pfm_name</key>
					<string>asynchronousSoftwareUpdate</string>
					<key>pfm_title</key>
					<string>Asynchronous Software Update</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.7</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>When enabled, Nudge will attempt to block application launches after the required installation date. This key must be used in conjunction with blockedApplicationBundleIDs</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#attemptToBlockApplicationLaunches---type-boolean-default-value-false-required-no</string>
					<key>pfm_name</key>
					<string>attemptToBlockApplicationLaunches</string>
					<key>pfm_title</key>
					<string>Attempt To Block Application Launches</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.7</string>
					<key>pfm_description</key>
					<string>The application Bundle ID which Nudge disallows from launching after the required installation date. (You can specify one or more Bundle ID.)</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#blockedApplicationBundleIDs---type-array-default-value--required-no</string>
					<key>pfm_name</key>
					<string>blockedApplicationBundleIDs</string>
					<key>pfm_note</key>
					<string>Do not try to block com.apple.finder in conjunction with terminateApplicationsOnLaunch as launchd will immediately try relaunch it causing loopy behaviour.</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_tile</key>
							<string>Bundle ID</string>
							<key>pfm_title</key>
							<string>blockedApplicationBundleIDs</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>us.zoom.xos</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Blocked Application Bundle IDs</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.5</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>When disableSoftwareUpdateWorkflow is true, Nudge will not attempt to run the softwareupdate process. Defaults to false.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#disablesoftwareupdateworkflow---type-boolean-default-value-false-required-no</string>
					<key>pfm_name</key>
					<string>disableSoftwareUpdateWorkflow</string>
					<key>pfm_title</key>
					<string>Disable Software Update Workflow</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>When enabled, Nudge will enforce minor updates. This should likely never be disabled.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#enforceminorupdates---type-boolean-default-value-true-required-no</string>
					<key>pfm_name</key>
					<string>enforceMinorUpdates</string>
					<key>pfm_title</key>
					<string>Enforce Minor Updates</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>When enabled, Nudge will terminate the applications listed in blockedApplicationBundleIDs upon initial launch.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/optionalFeatures#terminateapplicationsonlaunch---type-boolean-default-value-false-required-no</string>
					<key>pfm_name</key>
					<string>terminateApplicationsOnLaunch</string>
					<key>pfm_title</key>
					<string>Terminate Applications On Launch</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>When enabled, Nudge will not activate or re-activate when an update is being downloaded, prepared or staged.</string>
					<key>pfm_name</key>
					<string>acceptableUpdatePreparingUsage</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>When disabled, Nudge will no longer compare the current device against the SOFA feed for the required update. If the device cannot install this update, Nudge will not present the Unsupported UI</string>
					<key>pfm_name</key>
					<string>attemptToCheckForSupportedDevice</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_description</key>
					<string>A url path to use a custom SOFA feed.</string>
					<key>pfm_name</key>
					<string>customSOFAFeedURL</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>https://sofafeed.macadmins.io/v1/macos_data_feed.json</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>When enabled, Nudge will not activate or re-activate when a user is in DoNotDisturb/Focus status. This feature is expiremental and may not work in all user settings.</string>
					<key>pfm_name</key>
					<string>honorFocusModes</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>When enabled, Nudge will honor the current cycle timers when user's press the `Quit` button.</string>
					<key>pfm_name</key>
					<string>honorCycleTimersOnExit</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_default</key>
					<integer>86400</integer>
					<key>pfm_description</key>
					<string>The maximum age the cached SOFA feed file can be on disk. When this file age expires, Nudge will re-assess the SOFA feed for updates. Please be mindful of changing this value as there is an associated cost for maintaining the SOFA service.</string>
					<key>pfm_name</key>
					<string>refreshSOFAFeedTime</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>86400</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>When enabled, Nudge will utilize the SOFA feed url for update data.</string>
					<key>pfm_name</key>
					<string>utilizeSOFAFeed</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Optional Features</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>The required components necessary to enforce an Operating System version through Nudge. Specify one array to enforce a single Operating System version across all machines or specify multiple arrays for specific enforcements.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/macadmins/nudge/wiki/osVersionRequirements#osversionrequirements---type-array-default-value-</string>
			<key>pfm_name</key>
			<string>osVersionRequirements</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>osVersionRequirement</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>A single URL, enabling the More Info button URL path. While this accepts a string, it must be a valid URL (http://, https://, file://). Note: If this value is passed with aboutUpdateURLs, the aboutUpdateURLs key will be ignored.</string>
							<key>pfm_name</key>
							<string>aboutUpdateURL</string>
							<key>pfm_title</key>
							<string>About Update URL</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://github.com/macadmins/nudge</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>1.0</string>
							<key>pfm_description</key>
							<string>The aboutUpdateURL - per country localization.</string>
							<key>pfm_documentation_url</key>
							<string>https://github.com/macadmins/nudge/wiki/osVersionRequirements#aboutupdateurls---type-array-default-value--required-no</string>
							<key>pfm_name</key>
							<string>aboutUpdateURLs</string>
							<key>pfm_note</key>
							<string>If this value is not passed, the more_info button will be hidden.</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_hidden</key>
									<string>container</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>The targeted language locale for the user interface. Note: For a list of locales, please run the following command in Terminal: /usr/bin/locale -a</string>
											<key>pfm_name</key>
											<string>_language</string>
											<key>pfm_type</key>
											<string>string</string>
											<key>pfm_value_placeholder</key>
											<string>EX: en</string>
										</dict>
										<dict>
											<key>pfm_description</key>
											<string>The URL for the More Info button. While this accepts a string, it must be a valid URL (http://, https://, file://).</string>
											<key>pfm_name</key>
											<string>aboutUpdateURL</string>
											<key>pfm_type</key>
											<string>string</string>
											<key>pfm_value_placeholder</key>
											<string>https://github.com/macadmins/nudge</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>aboutUpdateURL - Dictionary</string>
									<key>pfm_type</key>
									<string>dictionary</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>About Update URLs</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>1.1.3</string>
							<key>pfm_description</key>
							<string>The app path for a major upgrade.</string>
							<key>pfm_documentation_url</key>
							<string>https://github.com/macadmins/nudge/wiki/osVersionRequirements#majorupgradeapppath---type-string-default-value--required-no</string>
							<key>pfm_name</key>
							<string>majorUpgradeAppPath</string>
							<key>pfm_title</key>
							<string>Major macOS Upgrade App Path</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>/Applications/Install macOS Monterey.app</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>1.0</string>
							<key>pfm_description</key>
							<string>The required installation date for Nudge to enforce the required operating system version. You must follow a standard date string as YYYY-MM-DDTHH:MM:SSZ - Example: 2021-09-15T00:00:00Z. Required for Nudge versions 1.1.16 and below.</string>
							<key>pfm_documentation_url</key>
							<string>https://github.com/macadmins/nudge/wiki/osVersionRequirements#requiredinstallationdate---type-string-default-value--required-yes</string>
							<key>pfm_name</key>
							<string>requiredInstallationDate</string>
							<key>pfm_note</key>
							<string>When utilizing a profile it is recommend to use the date key and not the string key for this. While string will work, it is not the recommended key format. A string is necessary for jamfs's JSON Schema Manifest.</string>
							<key>pfm_title</key>
							<string>Required Installation Date</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>2021-09-15T00:00:00Z</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>1.0</string>
							<key>pfm_description</key>
							<string>The required minimum operating system version. Note: When passing versions such as `11.2.0`, it will be normalized to `11.2`. It is recommended to remove the trailing zero from the version number.</string>
							<key>pfm_documentation_url</key>
							<string>https://github.com/macadmins/nudge/wiki/osVersionRequirements#requiredminimumosversion---type-string-default-value--required-yes</string>
							<key>pfm_name</key>
							<string>requiredMinimumOSVersion</string>
							<key>pfm_note</key>
							<string>When passing versions such as 11.2.0 it will be normalized to 11.2. It is recommended to leave the trailing zero off from the version number.</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Required Minimum OS Version</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>11.5.2</string>
						</dict>
						<dict>
							<key>pfm_app_deprecated</key>
							<string>1.1.0</string>
							<key>pfm_app_min</key>
							<string>1.0</string>
							<key>pfm_description</key>
							<string>The versions of macOS that require a security update. You can specify single version or multiple versions.</string>
							<key>pfm_documentation_url</key>
							<string>https://github.com/macadmins/nudge/wiki/osVersionRequirements#targetedosversions-deprecated-as-of-v110---type-array-default-value-</string>
							<key>pfm_name</key>
							<string>targetedOSVersions</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_tile</key>
									<string>OS Version</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Targeted OS Versions</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>1.1.0</string>
							<key>pfm_description</key>
							<string>The OS string rule for targeting Nudge events. You can target with "default", the full OS version (example: "11.5.1"). or the major OS version (example: "11").</string>
							<key>pfm_documentation_url</key>
							<string>https://github.com/macadmins/nudge/wiki/osVersionRequirements#targetedosversionsrule---type-string-default-value--required-no</string>
							<key>pfm_name</key>
							<string>targetedOSVersionsRule</string>
							<key>pfm_note</key>
							<string>Passing identical rules will result in "undefined" behavior. Currently with v1.1.0, the last identical rule will be honored. Passing a value of "default" is identical to not passing this key, allowing concurrent deployments of Nudge v1.0 and v1.1.0 in the same environment.</string>
							<key>pfm_title</key>
							<string>Targeted OS Versions Rule</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>default</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>A path to a URI for opening alternative actions, like Jamf self service items.</string>
							<key>pfm_name</key>
							<string>actionButtonPath</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>jamfselfservice://content?entity=&lt;content_type&gt;&amp;id=&lt;content_id&gt;&amp;action=execute</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>2.0</string>
							<key>pfm_default</key>
							<integer>14</integer>
							<key>pfm_description</key>
							<string>When a major upgrade is under active exploit, this is the amount of days a user has to install the update.</string>
							<key>pfm_name</key>
							<string>activelyExploitedCVEsMajorUpgradeSLA</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_value_placeholder</key>
							<string>14</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>2.0</string>
							<key>pfm_default</key>
							<integer>14</integer>
							<key>pfm_description</key>
							<string>When a minor update is under active exploit, this is the amount of days a user has to install the update.</string>
							<key>pfm_name</key>
							<string>activelyExploitedCVEsMinorUpdateSLA</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_value_placeholder</key>
							<string>14</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>2.0</string>
							<key>pfm_default</key>
							<integer>21</integer>
							<key>pfm_description</key>
							<string>When a major upgrade is not under active exploit but contains CVEs, this is the amount of days a user has to install the update.</string>
							<key>pfm_name</key>
							<string>nonActivelyExploitedCVEsMajorUpgradeSLA</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_value_placeholder</key>
							<string>21</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>2.0</string>
							<key>pfm_default</key>
							<integer>21</integer>
							<key>pfm_description</key>
							<string>When a minor update is not under active exploit but contains CVEs, this is the amount of days a user has to install the update.</string>
							<key>pfm_name</key>
							<string>nonActivelyExploitedCVEsMinorUpdateSLA</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_value_placeholder</key>
							<string>21</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>2.0</string>
							<key>pfm_default</key>
							<integer>28</integer>
							<key>pfm_description</key>
							<string>When a major upgrade has no known CVEs, this is the amount of days a user has to install the update.</string>
							<key>pfm_name</key>
							<string>standardMajorUpgradeSLA</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_value_placeholder</key>
							<string>28</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>2.0</string>
							<key>pfm_default</key>
							<integer>28</integer>
							<key>pfm_description</key>
							<string>When a minor update has no known CVEs, this is the amount of days a user has to install the update.</string>
							<key>pfm_name</key>
							<string>standardMinorupdateSLA</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_value_placeholder</key>
							<string>28</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>2.0</string>
							<key>pfm_description</key>
							<string>A single URL, enabling the More Info button URL path when using the unsupported UI. While this accepts a string, it must be a valid URL (http://, https://, file://). Note: If this value is passed with aboutUpdateURLs, the aboutUpdateURLs key will be ignored.</string>
							<key>pfm_name</key>
							<string>unsupportedURL</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://github.com/macadmins/nudge</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The unsupportedURL - per country localization.</string>
							<key>pfm_name</key>
							<string>unsupportedURLs</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>The targeted language locale for the user interface. Note: For a list of locales, please run the following command in Terminal: /usr/bin/locale -a</string>
											<key>pfm_name</key>
											<string>_language</string>
											<key>pfm_type</key>
											<string>string</string>
											<key>pfm_value_placeholder</key>
											<string>EX: en</string>
										</dict>
										<dict>
											<key>pfm_app_min</key>
											<string>2.0</string>
											<key>pfm_description</key>
											<string>A single URL, enabling the More Info button URL path when using the unsupported UI. While this accepts a string, it must be a valid URL (http://, https://, file://). Note: If this value is passed with aboutUpdateURLs, the aboutUpdateURLs key will be ignored.</string>
											<key>pfm_name</key>
											<string>unsupportedURL</string>
											<key>pfm_type</key>
											<string>string</string>
											<key>pfm_value_placeholder</key>
											<string>https://github.com/macadmins/nudge</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>unsupportedURL - Dictionary</string>
									<key>pfm_type</key>
									<string>dictionary</string>
								</dict>
							</array>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>osVersionRequirement</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>OS Version Requirements</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>All features related to how Nudge refreshes and defines the user experience</string>
			<key>pfm_name</key>
			<string>userExperience</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>This will disable all functionality related to the `userExperience` preference domain.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#notimers---type-boolean-default-value-false</string>
					<key>pfm_name</key>
					<string>noTimers</string>
					<key>pfm_title</key>
					<string>No Timers</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfm_value_placeholder</key>
					<string>false</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<integer>1000000</integer>
					<key>pfm_description</key>
					<string>The number of times a user can defer Nudge (change it from the currently active window) before the "aggressive user experience" is enabled.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#alloweddeferrals---type-integer-default-value-1000000</string>
					<key>pfm_name</key>
					<string>allowedDeferrals</string>
					<key>pfm_title</key>
					<string>Allowed Deferrals</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>1000000</string>
					<key>pfm_value_unit</key>
					<string>deferrals</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.6</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Allows a device to modify the requiredInstallationDate logic and launch behavior. Useful for new device provisioning.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#allowGracePeriods---type-boolean-default-value-false</string>
					<key>pfm_name</key>
					<string>allowGracePeriods</string>
					<key>pfm_title</key>
					<string>Allow Grace Periods</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Allows the user to specify when they will next be prompted by Nudge. (Set to `False` to maintain v1.0.0 behavior.) When using this feature, Nudge will no longer adhere to your LaunchAgent logic as the user is specifying their own execution time for the next Nudge event.(See: `~/Library/Preferences/com.github.macadmins.Nudge.plist`.)</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#allowUserQuitDeferrals---type-boolean-default-value-true</string>
					<key>pfm_name</key>
					<string>allowUserQuitDeferrals</string>
					<key>pfm_title</key>
					<string>Allow User Quit Deferrals</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.6</string>
					<key>pfm_default</key>
					<integer>23</integer>
					<key>pfm_description</key>
					<string>The amount of time in hours Nudge will extend the requiredInstallationDate for newly provisioned devices.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#gracePeriodInstallDelay---type-integer-default-value-23</string>
					<key>pfm_name</key>
					<string>gracePeriodInstallDelay</string>
					<key>pfm_title</key>
					<string>Grace Period Install Delay</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>24</string>
					<key>pfm_value_unit</key>
					<string>hours</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.6</string>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string>The amount of time in hours Nudge will bypass launching for newly provided devices.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#gracePeriodLaunchDelay---type-integer-default-value-1</string>
					<key>pfm_name</key>
					<string>gracePeriodLaunchDelay</string>
					<key>pfm_title</key>
					<string>Grace Period Launch Delay</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>1</string>
					<key>pfm_value_unit</key>
					<string>hours</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.6</string>
					<key>pfm_default</key>
					<string>/private/var/db/.AppleSetupDone</string>
					<key>pfm_description</key>
					<string>The path of the file Nudge will read and assess for allowGracePeriods.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#graceperiodpath---type-string-default-value-privatevardbapplesetupdone</string>
					<key>pfm_name</key>
					<string>gracePeriodPath</string>
					<key>pfm_title</key>
					<string>Grace Period Path</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>/private/var/db/.AppleSetupDone</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<integer>600</integer>
					<key>pfm_description</key>
					<string>The amount of time in seconds Nudge will use as a timer to refresh the user interface if it is not the currently active window. This key is directly tied to its partner key `imminentWindowTime` to know when to trigger this timer.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#imminentrefreshcycle---type-integer-default-value-600</string>
					<key>pfm_name</key>
					<string>imminentRefreshCycle</string>
					<key>pfm_title</key>
					<string>Imminent Refresh Cycle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>600</string>
					<key>pfm_value_unit</key>
					<string>seconds</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<integer>14</integer>
					<key>pfm_description</key>
					<string>The number of times a user can defer Nudge (change it from the currently active window) before both quit buttons need to be actioned.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#alloweddeferralsuntilforcedsecondaryquitbutton---type-integer-default-value-14</string>
					<key>pfm_name</key>
					<string>allowedDeferralsUntilForcedSecondaryQuitButton</string>
					<key>pfm_title</key>
					<string>Allowed Deferrals until Forced Secondary Quit Button</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>14</string>
					<key>pfm_value_unit</key>
					<string>deferrals</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<integer>6000</integer>
					<key>pfm_description</key>
					<string>The amount of time in seconds Nudge will use as a timer to refresh the user interface if it is not the currently active window. This key is directly tied to its partner key `approachingWindowTime` to know when to trigger this timer.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#approachingrefreshcycle---type-integer-default-value-6000</string>
					<key>pfm_name</key>
					<string>approachingRefreshCycle</string>
					<key>pfm_note</key>
					<string>This key is directly tied to its partner key approachingWindowTime to know when to trigger this timer.</string>
					<key>pfm_title</key>
					<string>Approaching Refresh Cycle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>6000</string>
					<key>pfm_value_unit</key>
					<string>seconds</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<integer>72</integer>
					<key>pfm_description</key>
					<string>The amount of time in hours Nudge will use to determine that the `requiredInstallationDate` is "approaching".</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#approachingwindowtime---type-integer-default-value-72</string>
					<key>pfm_name</key>
					<string>approachingWindowTime</string>
					<key>pfm_title</key>
					<string>Approaching Window Time</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>72</string>
					<key>pfm_value_unit</key>
					<string>hours</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<integer>300</integer>
					<key>pfm_description</key>
					<string>The amount of time in seconds Nudge will use as a timer to refresh the user interface if it is not the currently active window. This key is triggered once the `requiredInstallationDate` has expired.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#elapsedrefreshcycle---type-integer-default-value-6000</string>
					<key>pfm_name</key>
					<string>elapsedRefreshCycle</string>
					<key>pfm_title</key>
					<string>Elapsed Refresh Cycle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>300</string>
					<key>pfm_value_unit</key>
					<string>seconds</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<integer>600</integer>
					<key>pfm_description_reference</key>
					<string>The amount of time in seconds Nudge will use as a timer to refresh the user interface if it is not the currently active window.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#imminentrefeshcycle---type-integer-default-value-600</string>
					<key>pfm_name</key>
					<string>imminentRefeshCycle</string>
					<key>pfm_title</key>
					<string>Imminent Refresh Cycle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>seconds</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<integer>24</integer>
					<key>pfm_description</key>
					<string>The amount of time in hours Nudge will use to determine that the `requiredInstallationDate` is "imminent".</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#imminentwindowtime---type-integer-default-value-24</string>
					<key>pfm_name</key>
					<string>imminentWindowTime</string>
					<key>pfm_title</key>
					<string>Imminent Window Time</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>24</string>
					<key>pfm_value_unit</key>
					<string>hours</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<integer>18000</integer>
					<key>pfm_description</key>
					<string>The amount of time in seconds Nudge will use as a timer to refresh the user interface if it is not the currently active window. This key is triggered for all Nudge launches until the `approachingWindowTime` has been passed.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#initialrefreshcycle---type-integer-default-value-18000</string>
					<key>pfm_name</key>
					<string>initialRefreshCycle</string>
					<key>pfm_title</key>
					<string>Initial Refresh Cycle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>18000</string>
					<key>pfm_value_unit</key>
					<string>seconds</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<integer>1200</integer>
					<key>pfm_description</key>
					<string>The maximum amount of delay Nudge will utilize before launching the UI. This is useful if you do not want your users to all receive the Nudge prompt at the exact time of the LaunchAgent. Note: This functionality only applies when also enabling `randomDelay`.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#maxrandomdelayinseconds---type-integer-default-value-1200</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<false/>
									</array>
									<key>pfm_target</key>
									<string>userExperience.randomDelay</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>maxRandomDelayInSeconds</string>
					<key>pfm_note</key>
					<string>This functionality only applies when also enabling randomDelay.</string>
					<key>pfm_title</key>
					<string>Max Random Delay</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>1200</string>
					<key>pfm_value_unit</key>
					<string>seconds</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<integer>60</integer>
					<key>pfm_description</key>
					<string>The amount of time in seconds Nudge will use as its core timer to refresh all the core code paths. Note: While you can lower this setting, it could make Nudge too aggressive. Be mindful of decreasing this value.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#nudgerefreshcycle---type-integer-default-value-60</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<false/>
									</array>
									<key>pfm_target</key>
									<string>userExperience.randomDelay</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>nudgeRefreshCycle</string>
					<key>pfm_note</key>
					<string>While you can lower this setting, it could make Nudge too aggressive. Be mindful of decreasing this value</string>
					<key>pfm_title</key>
					<string>Nudge Refresh Cycle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>60</string>
					<key>pfm_value_unit</key>
					<string>seconds</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Enables an initial delay Nudge before launching the UI. This is useful if you do not want your users to all receive the Nudge prompt at the exact time of the LaunchAgent.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userExperience#nudgerefreshcycle---type-integer-default-value-60</string>
					<key>pfm_name</key>
					<string>randomDelay</string>
					<key>pfm_title</key>
					<string>Random Delay</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfm_value_placeholder</key>
					<string>true</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Allows the user to press the `Later` button through the custom deferrals UI</string>
					<key>pfm_name</key>
					<string>allowLaterDeferralButton</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Allows the user to move the Nudge window.</string>
					<key>pfm_name</key>
					<string>allowMovableWindow</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>imminentWindowTime</string>
					<key>pfm_description</key>
					<string>Utilize the approachingWindowTime or imminentWindowTime for calendar deferrals.</string>
					<key>pfm_name</key>
					<string>calendarDeferralUnit</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>imminentWindowTime</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The identifier of the Nudge LaunchAgent. Only set this if you use a custom identifier</string>
					<key>pfm_name</key>
					<string>launchAgentIdentifier</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>com.github.macadmins.Nudge</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Loads the Nudge LaunchAgent using macOS Ventura's SMAppService API (macOS 13+ required).</string>
					<key>pfm_name</key>
					<string>loadLaunchAgent</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>When a new major upgrade is posted to the SOFA feed, this can artificially delay the SOFA nudge events by x amount of days.</string>
					<key>pfm_name</key>
					<string>nudgeMajorUpgradeEventLaunchDelay</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>0</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>When a new minor update is posted to the SOFA feed, this can artificially delay the SOFA nudge events by x amount of days.</string>
					<key>pfm_name</key>
					<string>nudgeMinorUpdateEventLaunchDelay</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>0</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>User Experience</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>All features related to how Nudge defines the user interface.</string>
			<key>pfm_name</key>
			<string>userInterface</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Enables Nudge to launch in the simplified user experience.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userInterface#simplemode---type-boolean-default-value-false</string>
					<key>pfm_name</key>
					<string>simpleMode</string>
					<key>pfm_title</key>
					<string>Simple Mode</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Force the built-in ScreenShot icon to render in the UI if a ScreenShot path is not passed.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userInterface#forcescreenshoticon---type-boolean-default-value-false</string>
					<key>pfm_name</key>
					<string>forceScreenShotIcon</string>
					<key>pfm_title</key>
					<string>Force Screenshot Icon</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.0</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Enables or disables the deferral count of the current Nudge event.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userInterface#showdeferralcount---type-boolean-default-value-true</string>
					<key>pfm_name</key>
					<string>showDeferralCount</string>
					<key>pfm_note</key>
					<string>While you can disable the deferral count, the deferral count behavior logic will still apply. This may confuse your users. Be mindful of disabling this setting.</string>
					<key>pfm_title</key>
					<string>Show Deferral Count</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Only display one quit button regardless of proximity to the due date.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userInterface#singlequitbutton---type-boolean-default-value-false</string>
					<key>pfm_name</key>
					<string>singleQuitButton</string>
					<key>pfm_title</key>
					<string>single Quit Button</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_description</key>
					<string>A path to a local jpg, png, icns that contains the icon for dark mode. This will replace the Apple logo on the left side of Nudge.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userInterface#icondarkpath---type-string-default-value-</string>
					<key>pfm_format</key>
					<string>^.*\.(icns|jpg|png)</string>
					<key>pfm_name</key>
					<string>iconDarkPath</string>
					<key>pfm_title</key>
					<string>Dark Icon Path</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>/Library/Application Support/Nudge/logoDark.png</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_description</key>
					<string>A path to a local jpg, png, icns that contains the icon for light mode. This will replace the Apple logo on the left side of Nudge.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userInterface#iconlightpath---type-string-default-value-</string>
					<key>pfm_format</key>
					<string>^.*\.(icns|jpg|png)</string>
					<key>pfm_name</key>
					<string>iconLightPath</string>
					<key>pfm_title</key>
					<string>Light Icon Path</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>/Library/Application Support/Nudge/logoLight.png</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_description</key>
					<string>A path to a local jpg, png, icns that contains the screen shot for dark mode. This will replace the Big Sur logo on the lower right side of Nudge.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userInterface#screenshotdarkpath---type-string-default-value-</string>
					<key>pfm_format</key>
					<string>^.*\.(icns|jpg|png)</string>
					<key>pfm_name</key>
					<string>screenShotDarkPath</string>
					<key>pfm_title</key>
					<string>Dark Screenshot Path</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>/Library/Application Support/Nudge/screenShotDark.png</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_description</key>
					<string>A path to a local jpg, png, icns that contains the screen shot for light mode. This will replace the Big Sur logo on the lower right side of Nudge.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userInterface#screenshotlightpath---type-string-default-value-</string>
					<key>pfm_format</key>
					<string>^.*\.(icns|jpg|png)</string>
					<key>pfm_name</key>
					<string>screenShotLightPath</string>
					<key>pfm_title</key>
					<string>Light Screenshot Path</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>/Library/Application Support/Nudge/screenShotLight.png</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1.0</string>
					<key>pfm_description</key>
					<string>A path to a URI for opening alternative actions, like Jamf self service items.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userInterface#actionbuttonpath---type-string-default-value-nil</string>
					<key>pfm_name</key>
					<string>actionButtonPath</string>
					<key>pfm_note</key>
					<string>actionButtonPath contains empty string - actionButton will be unable to trigger any action required for major upgrades.</string>
					<key>pfm_title</key>
					<string>Action Button Path</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>jamfselfservice://content?entity=&lt;content_type&gt;&amp;id=&lt;content_id&gt;&amp;action=execute</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<string>en</string>
					<key>pfm_description</key>
					<string>The language to revert to if no localizations are available for the device's current language.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userInterface#fallbacklanguage---type-string-default-value-en</string>
					<key>pfm_name</key>
					<string>fallbackLanguage</string>
					<key>pfm_title</key>
					<string>Fallback Language</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>EX: en</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Force the custom localizations to the value of `fallbackLanguage`.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/userInterface#forcefallbacklanguage---type-boolean-default-value-false</string>
					<key>pfm_name</key>
					<string>forceFallbackLanguage</string>
					<key>pfm_title</key>
					<string>Force Fallback Language</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_description</key>
					<string>The individual buttons and text elements that can be customized for your employer's needs. This includes per country localization.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/nudge/wiki/updateElements</string>
					<key>pfm_name</key>
					<string>updateElements</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_app_min</key>
									<string>1.0</string>
									<key>pfm_description</key>
									<string>The targeted language locale for the user interface. Note: For a list of locales, please run the following command in Terminal: /usr/bin/locale -a</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#_language---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>_language</string>
									<key>pfm_note</key>
									<string>For a list of locales, please run the following command in Terminal: /usr/bin/locale -a</string>
									<key>pfm_title</key>
									<string>Language</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>EX: en</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.1.0</string>
									<key>pfm_description</key>
									<string>Modifies the customDeferralButtonText, also known as the "Custom" button.</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#customdeferralbuttontext---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>customDeferralButtonText</string>
									<key>pfm_title</key>
									<string>Custom Deferral Button Text</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>Custom</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.1.7</string>
									<key>pfm_description</key>
									<string>customDeferralDropdownText, also known as the "Defer" button.</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#customdeferraldropdowntext---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>customDeferralDropdownText</string>
									<key>pfm_title</key>
									<string>Custom Deferral Dropdown Text</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>Defer</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.1.0</string>
									<key>pfm_description</key>
									<string>Modifies the oneDayDeferralButtonText, also known as the "One Day" button.</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#customdeferraldropdowntext---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>oneDayDeferralButtonText</string>
									<key>pfm_title</key>
									<string>One Day Deferral Button Text</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>One Day</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.1.0</string>
									<key>pfm_description</key>
									<string>Modifies the oneHourDeferralButtonText, also known as the "One Hour" button.</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#onehourdeferralbuttontext---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>oneHourDeferralButtonText</string>
									<key>pfm_title</key>
									<string>One Hour Deferral Button Text</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>One Hour</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.0</string>
									<key>pfm_description</key>
									<string>Modifies the informationButton, also known as the "More Info" button.</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#informationbuttontext---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>informationButtonText</string>
									<key>pfm_title</key>
									<string>Information Button Text</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>More Info</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.0</string>
									<key>pfm_description</key>
									<string>Modifies the mainContentHeader. This is the "Your device will restart during this update" text.</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#maincontentheader---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>mainContentHeader</string>
									<key>pfm_title</key>
									<string>Main Content Header</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>**Your device will restart during this update**</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.0</string>
									<key>pfm_description</key>
									<string>Modifies the mainContentSubHeader. This is the "Updates can take around 30 minutes to complete" text.</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#maincontentsubheader---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>mainContentSubHeader</string>
									<key>pfm_title</key>
									<string>Main Content Sub Header</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>Updates can take around 30 minutes to complete</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.0</string>
									<key>pfm_description</key>
									<string>Modifies the `mainContentText`. This is the "A fully up-to-date device is required to ensure that IT can your accurately protect your device." text. (See the Wiki for information on adding line breaks.)</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#maincontenttext---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>mainContentText</string>
									<key>pfm_note</key>
									<string>The python version of Nudge required three paragraphs. With the Swift version, this is no longer necessary. Simply pass two newlines (\n\n) to start a new paragraph. You can have as many or as few as you want, with the only limitation being window space.</string>
									<key>pfm_title</key>
									<string>Main Content Text</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>A fully up-to-date device …</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.0</string>
									<key>pfm_description</key>
									<string>Modifies the mainContentNote. This is the "Important Notes" text.</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#maincontentnote---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>mainContentNote</string>
									<key>pfm_title</key>
									<string>Main Content Note</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>**Important Notes**</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.0</string>
									<key>pfm_description</key>
									<string>Modifies the `mainHeader`. This is the "Your device requires a security update" text.</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#mainheader---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>mainHeader</string>
									<key>pfm_title</key>
									<string>Main Header</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>Your device requires a security update</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.0</string>
									<key>pfm_description</key>
									<string>Modifies the actionButton, also known as the "Update Device" button.</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#actionbuttontext---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>actionButtonText</string>
									<key>pfm_title</key>
									<string>Action Button Text</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>Update Device</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.0</string>
									<key>pfm_description</key>
									<string>Modifies the `primaryQuitButton`, also known as the "Later" button.</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#primaryquitbuttontext---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>primaryQuitButtonText</string>
									<key>pfm_title</key>
									<string>Primary Quit Button Text</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>Later</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.0</string>
									<key>pfm_description</key>
									<string>Modifies the `secondaryQuitButton`, also known as the "I understand" button.</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#secondaryquitbuttontext---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>secondaryQuitButtonText</string>
									<key>pfm_title</key>
									<string>Secondary Quit Button Text</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>I understand</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>1.0</string>
									<key>pfm_description</key>
									<string>Modifies the `subHeader`. This is the "A friendly reminder from your local IT team" text.</string>
									<key>pfm_documentation_url</key>
									<string>https://github.com/macadmins/nudge/wiki/updateElements#subheader---type-string-default-value-</string>
									<key>pfm_name</key>
									<string>subHeader</string>
									<key>pfm_title</key>
									<string>Sub Header</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>**A friendly reminder from your local IT team**</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>2.0</string>
									<key>pfm_description</key>
									<string>Modifies the primaryQuitButton, also known as the "Update Device" button when using the Unsupported UI.</string>
									<key>pfm_name</key>
									<string>actionButtonTextUnsupported</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>Replace Your Device</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>2.0</string>
									<key>pfm_description</key>
									<string>Modifies the terminated application notification title.</string>
									<key>pfm_name</key>
									<string>applicationTerminatedTitleText</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>Application terminated</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>2.0</string>
									<key>pfm_description</key>
									<string>Modifies the terminated application notification body.</string>
									<key>pfm_name</key>
									<string>applicationTerminatedBodyText</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>Please update your device to use this application</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>2.0</string>
									<key>pfm_description</key>
									<string>Modifies the mainContentHeader. This is the "Your device is no longer capable of receiving critical security updates" text when using the Unsupported UI.</string>
									<key>pfm_name</key>
									<string>mainContentHeaderUnsupported</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>**Your device is no longer capable of receiving critical security updates**</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>2.0</string>
									<key>pfm_description</key>
									<string>Modifies the mainContentNote. This is the "Important Notes" text when using the Unsupported UI.</string>
									<key>pfm_name</key>
									<string>mainContentNoteUnsupported</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>**Important Notes**</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>2.0</string>
									<key>pfm_description</key>
									<string>Modifies the mainContentSubHeader. This is the "Please work with your local IT team to obtain a replacement device" text when using the Unsupported UI.</string>
									<key>pfm_name</key>
									<string>mainContentSubHeaderUnsupported</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>Please work with your local IT team to obtain a replacement device</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>2.0</string>
									<key>pfm_description</key>
									<string>Modifies the `mainContentText`. This is the "A fully up-to-date device is required to ensure that IT can your accurately protect your device." text when using the Unsupported UI. See the Wiki for information on adding line breaks.</string>
									<key>pfm_name</key>
									<string>mainContentTextUnsupported</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>A fully up-to-date device …</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>2.0</string>
									<key>pfm_description</key>
									<string>Modifies the `mainHeader`. This is the "Your device requires a security update" text when using the Unsupported UI.</string>
									<key>pfm_name</key>
									<string>mainHeaderUnsupported</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>Your device requires a security update</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Modifies the accessible hover over on screen shots.</string>
									<key>pfm_name</key>
									<string>screenShotAltText</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>Click to zoom into screenshot</string>
								</dict>
								<dict>
									<key>pfm_app_min</key>
									<string>2.0</string>
									<key>pfm_description</key>
									<string>Modifies the `subHeader`. This is the "A friendly reminder from your local IT team" text when using the Unsupported UI.</string>
									<key>pfm_name</key>
									<string>subHeaderUnsupported</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>**A friendly reminder from your local IT team**</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>updateElement - Dictionary</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Update Elements</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_description</key>
					<string>A local image path for the notification event when Nudge terminates and application.</string>
					<key>pfm_name</key>
					<string>applicationTerminatedNotificationImagePath</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>/Library/Application Support/Nudge/LogoLight.png</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_description</key>
					<string>When utilizing showRequiredDate, set a custom display format. Be aware that the format you desire may not look good on the UI.</string>
					<key>pfm_name</key>
					<string>requiredInstallationDisplayFormat</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>MM/dd/yyyy</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>When disabled, Nudge will not show the Actively Exploited CVEs in the left sidebar.</string>
					<key>pfm_name</key>
					<string>showActivelyExploitedCVEs</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>When disabled, Nudge will not show the `Days Remaining To Update:` item on the left side of the UI.</string>
					<key>pfm_name</key>
					<string>showDaysRemainingToUpdate</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>2.0</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>When enabled, Nudge will also show the requiredInstallationDate as string formatted date.</string>
					<key>pfm_name</key>
					<string>showRequiredDate</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>User Interface</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>When configuring Nudge using a JSON-formatted preferences file located outside of the default location, set this key to the custom location using either a remote (https://) or a local (file://) URL, and leave other keys in this payload unset. Leave this key unset when configuring Nudge using the other keys in this payload.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/macadmins/nudge/wiki#setting-the-json-url-in-mobileconfig-profile</string>
			<key>pfm_format</key>
			<string>^(https?|file)://.+$</string>
			<key>pfm_name</key>
			<string>json-url</string>
			<key>pfm_title</key>
			<string>JSON Preference File Location</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://example.org/nudge.json</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Nudge</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>4</integer>
</dict>
</plist>
