<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://slack.com/downloads/mac</string>
	<key>pfm_description</key>
	<string>Slack Client Management</string>
	<key>pfm_documentation_url</key>
	<string>https://slack.com/help/articles/11906214948755-Manage-desktop-app-configurations</string>
	<key>pfm_domain</key>
	<string>com.tinyspeck.slackmacgap</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-11-30T15:08:23Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Slack settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Slack</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.tinyspeck.slackmacgap</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.tinyspeck.slackmacgap</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Policy</string>
				<string>Defaults</string>
				<string>Legacy</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Defaults</key>
				<array>
					<string>Defaults</string>
				</array>
				<key>Legacy</key>
				<array>
					<string>SlackNoAutoUpdates</string>
					<string>SlackDefaultSignInWorkspace</string>
				</array>
				<key>Policy</key>
				<array>
					<string>ClientEnvironment</string>
					<string>HardwareAcceleration</string>
					<string>DownloadPath</string>
					<string>DefaultSignInTeam</string>
					<string>ReleaseChannel</string>
					<string>AutoUpdate</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.31</string>
			<key>pfm_description</key>
			<string>Configures the client to run in either commercial mode or government compliance mode (GovSlack).</string>
			<key>pfm_documentation_url</key>
			<string>https://slack.com/solutions/govslack</string>
			<key>pfm_name</key>
			<string>ClientEnvironment</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1000</integer>
				<integer>1001</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Commercial</string>
				<string>GovSlack</string>
			</array>
			<key>pfm_title</key>
			<string>Client Environment</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.31</string>
			<key>pfm_description</key>
			<string>Enable or disable hardware accelerated rendering via GPU.</string>
			<key>pfm_name</key>
			<string>HardwareAcceleration</string>
			<key>pfm_title</key>
			<string>Hardware Acceleration</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.31y</string>
			<key>pfm_description</key>
			<string>Defines the download location for documents from Slack. This must be a valid user accessible path.</string>
			<key>pfm_format</key>
			<string>^/|//|(/[\w-]+)+$</string>
			<key>pfm_name</key>
			<string>DownloadPath</string>
			<key>pfm_title</key>
			<string>Download Path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.31</string>
			<key>pfm_description</key>
			<string>Sets the default team/workspace for Slack sign-ins.</string>
			<key>pfm_documentation_url</key>
			<string>https://slack.com/help/articles/360041725993-Share-a-default-sign-in-file-with-members</string>
			<key>pfm_format</key>
			<string>^(E|T)[A-Z0-9]{8,50}$</string>
			<key>pfm_name</key>
			<string>DefaultSignInTeam</string>
			<key>pfm_title</key>
			<string>Default Team / Workspace</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.31</string>
			<key>pfm_description</key>
			<string>Configure the client to receive updates from either the production or beta channel.</string>
			<key>pfm_name</key>
			<string>ReleaseChannel</string>
			<key>pfm_range_list</key>
			<array>
				<string>prod</string>
				<string>beta</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Production</string>
				<string>Beta</string>
			</array>
			<key>pfm_title</key>
			<string>Release Channel</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.31</string>
			<key>pfm_description</key>
			<string>Enable or disable auto updates.</string>
			<key>pfm_name</key>
			<string>AutoUpdate</string>
			<key>pfm_title</key>
			<string>Auto Update</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>List of default values.</string>
			<key>pfm_name</key>
			<string>Defaults</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>4.31</string>
					<key>pfm_description</key>
					<string>Configures the client to run in either commercial mode or government compliance mode (GovSlack) by default. The user can still change this setting.</string>
					<key>pfm_documentation_url</key>
					<string>https://slack.com/solutions/govslack</string>
					<key>pfm_name</key>
					<string>ClientEnvironment</string>
					<key>pfm_range_list</key>
					<array>
						<integer>1000</integer>
						<integer>1001</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Commercial</string>
						<string>GovSlack</string>
					</array>
					<key>pfm_title</key>
					<string>Client Environment (Default)</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>4.31</string>
					<key>pfm_description</key>
					<string>Enables or disable hardware accelerated rendering via GPU. The user can still change this setting.</string>
					<key>pfm_name</key>
					<string>HardwareAcceleration</string>
					<key>pfm_title</key>
					<string>Hardware Acceleration (Default)</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>4.31</string>
					<key>pfm_description</key>
					<string>Defines the download location for documents from Slack. This must be a valid user accesible path. The user can still change this setting.</string>
					<key>pfm_format</key>
					<string>^/|//|(/[\w-]+)+$</string>
					<key>pfm_name</key>
					<string>DownloadPath</string>
					<key>pfm_title</key>
					<string>Download Path (Default)</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>4.31</string>
					<key>pfm_description</key>
					<string>Configure the client to receive updates from either the production or beta channel. The user can still change this setting.</string>
					<key>pfm_name</key>
					<string>ReleaseChannel</string>
					<key>pfm_range_list</key>
					<array>
						<string>prod</string>
						<string>beta</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Production</string>
						<string>Beta</string>
					</array>
					<key>pfm_title</key>
					<string>Release Channel (Default)</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.0</string>
			<key>pfm_description</key>
			<string>When true, disables Slack's built-in automatic update mechanism. Useful if you update Slack using a tool like Munki.</string>
			<key>pfm_documentation_url</key>
			<string>https://slack.com/help/articles/360035635174-Deploy-Slack-for-macOS</string>
			<key>pfm_name</key>
			<string>SlackNoAutoUpdates</string>
			<key>pfm_title</key>
			<string>Disable Automatic Updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.23</string>
			<key>pfm_description</key>
			<string>Sets the default workspace for Slack sign-ins.</string>
			<key>pfm_documentation_url</key>
			<string>https://slack.com/help/articles/360041725993-Share-a-default-sign-in-file-with-members</string>
			<key>pfm_name</key>
			<string>SlackDefaultSignInWorkspace</string>
			<key>pfm_title</key>
			<string>Default Workspace</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Slack</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>3</integer>
</dict>
</plist>
