<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://github.com/salopensource/sal/releases</string>
	<key>pfm_description</key>
	<string>Sal settings</string>
	<key>pfm_documentation_url</key>
	<string>https://github.com/salopensource/sal/wiki/Client-configuration</string>
	<key>pfm_domain</key>
	<string>com.github.salopensource.sal</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-11-30T15:08:23Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Sal settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Sal</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.github.salopensource.sal</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.github.salopensource.sal</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>URL of your Sal server.</string>
			<key>pfm_description_reference</key>
			<string>The URL of your Sal server (required).</string>
			<key>pfm_name</key>
			<string>ServerURL</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Whether to use basic authentication on your server.</string>
			<key>pfm_description_reference</key>
			<string>Whether to use basic authentication on your server. You should have a very good reason to disable this (defaults to true)</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>BasicAuth</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>BasicAuth</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The machine group's key.</string>
			<key>pfm_description_reference</key>
			<string>The machine group's key (required if you wish to use basic authentication).</string>
			<key>pfm_name</key>
			<string>key</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Download the scripts needed to run for your plugins from the server.</string>
			<key>pfm_description_reference</key>
			<string>By default the Sal client will download the scripts it needs to run for your plugins from the server. (defaults to true)</string>
			<key>pfm_name</key>
			<string>SyncScripts</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>It is possible to not upload all the data produced by Facter. You may have facts that are duplicates of other information Sal collects, or you don't wish to upload them for security reasons.</string>
			<key>pfm_description_reference</key>
			<string>It is possible to not upload all the data produced by Facter. You may have facts that are duplicates of other information Sal collects, or you don't wish to upload them for security reasons.</string>
			<key>pfm_name</key>
			<string>SkipFacts</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Collect Salt grains and upload them to Sal.</string>
			<key>pfm_description_reference</key>
			<string>Collect Salt grains and upload them to Sal. (defaults to false)</string>
			<key>pfm_name</key>
			<string>GetGrains</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Collect Ohai attributes and upload them to Sal.</string>
			<key>pfm_description_reference</key>
			<string>Collect Ohai attributes and upload them to Sal. (defaults to false)</string>
			<key>pfm_name</key>
			<string>GetOhai</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Path to your sal certificate. Curl on 10.13 requires this for self-signed certificates or uploading the report data will fail.</string>
			<key>pfm_description_reference</key>
			<string>Path to your sal certificate. Curl on 10.13 requires this for self-signed certificates or uploading the report data will fail.</string>
			<key>pfm_name</key>
			<string>CACert</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Full path to your sal SSL client key file for mutual TLS</string>
			<key>pfm_description_reference</key>
			<string>Full path to your sal SSL client key file for mutual TLS</string>
			<key>pfm_name</key>
			<string>SSLClientKey</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Absolute path to the SSL client certificate to use with mutual TLS when connecting to the sal server in PEM format.</string>
			<key>pfm_description_reference</key>
			<string>Absolute path to the SSL client certificate to use with mutual TLS when connecting to the sal server in PEM format (Requires SSLClientKey to also be defined), in PKCS#12 format, or the name for a certificate in the system or root user keychain. (See curl(1) man page for further details on --cert for advanced format options)</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>SSLClientKey</string>
						</dict>
						<dict>
							<key>pfm_target</key>
							<string>SSLClientKey</string>
							<key>pfm_value_empty</key>
							<true/>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>SSLClientCertificate</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Sal</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>3</integer>
</dict>
</plist>
