<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://github.com/ANTS-Framework/ants</string>
	<key>pfm_description</key>
	<string>ANTS Framework settings</string>
	<key>pfm_documentation_url</key>
	<string>https://ants-framework.github.io</string>
	<key>pfm_domain</key>
	<string>com.github.ants-framework</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-11-30T15:08:23Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures the ANTS framework configuration preferences</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>ANTS Framework settings</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.github.ants-framework</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Active Directory</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Active Directory</key>
				<array>
					<string>ad</string>
				</array>
				<key>General</key>
				<array>
					<string>main</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>General</string>
			<key>pfm_hidden</key>
			<string>container</string>
			<key>pfm_name</key>
			<string>main</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<string>https://github.com/ANTS-Framework/playbook.git</string>
					<key>pfm_description</key>
					<string>URL of the repository that contains your Ansible playbooks.</string>
					<key>pfm_name</key>
					<string>git_repository</string>
					<key>pfm_require</key>
					<string>always-nested</string>
					<key>pfm_title</key>
					<string>Git Repository</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>master</string>
					<key>pfm_description</key>
					<string>Git branch to check out from your Git repository.</string>
					<key>pfm_name</key>
					<string>branch</string>
					<key>pfm_title</key>
					<string>Branch</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>/etc/ants/id_ants</string>
					<key>pfm_description</key>
					<string>Absolute path to a SSH key with permission to access your Git repository.</string>
					<key>pfm_name</key>
					<string>ssh_key</string>
					<key>pfm_title</key>
					<string>SSH Key</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>~root/.ants_playbook</string>
					<key>pfm_description</key>
					<string>Absolute path on the local machine to check out your Git repository.</string>
					<key>pfm_name</key>
					<string>destination</string>
					<key>pfm_title</key>
					<string>Destination</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>inventory_default</string>
					<key>pfm_description</key>
					<string>Relative or absolute path to an ansible inventory script.</string>
					<key>pfm_name</key>
					<string>inventory_script</string>
					<key>pfm_title</key>
					<string>Inventory Script</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>900</integer>
					<key>pfm_description</key>
					<string>The number of seconds to wait in between ansible-pull runs.</string>
					<key>pfm_name</key>
					<string>wait_interval</string>
					<key>pfm_title</key>
					<string>Wait Interval</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>Seconds</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>main.yml</string>
					<key>pfm_description</key>
					<string>File name of the primary Ansible playbook to run relative to your &lt;Destination&gt; directory.</string>
					<key>pfm_name</key>
					<string>ansible_playbook</string>
					<key>pfm_title</key>
					<string>Ansible Playbook</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>/var/log/ants</string>
					<key>pfm_description</key>
					<string>Absolute path of where to store log files from runs.</string>
					<key>pfm_name</key>
					<string>log_dir</string>
					<key>pfm_title</key>
					<string>Log Directory</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Whether or not to use strict host key checking when running Git commands.</string>
					<key>pfm_name</key>
					<string>ssh_stricthostkeychecking</string>
					<key>pfm_require</key>
					<string>always-nested</string>
					<key>pfm_title</key>
					<string>Strict Host Key Checking</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string></string>
					<key>pfm_description</key>
					<string>Absolute path to a different ansible-pull binary installed on the local machine.</string>
					<key>pfm_name</key>
					<string>ansible_pull_exe</string>
					<key>pfm_title</key>
					<string>Ansible Pull</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string></string>
					<key>pfm_description</key>
					<string>Limit the Ansible playbook run to a comma separated list of tags.</string>
					<key>pfm_name</key>
					<string>tags</string>
					<key>pfm_title</key>
					<string>Tags</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string></string>
					<key>pfm_description</key>
					<string>Run the Ansible playbook on all tags except the provided comma separated list.</string>
					<key>pfm_name</key>
					<string>skip_tags</string>
					<key>pfm_title</key>
					<string>Skip Tags</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>General</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Active Directory</string>
			<key>pfm_hidden</key>
			<string>container</string>
			<key>pfm_name</key>
			<string>ad</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<string>ldap\changeme</string>
					<key>pfm_description</key>
					<string>User name to use to connect to LDAP.</string>
					<key>pfm_name</key>
					<string>ldap_user</string>
					<key>pfm_title</key>
					<string>LDAP User</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>changeme</string>
					<key>pfm_description</key>
					<string>Password to use to connect to LDAP.</string>
					<key>pfm_name</key>
					<string>ldap_pw</string>
					<key>pfm_title</key>
					<string>LDAP Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>LDAP.PRETENDCORP.COM</string>
					<key>pfm_description</key>
					<string>LDAP server to connect to for inventory purposes.</string>
					<key>pfm_name</key>
					<string>ldap_host</string>
					<key>pfm_title</key>
					<string>LDAP Host</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>DC=ldap,DC=pretendcorp,DC=com</string>
					<key>pfm_description</key>
					<string>LDAP location of computer objects.</string>
					<key>pfm_name</key>
					<string>ldap_ou_computers</string>
					<key>pfm_title</key>
					<string>LDAP OU Computers</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>OU=ants,OU=Groups,DC=ldap,DC=pretendcorp,DC=com</string>
					<key>pfm_description</key>
					<string>LDAP location of group objects.</string>
					<key>pfm_name</key>
					<string>ldap_ou_groups</string>
					<key>pfm_title</key>
					<string>LDAP OU Groups</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>/etc/ants/inventory_cache.json</string>
					<key>pfm_description</key>
					<string>Absolute path to a cache file of Active Directory results.</string>
					<key>pfm_name</key>
					<string>cache_file</string>
					<key>pfm_title</key>
					<string>Cache File</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>ants-</string>
					<key>pfm_description</key>
					<string>Group prefix used to filter groups from Active Directory.</string>
					<key>pfm_name</key>
					<string>group_prefix</string>
					<key>pfm_title</key>
					<string>Group Prefix</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>ants-common</string>
					<key>pfm_description</key>
					<string>A common group to put all computers in.</string>
					<key>pfm_name</key>
					<string>common_group</string>
					<key>pfm_title</key>
					<string>Common Group</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>common_ad_connected</string>
					<key>pfm_description</key>
					<string>A common group that computers are put in when the inventory script actively connects to Active Directory.</string>
					<key>pfm_name</key>
					<string>common_ad_connected</string>
					<key>pfm_title</key>
					<string>Common AD Connected</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Active Directory</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>ANTS Framework</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>4</integer>
</dict>
</plist>
