<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://www.office.com</string>
	<key>pfm_description</key>
	<string>Microsoft AutoUpdate settings</string>
	<key>pfm_documentation</key>
	<string>https://docs.google.com/spreadsheets/d/1ESX5td0y0OP3jdzZ-C2SItm-TUi-iA_bcHCBvaoCumw/edit#gid=0</string>
	<key>pfm_domain</key>
	<string>com.microsoft.autoupdate2</string>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2018-07-19T09:00:00Z</date>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Microsoft AutoUpdate settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Microsoft AutoUpdate</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.autoupdate2</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.autoupdate2</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.3.0</string>
			<key>pfm_default</key>
			<string>Production</string>
			<key>pfm_description</key>
			<string>Set the update channel that is used to check for updates.</string>
			<key>pfm_name</key>
			<string>ChannelName</string>
			<key>pfm_range_list</key>
			<array>
				<string>Production</string>
				<string>External</string>
				<string>InsiderFast</string>
				<string>Custom</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Production</string>
				<string>Office Insider Slow: External</string>
				<string>Office Insider Fast: InsiderFast</string>
				<string>Custom</string>
			</array>
			<key>pfm_title</key>
			<string>Channel Update Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.6.0</string>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>Control how updates are checked for.</string>
			<key>pfm_name</key>
			<string>HowToCheck</string>
			<key>pfm_range_list</key>
			<array>
				<string>Manual</string>
				<string>AutomaticCheck</string>
				<string>AutomaticDownload</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>No auto updates or checks: Manual</string>
				<string>Automatically check for updates: AutomaticCheck</string>
				<string>Automatically check for and install updates: AutomaticDownload</string>
			</array>
			<key>pfm_title</key>
			<string>How to check for updates</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0.0</string>
			<key>pfm_default</key>
			<dict></dict>
			<key>pfm_description</key>
			<string>Register applications that Microsoft AutoUpdate should manage updates for. If this is not managed MAU might have issues finding updates for applications. Do NOT change the Application ID or LCID for any of the following values. Simply check both AppID and LCID for the applications you wish MAU to check.</string>
			<key>pfm_name</key>
			<string>Applications</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>/Applications/Microsoft Excel.app</string>
					<key>pfm_title</key>
					<key>Microsoft Excel</key>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Register /Applications/Microsoft Excel.app.</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Application ID</string>
							<key>pfm_title</key>
							<key>Excel Application ID</key>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_default</key>
							<string>XCEL15</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>LCID</string>
							<key>pfm_title</key>
							<key>Excel Language Code ID</key>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_default</key>
							<integer>1033</integer>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>/Applications/Microsoft OneNote.app</string>
					<key>pfm_title</key>
					<key>Microsoft OneNote</key>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Register /Applications/Microsoft OneNote.app.</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Application ID</string>
							<key>pfm_title</key>
							<key>OneNote Application ID</key>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_default</key>
							<string>ONMC15</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>LCID</string>
							<key>pfm_title</key>
							<key>OneNote Language Code ID</key>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_default</key>
							<integer>1033</integer>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>/Applications/Microsoft Outlook.app</string>
					<key>pfm_title</key>
					<key>Microsoft Outlook</key>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Register /Applications/Microsoft Outlook.app.</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Application ID</string>
							<key>pfm_title</key>
							<key>Outlook Application ID</key>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_default</key>
							<string>OPIM15</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>LCID</string>
							<key>pfm_title</key>
							<key>Outlook Language Code ID</key>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_default</key>
							<integer>1033</integer>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>/Applications/Microsoft PowerPoint.app</string>
					<key>pfm_title</key>
					<key>Microsoft PowerPoint</key>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Register /Applications/Microsoft PowerPoint.app.</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Application ID</string>
							<key>pfm_title</key>
							<key>PowerPoint Application ID</key>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_default</key>
							<string>PPT315</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>LCID</string>
							<key>pfm_title</key>
							<key>PowerPoint Language Code ID</key>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_default</key>
							<integer>1033</integer>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>/Applications/Microsoft Word.app</string>
					<key>pfm_title</key>
					<key>Microsoft Word</key>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Register /Applications/Microsoft Word.app.</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Application ID</string>
							<key>pfm_title</key>
							<key>Word Application ID</key>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_default</key>
							<string>MSWD15</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>LCID</string>
							<key>pfm_title</key>
							<key>Word Language Code ID</key>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_default</key>
							<integer>1033</integer>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>/Applications/Skype for Business.app</string>
					<key>pfm_title</key>
					<key>Microsoft Skype for Business</key>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Register /Applications/Skype for Business.app.</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Application ID</string>
							<key>pfm_title</key>
							<key>Skype for Business Application ID</key>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_default</key>
							<string>MSFB16</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>LCID</string>
							<key>pfm_title</key>
							<key>Skype for Business Language Code ID</key>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_default</key>
							<integer>1033</integer>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>/Library/Application Support/Microsoft/MAU2.0/Microsoft AutoUpdate.app</string>
					<key>pfm_title</key>
					<key>Microsoft AutoUpdate</key>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Register /Library/Application Support/Microsoft/MAU2.0/Microsoft AutoUpdate.app.</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Application ID</string>
							<key>pfm_title</key>
							<key>AutoUpdate Application ID</key>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_default</key>
							<string>MSau03</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>LCID</string>
							<key>pfm_title</key>
							<key>AutoUpdate Language Code ID</key>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_default</key>
							<integer>1033</integer>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>/Library/Application Support/Microsoft/MERP2.0/Microsoft Error Reporting.app</string>
					<key>pfm_title</key>
					<key>Microsoft Error Reporting</key>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Register /Library/Application Support/Microsoft/MERP2.0/Microsoft Error Reporting.app.</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Application ID</string>
							<key>pfm_title</key>
							<key>Error Reporting Application ID</key>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_default</key>
							<string>Merp2</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>LCID</string>
							<key>pfm_title</key>
							<key>Error Reporting Language Code ID</key>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_default</key>
							<integer>1033</integer>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Applications</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.3.0</string>
			<key>pfm_description</key>
			<string>Force Microsoft AutoUpdate to pull collateral using a custom server. This is good when enterprise wants to have strict control on which version of Office applications get installed. This requires "ChannelName" to be set to "Custom". Ensure that a trailing slash is used when specifying the value as this is mandatory.</string>
			<key>pfm_name</key>
			<string>ManifestServer</string>
			<key>pfm_title</key>
			<string>Manifest Server</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://updates.example.com/folder/</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.3.0</string>
			<key>pfm_description</key>
			<string>Force Microsoft AutoUpdate to pull update binaries from a custom server. This is good when internet bandwidth is limited. This requires "ChannelName" to be set to "Custom". Ensure that a trailing slash is used when specifying the value as this is mandatory.</string>
			<key>pfm_name</key>
			<string>UpdateCache</string>
			<key>pfm_title</key>
			<string>Update Cache Server</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://updates.example.com/folder/</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Change how often the Microsoft AutoUpdate daemon will look for updates. The default is 720 minutes (12 hrs). By reducing this value MAU will look for updates sooner.</string>
			<key>pfm_name</key>
			<string>UpdateCheckFrequency</string>
			<key>pfm_title</key>
			<string>Update check frequency</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<integer>720</integer>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.8.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Enabled extended logging for Microsoft AutoUpdate operations. Writes logs to /Library/Logs/Microsoft/autoupdate.log.</string>
			<key>pfm_name</key>
			<string>ExtendedLogging</string>
			<key>pfm_title</key>
			<string>Enable extended logging</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Disable to send minimal heartbeat data, no application usage, and no environment details.</string>
			<key>pfm_name</key>
			<string>SendAllTelemetryEnabled</string>
			<key>pfm_title</key>
			<string>Send all telemetry</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Enable this option to set the "Join the Office Insider Program..." checkbox to unavailable.</string>
			<key>pfm_name</key>
			<string>DisableInsiderCheckbox</string>
			<key>pfm_title</key>
			<string>Disable Insider Checkbox</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.18.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable this option to make the "Check for Updates" button in Microsoft AutoUpdate unavailable.</string>
			<key>pfm_name</key>
			<string>EnableCheckForUpdatesButton</string>
			<key>pfm_title</key>
			<string>Enable Check for Updates Button</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Enable this option to trigger the MAU Daemon when other Office applications are launched.</string>
			<key>pfm_name</key>
			<string>StartDaemonOnAppLaunch</string>
			<key>pfm_title</key>
			<string>Start Daemon on App Launch</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_title</key>
	<string>Microsoft AutoUpdate</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
