<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_min</key>
	<string>8.0</string>
	<key>pfm_app_url</key>
	<string>https://1password.com</string>
	<key>pfm_description</key>
	<string>1Password 8 settings</string>
	<key>pfm_documentation_url</key>
	<string>https://support.1password.com/mobile-device-management/</string>
	<key>pfm_domain</key>
	<string>com.1password.1password</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-08-21T10:35:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configure 1Password settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>1Password</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.1password.1password</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.1password.1password</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Privacy</string>
				<string>Security</string>
				<string>Updates</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Privacy</key>
				<array>
					<string>privacy.downloadRichIcons</string>
					<string>privacy.checkHibp</string>
				</array>
				<key>Security</key>
				<array>
					<string>security.authenticatedUnlock.appleTouchId</string>
					<string>security.authenticatedUnlock.appleWatchUnlock</string>
					<string>security.revealPasswords</string>
					<string>security.autolock.onDeviceLock</string>
					<string>security.autolock.onWindowClose</string>
					<string>security.autolock.minutes</string>
					<string>security.clipboard.clearAfter</string>
					<string>security.deviceClipboardSharing</string>
				</array>
				<key>Updates</key>
				<array>
					<string>updates.autoUpdate</string>
					<string>updates.updateChannel</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>8.0</string>
			<key>pfm_description</key>
			<string>If present enforces whether biometric unlock is allowed (Preferences &gt; Security &gt; Unlock).</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.authenticatedUnlock.appleTouchId</string>
			<key>pfm_title</key>
			<string>Allow Biometric Unlock (Face ID &amp; Touch ID)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>8.0</string>
			<key>pfm_description</key>
			<string>If present enforces whether Apple Watch unlock is allowed (Preferences &gt; Security &gt; Unlock).</string>
			<key>pfm_name</key>
			<string>security.authenticatedUnlock.appleWatchUnlock</string>
			<key>pfm_title</key>
			<string>Allow Apple Watch Unlock</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>8.0</string>
			<key>pfm_description</key>
			<string>Enforces showing passwords and full credit card numbers (Preferences &gt; Security &gt; Conceal Fields).</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.revealPasswords</string>
			<key>pfm_title</key>
			<string>Allow revealing passwords</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>8.0</string>
			<key>pfm_description</key>
			<string>Enforces the configured locked on sleep,screensaver, or switching users (Preferences &gt; Security &gt; Auto-lock).</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.autolock.onDeviceLock</string>
			<key>pfm_title</key>
			<string>Lock on sleep, screensaver, or switching users</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>8.0</string>
			<key>pfm_description</key>
			<string>Enforces the configured lock on app exit preference</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.autolock.onWindowClose</string>
			<key>pfm_title</key>
			<string>Lock when main window is closed</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>8.0</string>
			<key>pfm_description</key>
			<string>Enforces the lock on idle time preference (Preferences &gt; Security &gt; Lock).</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.autolock.minutes</string>
			<key>pfm_range_max</key>
			<integer>1440</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Set auto-lock timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>minutes</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>8.0</string>
			<key>pfm_description</key>
			<string>The amount of time after copying a 1Password item that it is cleared from the clipboard (Preferences &gt; Security &gt; Clipboard).</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.clipboard.clearAfter</string>
			<key>pfm_title</key>
			<string>Clear clipboard after timeout</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>8.0</string>
			<key>pfm_description</key>
			<string>Enforces whether the clear clipboard preference is enabled or disabled (Preferences &gt; Security &gt; Clear clipboard contents).</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.deviceClipboardSharing</string>
			<key>pfm_title</key>
			<string>Allow Universal Clipboard</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>8.0</string>
			<key>pfm_description</key>
			<string>Show app and website icons</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>privacy.downloadRichIcons</string>
			<key>pfm_title</key>
			<string>Show app and website icons</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>8.0</string>
			<key>pfm_description</key>
			<string>Check for vulnerable passwords</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>privacy.checkHibp</string>
			<key>pfm_title</key>
			<string>Check for vulnerable passwords</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>8.0</string>
			<key>pfm_description</key>
			<string>Automatically check for updates</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>updates.autoUpdate</string>
			<key>pfm_title</key>
			<string>Automatically check for updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>8.0</string>
			<key>pfm_description</key>
			<string>Set release channel</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>updates.updateChannel</string>
			<key>pfm_range_list</key>
			<array>
				<string>PRODUCTION</string>
				<string>BETA</string>
				<string>NIGHTLY</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Production</string>
				<string>Beta</string>
				<string>Nightly</string>
			</array>
			<key>pfm_title</key>
			<string>Set release channel</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>1Password 8</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>
