<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://www.office.com</string>
	<key>pfm_description</key>
	<string>Microsoft Office settings</string>
	<key>pfm_documentation_url</key>
	<string>https://docs.google.com/spreadsheets/d/1ESX5td0y0OP3jdzZ-C2SItm-TUi-iA_bcHCBvaoCumw/htmlview#</string>
	<key>pfm_domain</key>
	<string>com.microsoft.office</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2019-04-10T11:52:00Z</date>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Microsoft Office settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Microsoft Office</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.office</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.office</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.33.0</string>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>Set the theme used by Microsoft Office.</string>
			<key>pfm_name</key>
			<string>kCUIThemePreferencesThemeKeyPath</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Colorful</string>
				<string>Classic</string>
				<string>Dark Mode</string>
			</array>
			<key>pfm_title</key>
			<string>Theme</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.33.0</string>
			<key>pfm_description</key>
			<string>Sets value of 'Belongs to' field in the About Box. This happens automatically on 15.33+ installs. As of version 16.13+ this value also pre-fills the account authentication field.</string>
			<key>pfm_name</key>
			<string>OfficeActivationEmailAddress</string>
			<key>pfm_title</key>
			<string>Activation Account</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>jane.doe@microsoft.com</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.13.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Only prompt user for needed information like a O365 authentication.</string>
			<key>pfm_name</key>
			<string>OfficeAutoSignIn</string>
			<key>pfm_title</key>
			<string>Hide welcome window of first launch</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.36.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disables the gallery view on application launch.</string>
			<key>pfm_name</key>
			<string>ShowDocStageOnLaunch</string>
			<key>pfm_title</key>
			<string>Hide gallery view on launch</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.34.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Additional key to 'OUIWhatsNewShownItemIds' that services as a single place to remove all future "What's new" messages for all suite apps: Word, PowerPoint, Excel, Outlook, and OneNote.</string>
			<key>pfm_name</key>
			<string>ShowWhatsNewOnLaunch</string>
			<key>pfm_title</key>
			<string>Hide what's new message after update</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.33.0</string>
			<key>pfm_description</key>
			<string>Sets the Open and Save options to default to 'On My Mac' instead of 'Online Locations'.</string>
			<key>pfm_name</key>
			<string>DefaultsToLocalOpenSave</string>
			<key>pfm_title</key>
			<string>Use 'On My Mac' as default open and save location</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.33.0</string>
			<key>pfm_default</key>
			<string>DisabledWithWarnings</string>
			<key>pfm_description</key>
			<string>Sets the VisualBasic Macro security level.</string>
			<key>pfm_name</key>
			<string>VisualBasicMacroExecutionState</string>
			<key>pfm_range_list</key>
			<array>
				<string>DisabledWithoutWarnings</string>
				<string>DisabledWithWarnings</string>
				<string>EnabledWithoutWarnings</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Disabled: Without Warnings</string>
				<string>Disabled: With Warnings</string>
				<string>Enabled: Without Warnings</string>
			</array>
			<key>pfm_title</key>
			<string>VisualBasic macro security level</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.33.0</string>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>Increase logging levels for authentication requests.</string>
			<key>pfm_name</key>
			<string>msoridEnableLogging</string>
			<key>pfm_title</key>
			<string>Enable logging for authentication requests</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_type_input</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.33.0</string>
			<key>pfm_default</key>
			<integer>200</integer>
			<key>pfm_description</key>
			<string>Set value to 200 if msoridEnableLogging is enabled.</string>
			<key>pfm_name</key>
			<string>msoridDefaultMinimumSeverity</string>
			<key>pfm_title</key>
			<string>Minimum severity for authentication requests logging</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.33.0</string>
			<key>pfm_description</key>
			<string>Triggers for pre 15.32 preferences to be migrated to the new domain going forward. In most cases you should NOT manage or touch this.</string>
			<key>pfm_name</key>
			<string>HaveMergedOldPrefs</string>
			<key>pfm_title</key>
			<string>Migrate old preferences to new domain</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.16</string>
			<key>pfm_description</key>
			<string>The DisableVisualBasicMacScript setting determines if macros are allowed to invoke the MacScript() Visual Basic API. This API allows macros to execute arbitrary processes via AppleScript by including “do shell script ...” in the AppleScript code. 
The default value for this setting allows using MacScript, as there are a number of legitimate uses of AppleScript that do not rely on external processes. When this setting is set to NO, macros that attempt to use MacScript will fail with an error at the point where MacScript is invoked.</string>
			<key>pfm_description_reference</key>
			<string>The DisableVisualBasicMacScript setting determines if macros are allowed to invoke the MacScript() Visual Basic API. This API allows macros to execute arbitrary processes via AppleScript by including “do shell script ...” in the AppleScript code. 
The default value for this setting allows using MacScript, as there are a number of legitimate uses of AppleScript that do not rely on external processes. When this setting is set to NO, macros that attempt to use MacScript will fail with an error at the point where MacScript is invoked.</string>
			<key>pfm_name</key>
			<string>DisableVisualBasicMacScript</string>
			<key>pfm_title</key>
			<string>Disable macros from invoking the MacScript() Visual Basic API.</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.17</string>
			<key>pfm_description</key>
			<string>If you don't want your users to see the new MS Use Terms (Sept 2018) dialog, and instead auto-accept the terms on their behalf, set this value to True.</string>
			<key>pfm_description_reference</key>
			<string>If you don't want your users to see the new MS Use Terms (Sept 2018) dialog, and instead auto-accept the terms on their behalf, set this value to True.</string>
			<key>pfm_name</key>
			<string>TermsAccepted1809</string>
			<key>pfm_title</key>
			<string>Auto accept the MS Use Terms (Sept 2018).</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.21</string>
			<key>pfm_description</key>
			<string>Controls the ability for Office to write to the VB project through the VBA object model.</string>
			<key>pfm_description_reference</key>
			<string>For Office 2019 only: The VBAObjectModelIsTrusted setting determines if macros are allowed to modify the VB project itself through the VBA object model. The default value for this setting distrusts the VB object model and prevents macros from modifying the VB project. When this setting is set to NO, macros that attempt to invoke any method in the VB object model will fail with an error at that point in the code.</string>
			<key>pfm_name</key>
			<string>VBAObjectModelIsTrusted</string>
			<key>pfm_title</key>
			<string>VBAObjectModelIsTrusted</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.31</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Controls the ability for 3rd party vendors to use a DECLARE statement to bind a Visual Basic symbol name to an external procedure in the local OS.</string>
			<key>pfm_description_reference</key>
			<string>The DisableVisualBasicExternalDylibs setting determines if macros are allowed to use a DECLARE statement to bind a Visual Basic symbol name to an external procedure in the local OS. The default value for this setting is to allow binding to external dylibs because many legitimate 3rd party addin vendors use this feature of Visual Basic to add and extend features in Office for Mac. When this setting is set to NO, macros that attempt to use a DECLARE statement will fail with an error at the point where the external procedure is invoked.</string>
			<key>pfm_name</key>
			<string>DisableVisualBasicExternalDylibs</string>
			<key>pfm_note</key>
			<string>Many legitimate 3rd party addin vendors use this feature of Visual Basic to add and extend features in Office for Mac.</string>
			<key>pfm_title</key>
			<string>DisableVisualBasicExternalDylibs</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.31</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Determines if macros are allowed to use a DECLARE to bind to the system() OS API.</string>
			<key>pfm_description_reference</key>
			<string>The AllowVisualBasicToBindToSystem setting determines if macros are allowed to use a DECLARE to bind to the system() OS API. This API allows macros to execute arbitrary external processes and pass them arbitrary data on the command line. The default value for this setting disallows the binding, as the system() API should not be used. When this setting is set to NO, macros that attempt to use system() will fail with an error at the point where system() is invoked.</string>
			<key>pfm_name</key>
			<string>AllowVisualBasicToBindToSystem</string>
			<key>pfm_title</key>
			<string>AllowVisualBasicToBindToSystem</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.16</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Determines if macros are allowed to use a DECLARE to bind to the popen() OS API. This API allows macros to execute arbitrary external processes and pass them arbitrary data on the command line.</string>
			<key>pfm_description_reference</key>
			<string>The DisableVisualBasicToBindToPopen setting determines if macros are allowed to use a DECLARE to bind to the popen() OS API. This API allows macros to execute arbitrary external processes and pass them arbitrary data on the command line. The default value for this setting allows the binding, as at least one 3rd party vendor uses popen to communicate with their own code. When this setting is set to NO, macros that attempt to use popen() will fail with an error at the point where popen() is invoked.</string>
			<key>pfm_name</key>
			<string>DisableVisualBasicToBindToPopen</string>
			<key>pfm_note</key>
			<string>At least one 3rd party vendor uses popen to communicate with their own code.</string>
			<key>pfm_title</key>
			<string>DisableVisualBasicToBindToPopen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.24</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the Office Suite installer from installing Word. Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist.</string>
			<key>pfm_description_reference</key>
			<string>Disable the Office Suite installer from installing Word. Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist</string>
			<key>pfm_name</key>
			<string>InstallWord</string>
			<key>pfm_title</key>
			<string>Install Word</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.24</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the Office Suite installer from installing Excel. Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist.</string>
			<key>pfm_description_reference</key>
			<string>Disable the Office Suite installer from installing Excel. Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist.</string>
			<key>pfm_name</key>
			<string>InstallExcel</string>
			<key>pfm_title</key>
			<string>Install Excel</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.24</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the Office Suite installer from installing PowerPoint. Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist.</string>
			<key>pfm_description_reference</key>
			<string>Disable the Office Suite installer from installing PowerPoint. Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist</string>
			<key>pfm_name</key>
			<string>InstallPowerPoint</string>
			<key>pfm_title</key>
			<string>Install PowerPoint</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.24</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the Office Suite installer from installing Outlook. Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist.</string>
			<key>pfm_description_reference</key>
			<string>Disable the Office Suite installer from installing Outlook. Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist</string>
			<key>pfm_name</key>
			<string>InstallOutlook</string>
			<key>pfm_title</key>
			<string>Install Outlook</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.24</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the Office Suite installer from installing OneNote. Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist.</string>
			<key>pfm_description_reference</key>
			<string>Disable the Office Suite installer from installing OneNote. Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist</string>
			<key>pfm_name</key>
			<string>InstallOneNote</string>
			<key>pfm_title</key>
			<string>Install OneNote</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.24</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the Office Suite installer from installing OneDrive. Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist.</string>
			<key>pfm_description_reference</key>
			<string>Disable the Office Suite installer from installing OneDrive. Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist</string>
			<key>pfm_name</key>
			<string>InstallOneDrive</string>
			<key>pfm_title</key>
			<string>Install OneDrive</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.24</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the Office Suite installer from installing AutoUpdate (MAU). Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist.</string>
			<key>pfm_description_reference</key>
			<string>Disable the Office Suite installer from installing AutoUpdate. Only valid if set with a configuration profile or if written to /Library/Managed Preferences/com.microsoft.office.plist</string>
			<key>pfm_name</key>
			<string>InstallAutoUpdate</string>
			<key>pfm_title</key>
			<string>Install AutoUpdate (MAU)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_title</key>
	<string>Microsoft Office</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>5</integer>
</dict>
</plist>
