<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	
	<key>pfm_app_url</key>
	<string>https://github.com/macadmins/supportcompanion/releases</string>
	
	<key>pfm_documentation_url</key>
	<string>https://github.com/macadmins/supportcompanion</string>

	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>

	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>

	<key>pfm_description</key>
	<string>Support Companion settings</string>
	
	<key>pfm_domain</key>
	<string>com.almenscorner.supportcompanion</string>

	<key>pfm_format_version</key>
	<integer>1</integer>
	
	<key>pfm_last_modified</key>
	<date>2024-05-27T17:12:02Z</date>
	
	<key>pfm_title</key>
	<string>Support Companion</string>
	
	<key>pfm_unique</key>
	<false/>
	
	<key>pfm_version</key>
	<integer>1</integer>
	
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Support Companion configuration preferences</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<dict>
			<key>pfm_default</key>
			<string>Support Companion</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<dict>
			<key>pfm_default</key>
			<string>SupportCompanion</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>

		<dict>
			<key>pfm_default</key>
			<string>SupportCompanion</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>

		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>

		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Home</string>
				<string>Notifications</string>
				<string>Branding</string>
				<string>Mode</string>
				<string>Tray menu</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Home</key>
				<array>
					<string>HiddenWidgets</string>
					<string>HiddenActions</string>
					<string>SupportEmail</string>
					<string>SupportPhone</string>
					<string>SupportUrl</string>
					<string>ChangePasswordUrl</string>
					<string>ChangePasswordMode</string>
					<string>LogFolders</string>
				</array>
				<key>Notifications</key>
				<array>
					<string>NotificationInterval</string>
					<string>NotificationTitle</string>
					<string>NotificationImage</string>
					<string>SoftwareUpdateNotificationMessage</string>
					<string>SoftwareUpdateNotificationButtonText</string>
					<string>AppUpdateNotificationMessage</string>
					<string>AppUpdateNotificationButtonText</string>
				</array>
				<key>Branding</key>
				<array>
					<string>BrandName</string>
					<string>BrandColor</string>
					<string>CustomColors</string>
				</array>
				<key>Mode</key>
				<array>
					<string>IntuneMode</string>
				</array>
				<key>Tray menu</key>
				<array>
					<string>Actions</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<dict>
			<key>pfm_name</key>
			<string>BrandName</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Brand Name</string>
			<key>pfm_description</key>
			<string>Configures the name shown in the navigation menu.</string>
			<key>pfm_value_placeholder</key>
			<string>AwesomeCorp</string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>BrandColor</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Brand Color</string>
			<key>pfm_description</key>
			<string>Configures the brand color shown in the app, available colors are: Blue, Green, Red, Orange. Defaults to Blue if not configured.</string>
			<key>pfm_range_list</key>
			<array>
				<string>Blue</string>
				<string>Green</string>
				<string>Red</string>
				<string>Orange</string>
			</array>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>SupportUrl</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Support Page URL</string>
			<key>pfm_description</key>
			<string>Configures the URL to open when the user clicks on the Get Support button.</string>
			<key>pfm_value_placeholder</key>
			<string>https://awesomecorp.support</string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>ChangePasswordUrl</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Change Password URL</string>
			<key>pfm_description</key>
			<string>Configures the URL to open when the user clicks on the Change Password button.</string>
			<key>pfm_value_placeholder</key>
			<string>https://awesomecorp.support/changepassword</string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>ChangePasswordMode</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Change Password Mode</string>
			<key>pfm_description</key>
			<string>Configures the mode for the Change Password button, available modes are: local, SSOExtension, url. Defaults to local if not configured.</string>
			<key>pfm_range_list</key>
			<array>
				<string>local</string>
				<string>SSOExtension</string>
				<string>url</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Local</string>
				<string>SSO Extension</string>
				<string>URL</string>
			</array>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>SupportEmail</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Support Email</string>
			<key>pfm_description</key>
			<string>Configures the email address shown when the user clicks on the Support Info button.</string>
			<key>pfm_value_placeholder</key>
			<string>support@awesomecorp.io</string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>SupportPhone</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Support Phone</string>
			<key>pfm_description</key>
			<string>Configures the phone number shown when the user clicks on the Support Info button.</string>
			<key>pfm_value_placeholder</key>
			<string>111-222-333-4444</string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>HiddenWidgets</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_title</key>
			<string>Hidden Widgets</string>
			<key>pfm_description</key>
			<string>Configures which widgets to hide, available widgets are: DeviceInfo, MunkiPendingApps, MunkiUpdates, IntunePendingApps, IntuneUpdates, Storage, MdmStatus, Actions, Battery, EvergreenInfo.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>HiddenActions</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_title</key>
			<string>Hidden Actions</string>
			<key>pfm_description</key>
			<string>Configures which actions to hide, available actions are: Support, ManagedSoftwareCenter, ChangePassword, Reboot, KillAgent, SoftwareUpdates, GatherLogs.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
		</dict>
		
		<dict>
			<key>pfm_name</key>
			<string>NotificationInterval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_title</key>
			<string>Notification Interval</string>
			<key>pfm_description</key>
			<string>Configures the interval for notifications in hours for Application Updates and Software Updates notifications.</string>

			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_range_max</key>
			<integer>24</integer>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>NotificationTitle</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Notification Title</string>
			<key>pfm_description</key>
			<string>Configures the title for notifications for notifications. Defaults to Support Companion if not configured.</string>
			<key>pfm_value_placeholder</key>
			<string>AwesomeCorp</string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>NotificationImage</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Notification Image</string>
			<key>pfm_description</key>
			<string>Configures an image to add to notifications. Local path should be specified.</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>SoftwareUpdateNotificationMessage</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Software Update Notification Message</string>
			<key>pfm_description</key>
			<string>Configures the message for notifications for Software Updates notifications. Defaults to "You have software updates available. Take action now! \ud83c\udf89" if not configured.</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>SoftwareUpdateNotificationButtonText</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Software Update Notification Button Text</string>
			<key>pfm_description</key>
			<string>Configures the button text for notifications for Software Updates notifications. Defaults to "Details \ud83d\udc40" if not configured.</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>AppUpdateNotificationMessage</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>App Update Notification Message</string>
			<key>pfm_description</key>
			<string>Configures the message for notifications for App Updates notifications. Defaults to "You have app updates available. Take action now! \ud83c\udf89" if not configured.</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>AppUpdateNotificationButtonText</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>App Update Notification Button Text</string>
			<key>pfm_description</key>
			<string>Configures the button text for notifications for App Updates notifications. Defaults to "Details \ud83d\udc40" if not configured.</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>
		
		<dict>
			<key>pfm_name</key>
			<string>CustomColors</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_title</key>
			<string>Custom Colors</string>
			<key>pfm_description</key>
			<string>Configures custom colors for the app, should be specified in hex format, see example below. Do not use BrandColor in conjunction with this key.</string>
			
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>PrimaryColor</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_title</key>
							<string>Primary Color</string>
							<key>pfm_description</key>
							<string>Configures the Primary Color for the app.</string>
							<key>pfm_value_placeholder</key>
							<string>#00A0D0</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>AccentColor</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_title</key>
							<string>Accent Color</string>
							<key>pfm_description</key>
							<string>Configures the Accent Color for the app.</string>
							<key>pfm_value_placeholder</key>
							<string>#45637A</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>IntuneMode</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_title</key>
			<string>Intune Mode</string>
			<key>pfm_description</key>
			<string>Configures the app to use Intune for application information. Only supports PKG and DMG type apps, not LOB.</string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>LogFolders</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_title</key>
			<string>Log Folders</string>
			<key>pfm_description</key>
			<string>Configures the log folders to gather logs from. Only used when gathering logs. Defaults to "/Library/Logs/Microsoft" if not configured.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>/Library/Managed Installs/Logs</string>
				</dict>
			</array>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>Actions</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_title</key>
			<string>Actions</string>
			<key>pfm_description</key>
			<string>Configures custom actions to add to the tray menu. See example below.</string>
			
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Name</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_title</key>
							<string>Name</string>
							<key>pfm_description</key>
							<string>Name of the action to show in the menu.</string>
							<key>pfm_value_placeholder</key>
							<string>Awesome command</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>Command</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_title</key>
							<string>Command</string>
							<key>pfm_description</key>
							<string>Command to run when to item is clicked.</string>
							<key>pfm_value_placeholder</key>
							<string>killall pboard</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
	</array>
</dict>
</plist>