<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>pfm_app_url</key>
    <string>https://theunarchiver.com</string>
    <key>pfm_description</key>
    <string>The Unarchiver (Standalone) settings</string>
    <key>pfm_domain</key>
    <string>com.macpaw.site.theunarchiver</string>
    <key>pfm_format_version</key>
    <integer>1</integer>
    <key>pfm_last_modified</key>
    <date>2019-08-27T15:50:17Z</date>
    <key>pfm_subkeys</key>
    <array>
        <dict>
            <key>pfm_default</key>
            <string>Configures The Unarchiver (Standalone) settings</string>
            <key>pfm_description</key>
            <string>Description of the payload</string>
            <key>pfm_name</key>
            <string>PayloadDescription</string>
            <key>pfm_title</key>
            <string>Payload Description</string>
            <key>pfm_type</key>
            <string>string</string>
        </dict>
        <dict>
            <key>pfm_default</key>
            <string>The Unarchiver (Standalone)</string>
            <key>pfm_description</key>
            <string>Name of the payload</string>
            <key>pfm_name</key>
            <string>PayloadDisplayName</string>
            <key>pfm_require</key>
            <string>always</string>
            <key>pfm_title</key>
            <string>Payload Display Name</string>
            <key>pfm_type</key>
            <string>string</string>
        </dict>
        <dict>
            <key>pfm_default</key>
            <string>com.macpaw.site.theunarchiver</string>
            <key>pfm_description</key>
            <string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
            <key>pfm_name</key>
            <string>PayloadIdentifier</string>
            <key>pfm_require</key>
            <string>always</string>
            <key>pfm_title</key>
            <string>Payload Identifier</string>
            <key>pfm_type</key>
            <string>string</string>
        </dict>
        <dict>
            <key>pfm_default</key>
            <string>com.macpaw.site.theunarchiver</string>
            <key>pfm_description</key>
            <string>The type of the payload, a reverse dns string</string>
            <key>pfm_name</key>
            <string>PayloadType</string>
            <key>pfm_require</key>
            <string>always</string>
            <key>pfm_title</key>
            <string>Payload Type</string>
            <key>pfm_type</key>
            <string>string</string>
        </dict>
        <dict>
            <key>pfm_default</key>
            <string></string>
            <key>pfm_description</key>
            <string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
            <key>pfm_format</key>
            <string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
            <key>pfm_name</key>
            <string>PayloadUUID</string>
            <key>pfm_require</key>
            <string>always</string>
            <key>pfm_title</key>
            <string>Payload UUID</string>
            <key>pfm_type</key>
            <string>string</string>
        </dict>
        <dict>
            <key>pfm_default</key>
            <integer>1</integer>
            <key>pfm_description</key>
            <string>The version of the whole configuration profile.</string>
            <key>pfm_name</key>
            <string>PayloadVersion</string>
            <key>pfm_require</key>
            <string>always</string>
            <key>pfm_title</key>
            <string>Payload Version</string>
            <key>pfm_type</key>
            <string>integer</string>
        </dict>
        <dict>
            <key>pfm_default</key>
            <false/>
            <key>pfm_description</key>
            <string></string>
            <key>pfm_name</key>
            <string>userAgreedToNewTOSAndPrivacy</string>
            <key>pfm_title</key>
            <string>Suppress Terms of Services and Privacy prompt</string>
            <key>pfm_type</key>
            <string>boolean</string>
        </dict>
        <dict>
            <key>pfm_default</key>
            <false/>
            <key>pfm_description</key>
            <string>Automatically check for The Unarchiver (Standalone) updates</string>
            <key>pfm_name</key>
            <string>SUEnableAutomaticChecks</string>
            <key>pfm_title</key>
            <string>Enable Automatic Update Checks</string>
            <key>pfm_type</key>
            <string>boolean</string>
        </dict>
    </array>
    <key>pfm_targets</key>
    <array>
        <string>system</string>
        <string>user</string>
    </array>
    <key>pfm_title</key>
    <string>The Unarchiver (Standalone)</string>
    <key>pfm_unique</key>
    <true/>
    <key>pfm_version</key>
    <integer>1</integer>
</dict>
</plist>
