<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://www.office.com</string>
	<key>pfm_description</key>
	<string>Microsoft Outlook settings</string>
	<key>pfm_domain</key>
	<string>com.microsoft.Outlook</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2020-08-23T07:21:28Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Microsoft Outlook settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Microsoft Outlook</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.Outlook</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.Outlook</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.18</string>
			<key>pfm_description</key>
			<string>Specify one or more domains users are allowed to add in Outlook. Format strings as regular expressions. Does not remove or disconnect accounts already added in Outlook. Supports regular expressions to allow for catching multiple domains.</string>
			<key>pfm_description_reference</key>
			<string>Specify one or more domains users are allowed to add in Outlook. Format strings as regular expressions. Does not remove or disconnect accounts already added in Outlook. Supports regular expressions to allow for catching multiple domains.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/DeployOffice/mac/preferences-outlook#allow-only-corporate-mailboxes-to-be-added</string>
			<key>pfm_name</key>
			<string>AllowedEmailDomains</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>AllowedEmailDomainsItem</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allowed Email Domains</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.17</string>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>Set when pictures are automatically downloaded from the Internet for email.</string>
			<key>pfm_description_reference</key>
			<string>Controls the download of pictures in the reading panel. GUI Preference &gt; Email &gt; Reading &gt; Security. 0 = Never, 1 = In messages from my contacts, 2 = In all messages</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/DeployOffice/mac/preferences-outlook#specify-when-pictures-are-downloaded-for-email</string>
			<key>pfm_name</key>
			<string>AutomaticallyDownloadExternalContent</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Never</string>
				<string>In messages from my contacts</string>
				<string>In all messages</string>
			</array>
			<key>pfm_title</key>
			<string>Automatically Download External Content</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.19</string>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>Set the first day of week in calendar view.</string>
			<key>pfm_description_reference</key>
			<string>Set the first day of week in calendar view.
					1 = Sunday (default)
					2 = Monday
					3 = Tuesday
					4 = Wednesday
					5 = Thursday
					6 = Friday
					7 = Saturday
			</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/deployoffice/mac/preferences-outlook#specify-calendar-first-day-of-week</string>
			<key>pfm_name</key>
			<string>CalendarFirstDayOfWeek</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
				<integer>4</integer>
				<integer>5</integer>
				<integer>6</integer>
				<integer>7</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Sunday</string>
				<string>Monday</string>
				<string>Tuesday</string>
				<string>Wednesday</string>
				<string>Thursday</string>
				<string>Friday</string>
				<string>Saturday</string>
			</array>
			<key>pfm_title</key>
			<string>Calendar: First Day of the Week</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.18</string>
			<key>pfm_description</key>
			<string>Set the domain or full email address of Office 365 mailbox to be added on first launch. The full email address or domain specified will be added in Outlook instead of the Office activation email address. For a domain use "example.com" formatting (no "@") and the alias/username from the activation email address will be combined with the domain entered in this pref key.</string>
			<key>pfm_description_reference</key>
			<string>Set the domain or full email address of Office 365 mailbox to be added on first launch. The full email address or domain specified will be added in Outlook instead of the Office activation email address.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/deployoffice/mac/preferences-outlook#specify-office-365-mailbox-to-be-added-on-first-launch</string>
			<key>pfm_name</key>
			<string>DefaultEmailAddressOrDomain</string>
			<key>pfm_title</key>
			<string>Default Email Address or Domain</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.20</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Disable macOS Dark Mode settings for application.</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.slack.com/archives/C07UZ1X7B/p1544660345485200</string>
			<key>pfm_name</key>
			<string>NSRequiresAquaSystemAppearance</string>
			<key>pfm_title</key>
			<string>Disable Dark Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.18</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Prevent users from being able to export archive files (.olm).</string>
			<key>pfm_description_reference</key>
			<string>Prevent users from being able to export archive files (.olm). Key must be set to true and forced.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/deployoffice/mac/preferences-outlook#disable-export</string>
			<key>pfm_name</key>
			<string>DisableExport</string>
			<key>pfm_title</key>
			<string>Disable Export</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.18</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Prevent users from being able to import archive files (.olm and .pst) and Outlook 2011 for Mac data.</string>
			<key>pfm_description_reference</key>
			<string>Prevent users from being able to import archive files (.olm and .pst) and Outlook 2011 for Mac data. Key must be set to true and forced.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/deployoffice/mac/preferences-outlook#disable-import</string>
			<key>pfm_name</key>
			<string>DisableImport</string>
			<key>pfm_title</key>
			<string>Disable Import</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Disable Modern Authentication connections from Outlook.</string>
			<key>pfm_description_reference</key>
			<string>Allows an admin to disable Modern Authentication connections from Outlook.</string>
			<key>pfm_documentation_url</key>
			<string>https://techcommunity.microsoft.com/t5/Exchange-Team-Blog/Announcing-Hybrid-Modern-Authentication-for-Exchange-On-Premises/ba-p/607476#toc-hId-1074080815</string>
			<key>pfm_name</key>
			<string>DisableModernAuth</string>
			<key>pfm_title</key>
			<string>Disable Modern Authentication</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_max</key>
			<string>16.16.x</string>
			<key>pfm_app_min</key>
			<string>15.23</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Disable preview generation for encrypted email messages.</string>
			<key>pfm_description_reference</key>
			<string>n Microsoft Outlook 2016 for Mac, when you navigate to a folder in which several encrypted email messages are displayed in the message list, Outlook freezes or experiences other performance issues. To fix this issue, update Outlook 2016 for Mac to version 15.23 or a later version. Then, disable the preview feature for encrypted email messages.</string>
			<key>pfm_documentation_url</key>
			<string>https://support.microsoft.com/en-us/help/3172627/outlook-2016-for-mac-freezes-on-email-folders-that-contain-several-enc</string>
			<key>pfm_name</key>
			<string>DisablePreviewForSMIME</string>
			<key>pfm_title</key>
			<string>Disable Preview for SMIME</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.18</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Prevent users from being able to create, edit, and add client-side signatures.</string>
			<key>pfm_description_reference</key>
			<string>Prevent users from being able to create, edit, and add client-side signatures. Key must be set to true and forced.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/deployoffice/mac/preferences-outlook#disable-signatures</string>
			<key>pfm_name</key>
			<string>DisableSignatures</string>
			<key>pfm_title</key>
			<string>Disable Signatures</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.19</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Prevent users from adding Skype for Business online meeting details to events.</string>
			<key>pfm_description_reference</key>
			<string>Prevent users from adding Skype for Business online meeting details to events. Key must be set to true and forced.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/deployoffice/mac/preferences-outlook#disable-skype-for-business-online-meetings</string>
			<key>pfm_name</key>
			<string>DisableSkypeMeeting</string>
			<key>pfm_title</key>
			<string>Disable Skype Meetings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.20</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Prevent users from adding Teams online meeting details to events.</string>
			<key>pfm_description_reference</key>
			<string>Prevent users from adding Teams online meeting details to events. Key must be set to true and forced.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/deployoffice/mac/preferences-outlook#disable-teams-online-meetings</string>
			<key>pfm_name</key>
			<string>DisableTeamsMeeting</string>
			<key>pfm_title</key>
			<string>Disable Teams Meetings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>16.17</string>
			<key>pfm_app_max</key>
			<string>16.16.x</string>
			<key>pfm_app_min</key>
			<string>15.x</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Disable the offer to import mailbox or setup an email account in Outlook 2016.</string>
			<key>pfm_description_reference</key>
			<string>Controls offer to import mailbox or setup an email account. (That's a cap o15, not zero15).</string>
			<key>pfm_documentation_url</key>
			<string>https://derflounder.wordpress.com/2016/01/17/suppressing-office-2016s-first-run-dialog-windows/</string>
			<key>pfm_name</key>
			<string>FirstRunExperienceCompletedO15</string>
			<key>pfm_title</key>
			<string>First Run Experience Completed</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>16.17</string>
			<key>pfm_app_max</key>
			<string>16.16.x</string>
			<key>pfm_app_min</key>
			<string>15.x</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Controls the original "What's New" dialog and Office 365 activation prompt on first launch. Replaced by 'OfficeAutoSignIn' in the main Office profile starting in version 16.17 and should not be used for Office 2019.</string>
			<key>pfm_description_reference</key>
			<string>Controls the original "What's New" dialog and Office 365 activation prompt on first launch. Replaced by OfficeAutoSignIn starting in version 16.17.</string>
			<key>pfm_documentation_url</key>
			<string>https://derflounder.wordpress.com/2016/01/17/suppressing-office-2016s-first-run-dialog-windows/</string>
			<key>pfm_name</key>
			<string>kSubUIAppCompletedFirstRunSetup1507</string>
			<key>pfm_title</key>
			<string>First Run Setup Completed</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.17</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Prevent users from viewing local On My Computer folders in the sidebar. Found under Outlook &gt; Preferences &gt; General &gt; Sidebar.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/DeployOffice/mac/preferences-outlook#hide-local-folders</string>
			<key>pfm_name</key>
			<string>HideFoldersOnMyComputerRootInFolderList</string>
			<key>pfm_title</key>
			<string>Hide Local Folders</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.18</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Hide the “Did you know? Outlook supports…” text in the Set Up Your Email success dialog box. Only hides text. Does not impact ability to add non-corporate mailboxes.</string>
			<key>pfm_description_reference</key>
			<string>Hide the “Did you know? Outlook supports…” text in the Set Up Your Email success dialog box. Only hides text. Does not impact ability to add non-corporate mailboxes.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/deployoffice/mac/preferences-outlook#hide-text-about-adding-non-corporate-mailboxes</string>
			<key>pfm_name</key>
			<string>HideCanAddOtherAccountTypesTipText</string>
			<key>pfm_title</key>
			<string>Hide text about adding non-corporate mailboxes</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.13</string>
			<key>pfm_description</key>
			<string>Prevent users from signing in to any O365 service. This has the added effect of making sure users store no data online via microsoft servers.</string>
			<key>pfm_description_reference</key>
			<string>This will prevent user from signing in to any O365 service. This has the added effect of making sure users store no data online via microsoft servers.

* As of 16.13.0 these options work again.
            0 - all accounts allowed
            1 - prevent institutional accounts - only MSA (personal) accounts
            2 - prevent MSA (personal) accounts - only institution accounts
            4 - no accounts allowed to sign in</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.google.com/spreadsheets/d/1ESX5td0y0OP3jdzZ-C2SItm-TUi-iA_bcHCBvaoCumw/</string>
			<key>pfm_name</key>
			<string>SignInOptions</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
				<integer>4</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>All accounts allowed</string>
				<string>Only personal accounts (MSA)</string>
				<string>Only institution accounts</string>
				<string>No accounts allowed</string>
			</array>
			<key>pfm_title</key>
			<string>Sign In Options</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>This key when set to false will deactivate the ability for users to use the "Smile" feature to send feedback to Microsoft.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.google.com/spreadsheets/d/1ESX5td0y0OP3jdzZ-C2SItm-TUi-iA_bcHCBvaoCumw/</string>
			<key>pfm_name</key>
			<string>SendASmileEnabled</string>
			<key>pfm_title</key>
			<string>Send A Smile Enabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>16.28</string>
			<key>pfm_app_max</key>
			<string>16.27</string>
			<key>pfm_app_min</key>
			<string>15.x</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Set to FALSE to send minimal heartbeat data, no application usage, and no environment details.</string>
			<key>pfm_description_reference</key>
			<string>Set to false to send minimal heartbeat data, no application usage, and no environment details.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/deployoffice/deploy-office-365-proplus-in-gcc-high-dod#turn-off-sending-telemetry-data-to-microsoft-from-office-for-mac</string>
			<key>pfm_name</key>
			<string>SendAllTelemetryEnabled</string>
			<key>pfm_title</key>
			<string>Send Telemetry Data</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>16.28</string>
			<key>pfm_app_max</key>
			<string>16.27</string>
			<key>pfm_app_min</key>
			<string>15.x</string>
			<key>pfm_description</key>
			<string>Sends crash reports even if telemetry is disabled. Will only be evaluated if 'Send Telemetry Data' is FALSE.</string>
			<key>pfm_description_reference</key>
			<string>This will stop your client devices sending us usage telemetry and asking questions to your users, but if the app crashes, we'll still invoke our Error Reporting dialog and get the call-stack back here so we can see if you're running into problems. The issue here is that if you don't enable crash reporting, we are completely blind as to whether folks out there are having problems or not. Relevant for those who disable telemetry through the SendAllTelemetryEnabled key.</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.slack.com/archives/C07UZ1X7B/p1536706447000100</string>
			<key>pfm_name</key>
			<string>SendCrashReportsEvenWithTelemetryDisabled</string>
			<key>pfm_title</key>
			<string>Send Crash Reports even with Telemetry Disabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.36</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Disable account configuration window when the profile is empty.</string>
			<key>pfm_description_reference</key>
			<string>With the true value of the settings, Outlook will stop prompting for account add when the profile is empty during first run and subsequent start.</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.slack.com/archives/C19MR7EM9/p1497634255270865</string>
			<key>pfm_name</key>
			<string>OverrideAccountConfigurationWindow</string>
			<key>pfm_title</key>
			<string>Suppress Account Configuration Window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.13.1</string>
			<key>pfm_description</key>
			<string>Disable the "Connected Services" dialog for MSA-based (personal) accounts.</string>
			<key>pfm_description_reference</key>
			<string>MSA-based Key to suppress a screen on update from pre-16.13 called "Connected Services" with an Accept button on it. If you wish to suppress this new dialog for MSA-based accounts set this key to TRUE.</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.slack.com/archives/C07UZ1X7B/p1527191452000462</string>
			<key>pfm_name</key>
			<string>kFRETelemetryConsentKey</string>
			<key>pfm_title</key>
			<string>Suppress 'Connected Services' dialog</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.11</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Disable the "Introducing groups in Outlook" dialog.</string>
			<key>pfm_description_reference</key>
			<string>Outlook code checks this key on launch after a O365 activation.

If set to FALSE, it pops the advertising dialog in the links column -&gt; 
If the key is set to TRUE, the code believes that the user has already seen the dialog.</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.slack.com/archives/C07UZ1X7B/p1528845850000040</string>
			<key>pfm_name</key>
			<string>o365GroupsOobePromoTriggeredPref</string>
			<key>pfm_title</key>
			<string>Suppress Groups Promotion dialog</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.11</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Disable promotion dialog about adding Google Contacts/Calendar.</string>
			<key>pfm_description_reference</key>
			<string>Outlook code checks this key on launch after a O365 activation.

If set to FALSE, it pops the promotion dialog about adding Google Contacts/Calendar.
If the key is set to TRUE, the code believes that the user has already seen the dialog.</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.slack.com/archives/C07UZ1X7B/p1528897598000193</string>
			<key>pfm_name</key>
			<string>googlePromoTriggeredPref</string>
			<key>pfm_title</key>
			<string>Suppress Google Contacts/Calendar dialog</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>15.29</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Suppress the warning when Autodiscover is redirected from HTTP to HTTPS.</string>
			<key>pfm_description_reference</key>
			<string>When Microsoft Outlook 2016 for Mac connects to an Office 365 account, Autodiscover is redirected from HTTP to HTTPS, and you may receive a warning message that resembles the following:

Outlook was redirected to the server Autodiscover-s.outlook.com to get new settings for your account user@domain.com. Do you want to allow this server to configure your settings?
https://autodiscover-s.outlook.com/autodiscover/autodiscover.xml
Click Allow only if you fully trust the source, or if your Exchange administrator instructs you to.

When this warning message occurs, you may select Always use my response for this server and then click Allow in order not to be asked about this specific server again for this Outlook 2016 for Mac profile.

You or administrators may want to suppress the initial warning message.</string>
			<key>pfm_documentation_url</key>
			<string>https://support.microsoft.com/en-us/help/3206915/how-to-suppress-the-office-365-autodiscover-redirect-warning-in-outloo</string>
			<key>pfm_name</key>
			<string>TrustO365AutodiscoverRedirect</string>
			<key>pfm_title</key>
			<string>Suppress Office 365 Autodiscover Redirect Warning</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>16.28</string>
			<key>pfm_app_max</key>
			<string>16.27 ONLY</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Suppresses a temporary Privacy and Services Update dialog in 16.27 ONLY. (Was previously used for a similar purpose in 16.13.1 but the key was recycled.)</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.software/docs/16.28-Privacy-Consent.key</string>
			<key>pfm_name</key>
			<string>kFREEnterpriseTelemetryInfoKey</string>
			<key>pfm_title</key>
			<string>Suppress Privacy and Services dialog</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>16.28</string>
			<key>pfm_app_max</key>
			<string>16.27</string>
			<key>pfm_app_min</key>
			<string>16.17</string>
			<key>pfm_description</key>
			<string>Suppress the "Use Intelligent Services?" pop-up dialog and auto-accept the terms in 16.17 through 16.27.</string>
			<key>pfm_description_reference</key>
			<string>Users who are activated with O365 will see a new "Use Intelligent Services?" pop-up dialog in Word, Excel &amp; PowerPoint after updating to 16.17. The net effect of doing this will enable Researcher (Word), Translate (Word, Excel, PowerPoint), Smart Lookup (Word, PowerPoint), and QuickStarter (PowerPoint). Set to TRUE to auto-accept. Requires "PII_And_Intelligent_Services_Preference" as well.</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.software/docs/16.28-Privacy-Consent.key</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>PII_And_Intelligent_Services_Preference</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>PII_And_Intelligent_Services_Preference</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>kFREIntelligenceServicesConsentV2Key</string>
			<key>pfm_title</key>
			<string>Suppress 'Use Intelligent Services' dialog (1/2)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>16.28</string>
			<key>pfm_app_max</key>
			<string>16.27</string>
			<key>pfm_app_min</key>
			<string>16.17</string>
			<key>pfm_description</key>
			<string>Suppress the "Use Intelligent Services?" pop-up dialog and auto-accept the terms in 16.17 through 16.27.</string>
			<key>pfm_description_reference</key>
			<string>Users who are activated with O365 will see a new "Use Intelligent Services?" pop-up dialog in Word, Excel &amp; PowerPoint after updating to 16.17. The net effect of doing this will enable Researcher (Word), Translate (Word, Excel, PowerPoint), Smart Lookup (Word, PowerPoint), and QuickStarter (PowerPoint). Set to TRUE to auto-accept. Requires "kFREIntelligenceServicesConsentV2Key" as well.</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.software/docs/16.28-Privacy-Consent.key</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>kFREIntelligenceServicesConsentV2Key</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>kFREIntelligenceServicesConsentV2Key</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>PII_And_Intelligent_Services_Preference</string>
			<key>pfm_title</key>
			<string>Suppress 'Use Intelligent Services' dialog (2/2)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.18</string>
			<key>pfm_description</key>
			<string>Set default location for weather in calendar view. Use the format returned by the weather location search within Outlook. Example: "Paris, France"</string>
			<key>pfm_description_reference</key>
			<string>Set default location for weather in calendar view. Use the format returned by the weather location search within Outlook. Example: "Paris, France"</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/deployoffice/mac/preferences-outlook#weather-location-settings</string>
			<key>pfm_name</key>
			<string>DefaultWeatherLocation</string>
			<key>pfm_title</key>
			<string>Weather: Default Location</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.19</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Prevent users from choosing Update Location Automatically for weather location.</string>
			<key>pfm_description_reference</key>
			<string>Prevent users from choosing Update Location Automatically for weather location.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/deployoffice/mac/preferences-outlook#disable-automatic-updating-of-weather-location</string>
			<key>pfm_name</key>
			<string>Weather_update_automatically</string>
			<key>pfm_title</key>
			<string>Weather: Update Automatically</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.38</string>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>Lets users on the production channel try out the new Outlook. This key can be used to manage the deployment and default position of the new Outlook switch.</string>
			<key>pfm_documentation_url</key>
			<string>https://twitter.com/jeffreykalvass/status/1296500175700205575</string>
			<key>pfm_name</key>
			<string>EnableNewOutlook</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Switch hidden (default)</string>
				<string>Switch displayed, off</string>
				<string>Switch displayed, on</string>
				<string>Enabled, switch hidden</string>
			</array>
			<key>pfm_title</key>
			<string>Enable New Outlook</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Microsoft Outlook</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>7</integer>
</dict>
</plist>
