<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_min</key>
	<string>8.0</string>
	<key>pfm_app_url</key>
	<string>https://1password.com</string>
	<key>pfm_description</key>
	<string>Use this section to define settings for 1Password password manager version 8</string>
	<key>pfm_documentation_url</key>
	<string>https://support.1password.com/mobile-device-management/</string>
	<key>pfm_domain</key>
	<string>com.1password.1password</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2024-12-20T13:41:48Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configure 1Password settings</string>
			<key>pfm_description</key>
			<string>Settings to configure 1Password using your MDM solution</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>1Password</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.1password.1password</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.1password.1password</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Privacy</string>
				<string>Security</string>
				<string>Updates</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>General</key>
				<array>
					<string>app.startAtLogin</string>
					<string>browsers.other-trusted-apps.enabled</string>
					<string>security.autofill.autosubmit</string>
				</array>
				<key>Privacy</key>
				<array>
					<string>privacy.checkCompromisedWebsites</string>
					<string>privacy.checkHibp</string>
					<string>privacy.checkMfa</string>
					<string>privacy.checkPasskeys</string>
					<string>privacy.downloadRichIcons</string>
				</array>
				<key>Security</key>
				<array>
					<string>security.authenticatedUnlock.appleTouchId</string>
					<string>security.authenticatedUnlock.appleWatchUnlock</string>
					<string>security.authenticatedUnlock.requireAccountPasswordAfter</string>
					<string>security.autolock.minutes</string>
					<string>security.autolock.onDeviceLock</string>
					<string>security.autolock.onWindowClose</string>
					<string>security.blockSleepEnabled</string>
					<string>security.clipboard.clearAfter</string>
					<string>security.deviceClipboardSharing</string>
					<string>security.revealPasswords</string>
					<string>security.revealWifiQrCodes</string>
				</array>
				<key>Updates</key>
				<array>
					<string>updates.autoUpdate</string>
					<string>updates.updateChannel</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Force 1Password 8 to start at login</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>app.startAtLogin</string>
			<key>pfm_title</key>
			<string>Start at Login</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>privacy.checkCompromisedWebsites</string>
			<key>pfm_title</key>
			<string>Check for compromised websites</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>privacy.checkMfa</string>
			<key>pfm_title</key>
			<string>Check for two-factor authentication</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>privacy.checkPasskeys</string>
			<key>pfm_title</key>
			<string>Check for passkeys</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Prevents device from sleeping while 1Password is active</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.blockSleepEnabled</string>
			<key>pfm_title</key>
			<string>Allow 1Password to prevent your device from sleeping</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.revealWifiQrCodes</string>
			<key>pfm_title</key>
			<string>Always show Wi-Fi QR codes</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>browsers.other-trusted-apps.enabled</string>
			<key>pfm_title</key>
			<string>Allow connecting to a custom browser</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>You can fill your usernames and passwords everywhere you need to sign in on your Mac</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.autofill.autosubmit</string>
			<key>pfm_title</key>
			<string>Submit automatically with Universal Autofill</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_note</key>
			<string>The allowed values are one-day, two-weeks, thirty-days, and never</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.authenticatedUnlock.requireAccountPasswordAfter</string>
			<key>pfm_range_list</key>
			<array>
				<string>one-day</string>
				<string>thirty-days</string>
				<string>two-weeks</string>
				<string>never</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>1 Day</string>
				<string>30 Days</string>
				<string>2 Weeks</string>
				<string>Never</string>
			</array>
			<key>pfm_title</key>
			<string>Set the password requirement timeframe</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If present enforces whether biometric unlock is allowed (Preferences &gt; Security &gt; Unlock).</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.authenticatedUnlock.appleTouchId</string>
			<key>pfm_title</key>
			<string>Allow Biometric Unlock (Face ID &amp; Touch ID)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If present enforces whether Apple Watch unlock is allowed (Preferences &gt; Security &gt; Unlock).</string>
			<key>pfm_name</key>
			<string>security.authenticatedUnlock.appleWatchUnlock</string>
			<key>pfm_title</key>
			<string>Allow Apple Watch Unlock</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enforces showing passwords and full credit card numbers (Preferences &gt; Security &gt; Conceal Fields).</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.revealPasswords</string>
			<key>pfm_title</key>
			<string>Allow revealing passwords</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enforces the configured locked on sleep,screensaver, or switching users (Preferences &gt; Security &gt; Auto-lock).</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.autolock.onDeviceLock</string>
			<key>pfm_title</key>
			<string>Lock on sleep, screensaver, or switching users</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enforces the configured lock on app exit preference</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.autolock.onWindowClose</string>
			<key>pfm_title</key>
			<string>Lock when main window is closed</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enforces the lock on idle time preference (Preferences &gt; Security &gt; Lock).</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.autolock.minutes</string>
			<key>pfm_note</key>
			<string>You can enforce 1Password auto lock now via 1Password.com as an authenication policy: https://support.1password.com/auto-lock-policy/#manage-the-policy</string>
			<key>pfm_range_max</key>
			<integer>1440</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Set auto-lock timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>minutes</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The amount of time after copying a 1Password item that it is cleared from the clipboard (Preferences &gt; Security &gt; Clipboard).</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.clipboard.clearAfter</string>
			<key>pfm_title</key>
			<string>Clear clipboard after timeout</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enforces whether the clear clipboard preference is enabled or disabled (Preferences &gt; Security &gt; Clear clipboard contents).</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>security.deviceClipboardSharing</string>
			<key>pfm_title</key>
			<string>Allow Universal Clipboard</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Show app and website icons</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>privacy.downloadRichIcons</string>
			<key>pfm_title</key>
			<string>Show app and website icons</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Check for vulnerable passwords</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>privacy.checkHibp</string>
			<key>pfm_title</key>
			<string>Check for vulnerable passwords</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Automatically check for updates</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>updates.autoUpdate</string>
			<key>pfm_title</key>
			<string>Automatically check for updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set release channel</string>
			<key>pfm_documentation_url</key>
			<string>https://support.1password.com/mobile-device-management/</string>
			<key>pfm_name</key>
			<string>updates.updateChannel</string>
			<key>pfm_range_list</key>
			<array>
				<string>PRODUCTION</string>
				<string>BETA</string>
				<string>NIGHTLY</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Production</string>
				<string>Beta</string>
				<string>Nightly</string>
			</array>
			<key>pfm_title</key>
			<string>Set release channel</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>1Password 8</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>3</integer>
</dict>
</plist>
