<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://sqwarq.com/detectx/</string>
	<key>pfm_description</key>
	<string>DetectX Swift settings</string>
	<key>pfm_documentation_url</key>
	<string>https://s3.amazonaws.com/sqwarq.com/AppCasts/DetectX_Swift_User_Guide.pdf</string>
	<key>pfm_domain</key>
	<string>com.sqwarq.DetectX-Swift</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2018-11-27T16:23:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures DetectX Swift settings</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>DetectX Swift</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.sqwarq.DetectX-Swift</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.sqwarq.DetectX-Swift</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Updates</string>
				<string>Search</string>
				<string>Folder Observer</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>General</key>
				<array>
					<string>BrandedText</string>
				</array>
				<key>Updates</key>
				<array>
					<string>SUAutomaticallyUpdate</string>
					<string>SUEnableAutomaticChecks</string>
					<string>SUScheduledCheckInterval</string>
					<string>SUFeedURL</string>
					<string>VisualUpdates</string>
				</array>
				<key>Folder Observer</key>
				<array>
					<string>folderObserver</string>
					<string>ignoreKeywords</string>
					<string>FobWhitelist</string>
					<string>ObserverTitle</string>
					<string>ObserverMessage</string>
					<string>ObserverButton</string>
					<string>ObserverIcon</string>
				</array>
				<key>Search</key>
				<array>
					<string>whitelist</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.04</string>
			<key>pfm_description</key>
			<string>Display organizational branding. Maximum of 25 characters in length - including spaces and punctuation. Requires DetectX Swift to be registered.</string>
			<key>pfm_description_reference</key>
			<string>When set to false, DetectX Swift will not automatically check for software updates.</string>
			<key>pfm_name</key>
			<string>BrandedText</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>YOUR ORG NAME HERE</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.04</string>
			<key>pfm_description</key>
			<string>Registered users can specify key words to be ignored by the Folder Observer action when changes are made to the LaunchDaemons and LaunchAgents folders. This allows you to stop the alert from being thrown when items whose file name contains the key word is added or removed from one of the Launch folders.</string>
			<key>pfm_description_reference</key>
			<string>If set to true, enables the ability to add an array of strings of desired key words to be ignored by Folder Observer.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ignoreKeywords</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.04</string>
			<key>pfm_description</key>
			<string>Array of strings of key words to be ignored by Folder Observer.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ignoreKeywords</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>ignoreKeywords</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>FobWhitelist</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Array of strings</string>
					<key>pfm_name</key>
					<string>FobWhitelistItem</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Folder Observer notifies users when changes are made to the LaunchDaemons and LaunchAgents folders.</string>
			<key>pfm_description_reference</key>
			<string>If set to an integer of 1, enables Folder Observer.</string>
			<key>pfm_name</key>
			<string>folderObserver</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Disable Folder Observer</string>
				<string>Enable Folder Observer</string>
			</array>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.03</string>
			<key>pfm_description</key>
			<string>Custom button text for the Folder Observer alert. Requires DetectX Swift to be registered.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ObserverButton</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Folder Observer Button Text</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.03</string>
			<key>pfm_description</key>
			<string>Path to custom image for the Folder Observer alert. By default, shows the DetectX Swift icon. Requires DetectX Swift to be registered.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ObserverIcon</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Applications/Utilities/DetectX Swift.app/Contents/Resources/AppIcon.icns</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.03</string>
			<key>pfm_description</key>
			<string>Custom message for the Folder Observer alert. Requires DetectX Swift to be registered.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ObserverMessage</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Folder Observer Alert Message</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.03</string>
			<key>pfm_description</key>
			<string>Custom title for the Folder Observer alert. Requires DetectX Swift to be registered.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ObserverTitle</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Folder Observer Alert Title</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Automatically download available updates for DetectX Swift. When combined with SUEnableAutomaticChecks, DetectX Swift will automatically check and download these updates. Updates are subsequently installed when the user quits the app.</string>
			<key>pfm_description_reference</key>
			<string>When set to false, DetectX Swift will not automatically download software updates.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>SUEnableAutomaticChecks</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>SUAutomaticallyUpdate</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Automatically check for DetectX Swift software updates.</string>
			<key>pfm_description_reference</key>
			<string>When set to false, DetectX Swift will not automatically check for software updates.</string>
			<key>pfm_name</key>
			<string>SUEnableAutomaticChecks</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Sparkle update framework key. While automatic update checks can be disabled via the SUEnableAutomaticChecks key, this does not prevent users from manually running a software update check via the GUI. Setting this key to a non-existant local address will prevent users from manually triggering and/or installing updates themselves.</string>
			<key>pfm_description_reference</key>
			<string>When set to a non-existant local address, DetectX Swift will be unable to determine if updates are available.</string>
			<key>pfm_name</key>
			<string>SUFeedURL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>http://127.0.0.1</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Frequency to complete automatic software update checks.</string>
			<key>pfm_name</key>
			<string>SUScheduledCheckInterval</string>
			<key>pfm_range_list</key>
			<array>
				<real>3600</real>
				<real>86400</real>
				<real>604800</real>
				<real>2629800</real>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Hourly</string>
				<string>Daily</string>
				<string>Weekly</string>
				<string>Monthly</string>
			</array>
			<key>pfm_type</key>
			<string>real</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.04</string>
			<key>pfm_description</key>
			<string>In the DetectX Swift GUI, display a visual button to indicate software updates are available.</string>
			<key>pfm_description_reference</key>
			<string>When set to an integer value of 0, DetectX Swift will not show the visual update button.</string>
			<key>pfm_name</key>
			<string>VisualUpdates</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Disable Visual Updates</string>
				<string>Enable Visual Updates</string>
			</array>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Whitelist of file paths that produce false positives in DetectX Swift. Can be full path or in users' home folders.</string>
			<key>pfm_name</key>
			<string>whitelist</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Array of dictionaries.</string>
					<key>pfm_name</key>
					<string>WhitelistDictionary</string>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Paths of files to whitelist:
ex. /Library/Scripts/script.sh
ex. ~/Library/Preferences/preference.plist</string>
							<key>pfm_name</key>
							<string>path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>DetectX Swift</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
