<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_documentation_url</key>
	<string>https://docs.jamf.com/jamf-connect/administrator-guide/index.html</string>
	<key>pfm_app_url</key>
	<string>https://docs.jamf.com/jamf-connect</string>
	<key>pfm_description</key>
	<string>Jamf Connect Sync Settings</string>
	<key>pfm_domain</key>
	<string>com.jamf.connect.sync</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2019-09-17T08:52:30Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Jamf Connect Sync settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Jamf Connect Sync</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.jamf.connect.sync</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.jamf.connect.sync</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		
		<!-- Custom Keys -->
		
		
		
		<dict>
			<key>pfm_default</key>
			<string>yourcompany.okta.com</string>
			<key>pfm_description_reference</key>
			<string>Specifies your Okta authentication domain
Note: A Preceding "https:" is not required.</string>
			<key>pfm_description</key>
			<string>Specifies your Okta authentication domain.</string>
			<key>pfm_require</key>
			<true/>
			<key>pfm_name</key>
			<string>AuthServer</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_note</key>
			<string>A Preceding "https:" is not required.</string>
		</dict>
		
		
		
		<!-- Segmented Control -->
		
		
		
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Password Sync</string>
				<string>Password Change</string>
				<string>Kerberos/AD</string>
				<string>Menu</string>
				<string>SignIn Window</string>
				<string>Web Extensions</string>
				<string>Certificates</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>General</key>
				<array>
					<string>LicenseFile</string>
					<string>PeriodicUpdateTime</string>
					<string>SignInCommand</string>
					<string>DontShowWelcome</string>
				</array>
				<key>Password Sync</key>
				<array>
					<string>UseKeychain</string>
					<string>LocalPasswordSync</string>
					<string>LocalPasswordSyncOnMatchOnly</string>
					<string>LocalPasswordSyncMessage</string>
					<string>PasswordCheckUpdateTime</string>
					<string>KeychainItems</string>
					<string>KeychainItemsInternet</string>
					<string>KeychainItemsDebug</string>
				</array>
				<key>Password Change</key>
				<array>
					<string>PFC_SegmentedControl_Password</string>
					<string>ChangePasswordTimer</string>
					<string>ChangePasswordOrder</string>
					<string>ExpirationWarningDays</string>
					<string>PasswordExpirationMenu</string>
					<string>PasswordExpirationMenuDays</string>
					<string>ADExpirationShow</string>
					<string>WarnOnPasswordExpiration</string>
					<string>PasswordChangeCommand</string>
					<string>PasswordPolicy</string>
					<string>MessagePasswordChangePolicy</string>
				</array>
				<key>Kerberos/AD</key>
				<array>
					<string>KerberosRealm</string>
					<string>TicketsOnSignIn</string>
					<string>KerberosRenew</string>
					<string>KerberosShortNameAsk</string>
					<string>KerberosShortNameAskMessage</string>
					<string>KerberosShortName</string>
					<string>IgnoreDomainReachability</string>
					<string>LDAPServers</string>
				</array>
				<key>Menu</key>
				<array>
					<string>MenuIcon</string>
					<string>PFC_SegmentedControl_Menu</string>
					<string>ActionsUpdateTime</string>
					<string>GetHelpType</string>
					<string>GetHelpOptions</string>
					<string>SelfServicePath</string>
					<string>HideAbout</string>
					<string>HideGetSoftware</string>
					<string>HidePreferences</string>
					<string>HideLockScreen</string>
					<string>HideQuit</string>
					<string>HideSignIn</string>
					<string>HideActions</string>
					<string>HideChangePassword</string>
					<string>HideGetHelp</string>
					<string>MenuAbout</string>
					<string>MenuActions</string>
					<string>MenuChangePassword</string>
					<string>MenuSignIn</string>
					<string>MenuPreferences</string>
					<string>MenuGetSoftware</string>
					<string>MenuLockScreen</string>
					<string>MenuGetHelp</string>
				</array>
				<key>SignIn Window</key>
				<array>
					<string>CenterSignIn</string>
					<string>UseKeychainPrompt</string>
					<string>UseKeychainPromptExlusions</string>
					<string>CenterSignIn</string>
					<string>SignInLogo</string>
					<string>TitleSignIn</string>
					<string>LabelUsername</string>
					<string>LabelPassword</string>
				</array>
				<key>Web Extensions</key>
				<array>
					<string>AutoAuth</string>
					<string>CheckSafariExtension</string>
					<string>MessagePluginDisabled</string>
				</array>
				<key>Certificates</key>
				<array>
					<string>GetCertificateAutomatically</string>
					<string>X509CA</string>
					<string>Template</string>
					<string>ExportableKey</string>
					<string>WifiNetworks</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		
		
		<!-- General -->
		
		
		
		<dict>
			<key>pfm_allowed_file_types</key>
			<array>
				<string>jamfconnectlicense</string>
			</array>
			<key>pfm_description</key>
			<string>The contents of a .jamfconnectlicense file encoded in Base64 data format.</string>
			<key>pfm_name</key>
			<string>LicenseFile</string>
			<key>pfm_type</key>
			<string>data</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>15</integer>
			<key>pfm_description</key>
			<string>Specifies the interval, in minutes, between background updates.</string>
			<key>pfm_name</key>
			<string>PeriodicUpdateTime</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>minutes</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies a script or other binary to be run after a successful sign in.</string>
			<key>pfm_name</key>
			<string>SignInCommand</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/usr/local/bin/signin.bash</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Jamf Connect Sync splash screen on launch.</string>
			<key>pfm_name</key>
			<string>DontShowWelcome</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		
		
		
		<!-- Password Sync -->
		
		
		
		<dict>
			<key>pfm_description_reference</key>
			<string>Determines whether the Okta password is stored in the user’s Keychain.</string>
			<key>pfm_name</key>
			<string>UseKeychain</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Determines if the Okta password is synchronized with the local account.</string>
			<key>pfm_name</key>
			<string>LocalPasswordSync</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Syncs the password only if the Okta account name matches the local account name.</string>
			<key>pfm_name</key>
			<string>LocalPasswordSyncOnMatchOnly</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Please enter your local user account password.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the alert dialog text displayed to the user when asked to enter in their local password.</string>
			<key>pfm_name</key>
			<string>LocalPasswordSyncMessage</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>15</integer>
			<key>pfm_description_reference</key>
			<string>Specifies the interval, in minutes, that Jamf Connect Sync checks the local password for synchronization. If unspecified, Jamf Connect Sync will check every 15 minutes by default.
Note: To use PasswordCheckUpdateTime, the LocalPasswordSync key must be set to true.</string>
			<key>pfm_description</key>
			<string>Specifies the interval, in minutes, that Jamf Connect Sync checks the local password for synchronization. If unspecified, Jamf Connect Sync will check every 15 minutes by default.</string>
			<key>pfm_name</key>
			<string>PasswordCheckUpdateTime</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>LocalPasswordSync</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Determines what keychain items are updated when the user's local password is updated
Note: To use the KeychainItems key, the UseKeychain key must be set to true.</string>
			<key>pfm_description</key>
			<string>Determines which keychain items Jamf Connect Sync should synchronize with the local password.</string>
			<key>pfm_name</key>
			<string>KeychainItems</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>{{key}}</string>
					<key>pfm_title</key>
					<string>Keychain Item</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>Exchange</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>{{value}}</string>
					<key>pfm_title</key>
					<string>Account</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>&lt;&lt;shortname&gt;&gt;@&lt;&lt;domain&gt;&gt;.onmicrosoft.com</string>
				</dict>
			</array>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>UseKeychain</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Determines which internet accounts Jamf Connect Sync should synchronize with the local password.
Note: To use the KeyChainItemsInternet key, the UseKeychain and LocalPasswordSync keys must be set to true.</string>
			<key>pfm_description</key>
			<string>Determines which internet accounts Jamf Connect Sync should synchronize with the local password.</string>
			<key>pfm_name</key>
			<string>KeychainItemsInternet</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>{{key}}</string>
					<key>pfm_title</key>
					<string>Keychain Item</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>Exchange</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>{{value}}</string>
					<key>pfm_title</key>
					<string>Account</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>&lt;&lt;shortname&gt;&gt;@&lt;&lt;domain&gt;&gt;.onmicrosoft.com</string>
				</dict>
			</array>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>LocalPasswordSync</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>UseKeychain</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description_reference</key>
			<string>Updates keychain items on every sign in. Used for debugging.</string>
			<key>pfm_name</key>
			<string>KeychainItemsDebug</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		
		
		
		<!-- Password Change -->
		
		
		
		<dict>
			<key>pfm_description_reference</key>
			<string>Displays the password expiration date beneath the user's name in the menu bar.</string>
			<key>pfm_name</key>
			<string>ADExpirationShow</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Determines whether Jamf Connect Sync should warn the user on sign in if the password is about to expire.</string>
			<key>pfm_name</key>
			<string>WarnOnPasswordExpiration</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>5</integer>
			<key>pfm_description_reference</key>
			<string>Specifies an integer, in days, for Jamf Connect Sync to send notifications via the Notification Center for an upcoming password expiration.</string>
			<key>pfm_name</key>
			<string>ExpirationWarningDays</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Determines if the countdown before password expiration is displayed in the menu bar.</string>
			<key>pfm_name</key>
			<string>PasswordExpirationMenu</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>15</integer>
			<key>pfm_description_reference</key>
			<string>An integer, in days remaining, before the password expiration countdown is displayed in the menu bar
Note: To use the PasswordExpirationMenuDays key, the PasswordExpirationMenu key must be set to true.</string>
			<key>pfm_description</key>
			<string>An integer, in days remaining, before the password expiration countdown is displayed in the menu bar.</string>
			<key>pfm_name</key>
			<string>PasswordExpirationMenuDays</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>PasswordExpirationMenu</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>3</integer>
			<key>pfm_description</key>
			<string>Specifies an interval, in minutes, until the user is prompted to sign in again after a password change.</string>
			<key>pfm_name</key>
			<string>ChangePasswordTimer</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>minutes</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Determines the order and setting for the password change menu. If unspecified, Okta is used by default for password changes. If Kerberos is enabled, Jamf Connect Sync will use Kerberos to authenticate to your Active Directory domain, and then authenticate to Okta.
Note: This key is an array of dictionaries.</string>
			<key>pfm_description</key>
			<string>Determines the order and setting for the password change menu. If unspecified, Okta is used by default for password changes. If Kerberos is enabled, Jamf Connect Sync will use Kerberos to authenticate to your Active Directory domain, and then authenticate to Okta.</string>
			<key>pfm_name</key>
			<string>ChangePasswordOrder</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_title</key>
							<string></string>
							<key>pfm_name</key>
							<string>{{key}}</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_title</key>
							<string></string>
							<key>pfm_name</key>
							<string>{{value}}</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>ChangePasswordItem</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies a script or other binary to be run after the user changes a password.</string>
			<key>pfm_name</key>
			<string>PasswordChangeCommand</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/usr/local/bin/change.sh</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Defines the password complexity policy for changing the password via Kerberos.</string>
			<key>pfm_name</key>
			<string>PasswordPolicy</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_format</key>
					<string>^[0-9]+$</string>
					<key>pfm_name</key>
					<string>minLength</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_type_input</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>6</string>
				</dict>
				<dict>
					<key>pfm_format</key>
					<string>^[0-9]+$</string>
					<key>pfm_name</key>
					<string>minLowerCase</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_type_input</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>2</string>
				</dict>
				<dict>
					<key>pfm_format</key>
					<string>^[0-9]+$</string>
					<key>pfm_name</key>
					<string>minNumber</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_type_input</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>2</string>
				</dict>
				<dict>
					<key>pfm_format</key>
					<string>^[0-9]+$</string>
					<key>pfm_name</key>
					<string>minSymbol</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_type_input</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>1</string>
				</dict>
				<dict>
					<key>pfm_format</key>
					<string>^[0-9]+$</string>
					<key>pfm_name</key>
					<string>minUpperCase</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_type_input</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>2</string>
				</dict>
				<dict>
					<key>pfm_format</key>
					<string>^[0-9]+$</string>
					<key>pfm_name</key>
					<string>minMatches</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_type_input</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>3</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Please review the employee handbook.</string>
			<key>pfm_description_reference</key>
			<string>Text displayed to users that communicates the authentication domain's password complexity policy when changing a password via Kerberos.</string>
			<key>pfm_name</key>
			<string>MessagePasswordChangePolicy</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		
		
		<!-- Kerberos/AD -->
		
		
		
		<dict>
			<key>pfm_description_reference</key>
			<string>Specifies the Kerberos realm used to get Kerberos tickets.</string>
			<key>pfm_name</key>
			<string>KerberosRealm</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>example.realm</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Determines if Jamf Connect Sync retrieves Kerberos Tickets on sign in.</string>
			<key>pfm_name</key>
			<string>TicketsOnSignIn</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Determines if the Kerberos tickets should be renewed or not.</string>
			<key>pfm_name</key>
			<string>KerberosRenew</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>joel</string>
			<key>pfm_description_reference</key>
			<string>The shortname to use for Kerberos tickets. If unspecified, the user's sign in name is used.</string>
			<key>pfm_name</key>
			<string>KerberosShortName</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Determines if the user is asked to enter their Kerberos short name on first sign in.</string>
			<key>pfm_name</key>
			<string>KerberosShortNameAsk</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Please enter your Active Directory user name.</string>
			<key>pfm_description_reference</key>
			<string>The message displayed to users when requesting their Kerberos short name.</string>
			<key>pfm_name</key>
			<string>KerberosShortNameAskMessage</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Determines if SRV record lookups are used to determine if the Active Directory domain is accessible.</string>
			<key>pfm_name</key>
			<string>IgnoreDomainReachability</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies domain controllers to use for Active Directory lookups.</string>
			<key>pfm_name</key>
			<string>LDAPServers</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>LDAPServer</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>dc1.nomad.local</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		
		
		
		<!-- Menu -->
		
		
		
		<dict>
			<key>pfm_value_placeholder</key>
			<string>/usr/local/images/icon.png</string>
			<key>pfm_description_reference</key>
			<string>Path to the menu bar icon image
Note: A 16x16 pixel image is recommended.</string>
			<key>pfm_description</key>
			<string>Path to the menu bar icon image.</string>
			<key>pfm_name</key>
			<string>MenuIcon</string>
			<key>pfm_note</key>
			<string>A 16x16 pixel image is recommended.</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		
		
		<!-- Menu - Segmented Control -->
		
		
		
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_Menu</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Menu Items</string>
				<string>Menu Titles</string>
				<string>Actions</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Actions</key>
				<array>
					<string>ActionsUpdateTime</string>
					<string>GetHelpType</string>
					<string>GetHelpOptions</string>
					<string>SelfServicePath</string>
				</array>
				<key>Menu Items</key>
				<array>
					<string>HideAbout</string>
					<string>HideActions</string>
					<string>HideChangePassword</string>
					<string>HideGetHelp</string>
					<string>HideGetSoftware</string>
					<string>HideLockScreen</string>
					<string>HidePreferences</string>
					<string>HideSignIn</string>
					<string>HideQuit</string>
				</array>
				<key>Menu Titles</key>
				<array>
					<string>MenuAbout</string>
					<string>MenuActions</string>
					<string>MenuChangePassword</string>
					<string>MenuGetHelp</string>
					<string>MenuGetSoftware</string>
					<string>MenuLockScreen</string>
					<string>MenuPreferences</string>
					<string>MenuSignIn</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		
		
		<!-- Menu - Menu Items -->
		
		
		
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the About menu item.</string>
			<key>pfm_name</key>
			<string>HideAbout</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Actions menu item.</string>
			<key>pfm_name</key>
			<string>HideActions</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Change Password menu item.</string>
			<key>pfm_name</key>
			<string>HideChangePassword</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Get Help menu item.</string>
			<key>pfm_name</key>
			<string>HideGetHelp</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Get Software menu item.</string>
			<key>pfm_name</key>
			<string>HideGetSoftware</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Lock Screen menu item
Note: On macOS 10.14 or later, the Lock Screen is hidden by default in Jamf Connect Sync.</string>
			<key>pfm_description</key>
			<string>Hides the Lock Screen menu item.</string>
			<key>pfm_name</key>
			<string>HideLockScreen</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_note</key>
			<string>On macOS 10.14 or later, the Lock Screen menu item is hidden by default.</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Preferences menu item.</string>
			<key>pfm_name</key>
			<string>HidePreferences</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Quit menu item.</string>
			<key>pfm_name</key>
			<string>HideQuit</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Sign In menu item.</string>
			<key>pfm_name</key>
			<string>HideSignIn</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		
		
		
		<!-- Menu - Menu Titles -->
		
		
		
		<dict>
			<key>pfm_default</key>
			<string>This app</string>
			<key>pfm_description_reference</key>
			<string>Menu item text for the About item.</string>
			<key>pfm_name</key>
			<string>MenuAbout</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideAbout</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Quick Actions</string>
			<key>pfm_description_reference</key>
			<string>Menu item text for the Actions item.</string>
			<key>pfm_name</key>
			<string>MenuActions</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideActions</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Change network password</string>
			<key>pfm_description_reference</key>
			<string>Menu item text for the Change Password item.</string>
			<key>pfm_name</key>
			<string>MenuChangePassword</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideChangePassword</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>File ticket</string>
			<key>pfm_description_reference</key>
			<string>Menu item text for the Get Help item.</string>
			<key>pfm_name</key>
			<string>MenuGetHelp</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideGetHelp</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Get Apps</string>
			<key>pfm_description_reference</key>
			<string>Menu item text for the Get Software item.</string>
			<key>pfm_name</key>
			<string>MenuGetSoftware</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideGetSoftware</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Screen Lock</string>
			<key>pfm_description_reference</key>
			<string>Menu item text for the Lock Screen item.</string>
			<key>pfm_name</key>
			<string>MenuLockScreen</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideLockScreen</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Settings</string>
			<key>pfm_description_reference</key>
			<string>Menu item text for the Preferences item.</string>
			<key>pfm_name</key>
			<string>MenuPreferences</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HidePreferences</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Login</string>
			<key>pfm_description_reference</key>
			<string>Menu item text for the Sign In item.</string>
			<key>pfm_name</key>
			<string>MenuSignIn</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideSignIn</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		
		
		
		<!-- Menu - Actions -->
		
		
		
		<dict>
			<key>pfm_default</key>
			<integer>15</integer>
			<key>pfm_description_reference</key>
			<string>Specifies an interval, in minutes, between setting and updating the Actions menu item. If unset, the default value is 15 minutes..</string>
			<key>pfm_name</key>
			<string>ActionsUpdateTime</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>minutes</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Determines which GetHelp type is used.
Note: Bomgar, URL and App are supported.</string>
			<key>pfm_description</key>
			<string>Determines which GetHelp type is used.</string>
			<key>pfm_name</key>
			<string>GetHelpType</string>
			<key>pfm_range_list</key>
			<array>
				<string>Bomgar</string>
				<string>URL</string>
				<string>App</string>
			</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Specifies the URL or path for GetHelpType. &lt;&lt;serial&gt;&gt;, &lt;&lt;fullname&gt;&gt;, &lt;&lt;shortname&gt;&gt; and &lt;&lt;domain&gt;&gt; are supported as substitutions
Note: The GetHelpType key must be specified.</string>
			<key>pfm_description</key>
			<string>Specifies the URL or path for GetHelpType. &lt;&lt;serial&gt;&gt;, &lt;&lt;fullname&gt;&gt;, &lt;&lt;shortname&gt;&gt; and &lt;&lt;domain&gt;&gt; are supported as substitutions.</string>
			<key>pfm_name</key>
			<string>GetHelpOptions</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Applications/Google Chrome.app</string>
			<key>pfm_substitution_variables</key>
			<dict>
				<key>&lt;&lt;serial&gt;&gt;</key>
				<dict>
					<key>pfm_description</key>
					<string>Serial Number of the device.</string>
					<key>pfm_value_placeholder</key>
					<string>C02LL3M2FH01</string>
					<key>pfm_substitution_source</key>
					<string>local</string>
				</dict>
				<key>&lt;&lt;fullname&gt;&gt;</key>
				<dict>
					<key>pfm_description</key>
					<string>Full Name of the current user.</string>
					<key>pfm_value_placeholder</key>
					<string>John Doe</string>
					<key>pfm_substitution_source</key>
					<string>local</string>
				</dict>
				<key>&lt;&lt;shortname&gt;&gt;</key>
				<dict>
					<key>pfm_description</key>
					<string>Shortname of the current user.</string>
					<key>pfm_value_placeholder</key>
					<string>johndoe</string>
					<key>pfm_substitution_source</key>
					<string>local</string>
				</dict>
				<key>&lt;&lt;domain&gt;&gt;</key>
				<dict>
					<key>pfm_description</key>
					<string>AD Domain.</string>
					<key>pfm_value_placeholder</key>
					<string>example.com</string>
					<key>pfm_substitution_source</key>
					<string>local</string>
				</dict>
			</dict>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>GetHelpType</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Specifies the file path for a Self Service application not found automatically.</string>
			<key>pfm_name</key>
			<string>SelfServicePath</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Applications/Your.app</string>
		</dict>
		
		
		
		<!-- SignIn Window-->
		
		
		
		<dict>
			<key>pfm_description_reference</key>
			<string>Displays the Sign In window on launch
Note: If the the user has a password in the keychain, the sign in window will not launch.</string>
			<key>pfm_description</key>
			<string>Displays the Sign In window on launch.</string>
			<key>pfm_name</key>
			<string>UseKeychainPrompt</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_note</key>
			<string>If the the user has a password in the keychain, the sign in window will not launch.</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>List of users that can ignore the keychain prompt.</string>
			<key>pfm_name</key>
			<string>UseKeychainPromptExlusions</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>Username</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Ensures the Sign In window is always centered on the user's screen.</string>
			<key>pfm_name</key>
			<string>CenterSignIn</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Specifies the path to image file used as a logo.
Note: A 342 x 90 pixel image is recommended.</string>
			<key>pfm_description</key>
			<string>Specifies the path to image file used as a logo.</string>
			<key>pfm_name</key>
			<string>SignInLogo</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/usr/local/logo.png</string>
			<key>pfm_note</key>
			<string>A 342 x 90 pixel image is recommended.</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Corporate e-mail</string>
			<key>pfm_description_reference</key>
			<string>The text label for the username field in the Sign In window.</string>
			<key>pfm_name</key>
			<string>LabelUsername</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Corporate Password</string>
			<key>pfm_description_reference</key>
			<string>The text label for the password field in the Sign In window.</string>
			<key>pfm_name</key>
			<string>LabelPassword</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Sign in to Okta</string>
			<key>pfm_description_reference</key>
			<string>Specifies the title of the Sign In window.</string>
			<key>pfm_name</key>
			<string>TitleSignIn</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		
		
		<!-- Web Extensions -->
		
		
		
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description_reference</key>
			<string>Determines if web extensions automatically authenticate via the Jamf Connect Sync UI.</string>
			<key>pfm_name</key>
			<string>AutoAuth</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description_reference</key>
			<string>Determines if an alert displays to users when the Jamf Connect Sync Safari extension is disabled.</string>
			<key>pfm_name</key>
			<string>CheckSafariExtension</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Please enable the plugin in Safari.</string>
			<key>pfm_description_reference</key>
			<string>Text displayed to users when the Safari plugin is not enabled
Note: The CheckSafariExtension key must be set to true.</string>
			<key>pfm_description</key>
			<string>Text displayed to users when the Safari plugin is not enabled.</string>
			<key>pfm_name</key>
			<string>MessagePluginDisabled</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>CheckSafariExtension</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		
		
		
		<!-- Certificates -->
		
		
		
		<dict>
			<key>pfm_description_reference</key>
			<string>Enables Jamf Connect Sync to get a certificate from a Windows web certificate authority (CA) automatically on login.</string>
			<key>pfm_name</key>
			<string>GetCertificateAutomatically</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Specifies the URL of the Windows web CA for Jamf Connect Sync to use for certificates.</string>
			<key>pfm_name</key>
			<string>X509CA</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>dc1.nomad.test</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>User Auth</string>
			<key>pfm_description_reference</key>
			<string>Certificate template from a Windows web CA.</string>
			<key>pfm_name</key>
			<string>Template</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Allows the private key of the user certificate to be exported.</string>
			<key>pfm_name</key>
			<string>ExportableKey</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>A list of wireless networks to associate with the certificate Jamf Connect Sync created.</string>
			<key>pfm_name</key>
			<string>WifiNetworks</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>SSID</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		
		
		
	</array>
	<key>pfm_title</key>
	<string>Jamf Connect Sync</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>