<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://docs.citrix.com/en-us/receiver/mac</string>
	<key>pfm_description</key>
	<string>Citrix Receiver</string>
	<key>pfm_documentation_url</key>
	<string>https://docs.citrix.com/en-us/receiver/mac/current-release/configure.html</string>
	<key>pfm_domain</key>
	<string>com.citrix.receiver.nomas</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-08-15T08:00:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Citrix Receiver settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Citrix Receiver</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.citrix.receiver.nomas</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.citrix.receiver.nomas</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile.
The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Used to configure Citrix Receiver Updates state.</string>
			<key>pfm_description_reference</key>
			<string>Used to configure Citrix Receiver Updates state. Supported values:
Auto: Citrix Receiver Updates set to check for updates automatically.
Manual: Citrix Receiver Updates set to be check by User. No automatic checking for update.
FollowSF: Citrix Receiver Updates check are as per policy set by Administrator on Storefront.
Disabled: Citrix Receiver Updates disabled for Clients.</string>
			<key>pfm_name</key>
			<string>AutoUpdateState</string>
			<key>pfm_range_list</key>
			<array>
				<string>Auto</string>
				<string>Manual</string>
				<string>FollowSF</string>
				<string>Disabled</string>
			</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Used to configure the Updates rollout period.</string>
			<key>pfm_description_reference</key>
			<string>Used to configure the Updates rollout period. 0 corresponds to Fast, 4 corresponds to Medium and 9 corresponds to Slow.</string>
			<key>pfm_name</key>
			<string>AutoUpdateRollOutBucketIndex</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>4</integer>
				<integer>9</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Fast</string>
				<string>Medium</string>
				<string>Slow</string>
			</array>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>PreferH264HardwareDecoder</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>PreferFFMPEGDecoder</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>MenuBarAutoShowDelayEnabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>MenuBarAutoShowDelay</string>
			<key>pfm_type</key>
			<string>real</string>
			<key>pfm_value_unit</key>
			<string>Seconds</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>UDPStackParameters</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>HockeySDKAutomaticallySendCrashReports</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>HockeySDKCrashReportActivated</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>TraceOn</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>DisplaySplashScreen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>BITApplicationWasLaunched</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>CEIPEnabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>PreferMetalRendering</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disables Enlightened Data Transport (EDT).</string>
			<key>pfm_description_reference</key>
			<string>By default, EDT is enabled in Citrix Receiver for Mac. Citrix Receiver for Mac reads the EDT settings as set in the default.ica file and applies it accordingly. To disable EDT, run the following command in a terminal: defaults write com.citrix.receiver.nomas HDXOverUDPAllowed -bool NO</string>
			<key>pfm_name</key>
			<string>HDXOverUDPAllowed</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allows the use of non-HTTP(S) URLs</string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>LegacyPublishedContentEnabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>80</integer>
			<key>pfm_description</key>
			<string>Configures the greyscale brightness used for an inactive session. 100 = transparent, 0 = black</string>
			<key>pfm_description_reference</key>
			<string>You can alter the greyscale brightness used for an inactive session using a command prompt. By default, this value is set to 80. The maximum value cannot exceed 100 (indicates a transparent window) and the minimum value can be set to 0 (a fully blacked out screen).</string>
			<key>pfm_name</key>
			<string>NetDisruptBrightness</string>
			<key>pfm_range_max</key>
			<integer>100</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>FIPS</string>
			<key>pfm_description</key>
			<string>Sets the security compliance mode for the policy. If you don't configure SecurityComplianceMode, FIPS is used as the default value.</string>
			<key>pfm_description_reference</key>
			<string>Sets the security compliance mode for the policy. If you don't configure SecurityComplianceMode, FIPS is used as the default value.</string>
			<key>pfm_name</key>
			<string>SecurityComplianceMode</string>
			<key>pfm_range_list</key>
			<array>
				<string>None</string>
				<string>FIPS</string>
				<string>SP800-52</string>
			</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This setting specifies the TLS protocol versions that should be accepted during protocol negotiation. This information is represented as an array and any combination of the possible values is supported. When this setting is not configured, the values TLS10, TLS11 and TLS12 are used as the default values. </string>
			<key>pfm_description_reference</key>
			<string>This setting specifies the TLS protocol versions that should be accepted during protocol negotiation. This information is represented as an array and any combination of the possible values is supported. When this setting is not configured, the values TLS10, TLS11 and TLS12 are used as the default values. </string>
			<key>pfm_name</key>
			<string>SecurityAllowedTLSVersions</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_range_list</key>
					<array>
						<string>TLS10</string>
						<string>TLS11</string>
						<string>TLS12</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>TLS 1.0</string>
						<string>TLS 1.1</string>
						<string>TLS 1.2</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_type_input</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>FullAccessCheck</string>
			<key>pfm_description</key>
			<string>This setting governs how a given trusted root certificate authority is treated during an attempt to open a remote session through SSL. When you enable this setting, the client checks whether or not the server's certificate is revoked.</string>
			<key>pfm_description_reference</key>
			<string>This feature improves the cryptographic authentication of the Citrix server and improves the overall security of the SSL/TLS connections between a client and a server. This setting governs how a given trusted root certificate authority is treated during an attempt to open a remote session through SSL when using the client for OS X.

When you enable this setting, the client checks whether or not the server's certificate is revoked. There are several levels of certificate revocation list checking. For example, the client can be configured to check only its local certificate list, or to check the local and network certificate lists. In addition, certificate checking can be configured to allow users to log on only if all Certificate Revocation lists are verified.

Certificate Revocation List (CRL) checking is an advanced feature supported by some certificate issuers. It allows an administrator to revoke security certificates (invalidated before their expiry date) in the case of cryptographic compromise of the certificate private key, or simply an unexpected change in DNS name.</string>
			<key>pfm_name</key>
			<string>SSLCertificateRevocationCheckPolicy</string>
			<key>pfm_range_list</key>
			<array>
				<string>NoCheck</string>
				<string>CheckWithNoNetworkAccess</string>
				<string>FullAccessCheck</string>
				<string>FullAccessCheckAndCRLRequired</string>
				<string>FullAccessCheckAndCRLRequiredAll</string>
			</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Citrix Receiver</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>3</integer>
</dict>
</plist>
