<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string></string>
	<key>pfm_description</key>
	<string>TextEdit settings</string>
	<key>pfm_documentation_url</key>
	<string></string>
	<key>pfm_domain</key>
	<string>com.apple.TextEdit</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-08-21T10:35:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures TextEdit settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>TextEdit</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.TextEdit</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.TextEdit</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile. The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Document Settings</string>
				<string>Font</string>
				<string>Spelling &amp; Grammar</string>
				<string>Window</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Document Settings</key>
				<array>
					<string>PFC_SegmentedControl_DocSettings</string>
					<string>AddExtensionToNewPlainTextFiles</string>
					<string>DataDetectors</string>
					<string>HTMLEncoding</string>
					<string>IgnoreHTML</string>
					<string>IgnoreRichText</string>
					<string>PlainTextEncoding</string>
					<string>PlainTextEncodingForWrite</string>
					<string>PreserveDocumentWhitespace</string>
					<string>RichText</string>
					<string>ShowPageBreaks</string>
					<string>ShowRuler</string>
					<string>SmartCopyPaste</string>
					<string>SmartLinks</string>
					<string>SmartQuotes</string>
					<string>SmartSubstitutionsEnabledInRichTextOnly</string>
					<string>TextReplacement</string>
					<string>UseEmbeddedCSS</string>
					<string>UseInlineCSS</string>
					<string>UseTransitionalDocType</string>
					<string>UseXHTMLDocType</string>
					<string>author</string>
					<string>company</string>
					<string>copyright</string>
				</array>
				<key>Font</key>
				<array>
					<string>NSFixedPitchFont</string>
					<string>NSFixedPitchFontSize</string>
					<string>NSFont</string>
					<string>NSFontSize</string>
				</array>
				<key>General</key>
				<array>
					<string>NSDocumentSuppressTempVersionStoreWarning</string>
				</array>
				<key>Spelling &amp; Grammar</key>
				<array>
					<string>CheckGrammarWithSpelling</string>
					<string>CheckSpellingWhileTyping</string>
					<string>CorrectSpellingAutomatically</string>
				</array>
				<key>Window</key>
				<array>
					<string>HeightInChars</string>
					<string>WidthInChars</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_DocSettings</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Options</string>
				<string>Authorship</string>
				<string>Plain &amp; Rich Text</string>
				<string>HTML</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Authorship</key>
				<array>
					<string>author</string>
					<string>company</string>
					<string>copyright</string>
				</array>
				<key>HTML</key>
				<array>
					<string>HTMLEncoding</string>
					<string>IgnoreHTML</string>
					<string>UseEmbeddedCSS</string>
					<string>UseInlineCSS</string>
					<string>UseTransitionalDocType</string>
					<string>UseXHTMLDocType</string>
				</array>
				<key>Options</key>
				<array>
					<string>DataDetectors</string>
					<string>PreserveDocumentWhitespace</string>
					<string>ShowPageBreaks</string>
					<string>ShowRuler</string>
					<string>SmartCopyPaste</string>
					<string>SmartLinks</string>
					<string>SmartQuotes</string>
					<string>SmartSubstitutionsEnabledInRichTextOnly</string>
					<string>TextReplacement</string>
				</array>
				<key>Plain &amp; Rich Text</key>
				<array>
					<string>AddExtensionToNewPlainTextFiles</string>
					<string>IgnoreRichText</string>
					<string>PlainTextEncoding</string>
					<string>PlainTextEncodingForWrite</string>
					<string>RichText</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Set this preference to 'false' to forcibly disable adding the ".txt" extension to plain text files.</string>
			<key>pfm_name</key>
			<string>AddExtensionToNewPlainTextFiles</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>HTMLEncoding</string>
			<key>pfm_range_list</key>
			<array>
				<integer>10</integer>
				<integer>4</integer>
				<integer>30</integer>
				<integer>12</integer>
				<integer>2147483649</integer>
				<integer>2147486209</integer>
				<integer>2147483650</integer>
				<integer>2147483651</integer>
				<integer>2147483673</integer>
				<integer>2147485234</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Unicode UTF-16</string>
				<string>Unicode UTF-8</string>
				<string>Western Mac OS Roman</string>
				<string>Western Windows Latin 1</string>
				<string>Japanese Mac OS</string>
				<string>Japanese Shift JIS</string>
				<string>Traditional Chinese Mac OS</string>
				<string>Korean Mac OS</string>
				<string>Simplified Chinese Mac OS</string>
				<string>Chinese GB 18030</string>
			</array>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'false' to forcibly disable grammar checking with spelling.</string>
			<key>pfm_name</key>
			<string>CheckGrammarWithSpelling</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'false' to forcibly disable spell checking while typing.</string>
			<key>pfm_name</key>
			<string>CheckSpellingWhileTyping</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'false' to forcibly disable automatic spelling correction.</string>
			<key>pfm_name</key>
			<string>CorrectSpellingAutomatically</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'true' to forcibly enable data detectors. Data detectors can automatically detect date, time, and contact information, which can then be used to update a contact, create a new Calendar event, and more.</string>
			<key>pfm_name</key>
			<string>DataDetectors</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>By default, the Window Size height is 30 lines. Enable this setting to change this default window height.</string>
			<key>pfm_name</key>
			<string>HeightInChars</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>30</string>
			<key>pfm_value_unit</key>
			<string>lines</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'true' to display .html files as HTML code instead of formatted text when opening a file.</string>
			<key>pfm_name</key>
			<string>IgnoreHTML</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'true' to display .rtf files as RTF code instead of formatted text when opening a file.</string>
			<key>pfm_name</key>
			<string>IgnoreRichText</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'false' to suppress TextEdit messages when closing documents saved on storage volumes that don't support Apple's permanent version storage. This will not inform users about being unable to access these older versions via Time Machine.</string>
			<key>pfm_name</key>
			<string>NSDocumentSuppressTempVersionStoreWarning</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enter the name of the desired plain text font.  This defaults to Menlo.

String format: Find your desired font file in either /System/Library/Fonts or /Library/Fonts. Whatever the name of this font file is is exactly what needs to be entered for the font name. Additionally, if you desire to use a font typeset that is not the default - Plain, Regular, etc. - , you can specify this by adding the name of the typeset to end of the font name string with a hyphen inbetween.

Ex. AlBayan-Bold
Ex. AmericanTypewriter-Condensed
Ex. ArialMT</string>
			<key>pfm_name</key>
			<string>NSFixedPitchFont</string>
			<key>pfm_title</key>
			<string>Plain Text Font</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enter the desired font size for plain text documents.</string>
			<key>pfm_name</key>
			<string>NSFixedPitchFontSize</string>
			<key>pfm_title</key>
			<string>Plain Text Font Size</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>12</string>
			<key>pfm_value_unit</key>
			<string>pt</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enter the name of the desired rich text font. This defaults to Helvetica.

String format: Find your desired font file in either /System/Library/Fonts or /Library/Fonts. Whatever the name of this font file is is exactly what needs to be entered for the font name. Additionally, if you desire to use a font typeset that is not the default - Plain, Regular, etc. - , you can specify this by adding the name of the typeset to end of the font name string with a hyphen inbetween.

Ex. AlBayan-Bold
Ex. AmericanTypewriter-Condensed
Ex. ArialMT</string>
			<key>pfm_name</key>
			<string>NSFont</string>
			<key>pfm_title</key>
			<string>Rich Text Font</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enter the desired font size for rich text documents.</string>
			<key>pfm_name</key>
			<string>NSFontSize</string>
			<key>pfm_title</key>
			<string>Rich Text Font Size</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>12</string>
			<key>pfm_value_unit</key>
			<string>pt</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Set this preference to 'false' to not include code that preserves the white space in your document's formatted text.</string>
			<key>pfm_name</key>
			<string>PreserveDocumentWhitespace</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'true' to forcibly make text wrap to document margins, rather than window boundaries.</string>
			<key>pfm_name</key>
			<string>ShowPageBreaks</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'false' to not show the ruler in rich text documents by default.</string>
			<key>pfm_name</key>
			<string>ShowRuler</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'false' to forcibly disable "smart" copy/paste.</string>
			<key>pfm_name</key>
			<string>SmartCopyPaste</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'false' to forcibly disable "smart" links.</string>
			<key>pfm_name</key>
			<string>SmartLinks</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'false' to forcibly disable "smart" quotes.</string>
			<key>pfm_name</key>
			<string>SmartQuotes</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.13</string>
			<key>pfm_description</key>
			<string>Set this preference to 'true' to enable "smart" substitutions for quotes and dashes in rich text documents.  Takes effect for newly opened documents and after "Make Plain Text".</string>
			<key>pfm_name</key>
			<string>SmartSubstitutionsEnabledInRichTextOnly</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'false' to forcibly disable text replacement.</string>
			<key>pfm_name</key>
			<string>TextReplacement</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to choose a specific encoding method for opening plain text files, rather than "Automatic".</string>
			<key>pfm_name</key>
			<string>PlainTextEncoding</string>
			<key>pfm_range_list</key>
			<array>
				<integer>10</integer>
				<integer>4</integer>
				<integer>30</integer>
				<integer>12</integer>
				<integer>2147483649</integer>
				<integer>2147486209</integer>
				<integer>2147483650</integer>
				<integer>2147483651</integer>
				<integer>2147483673</integer>
				<integer>2147485234</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Unicode UTF-16</string>
				<string>Unicode UTF-8</string>
				<string>Western Mac OS Roman</string>
				<string>Western Windows Latin 1</string>
				<string>Japanese Mac OS</string>
				<string>Japanese Shift JIS</string>
				<string>Traditional Chinese Mac OS</string>
				<string>Korean Mac OS</string>
				<string>Simplified Chinese Mac OS</string>
				<string>Chinese GB 18030</string>
			</array>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to choose a specific encoding method for saving plain text files, rather than "Automatic".</string>
			<key>pfm_name</key>
			<string>PlainTextEncodingForWrite</string>
			<key>pfm_range_list</key>
			<array>
				<integer>10</integer>
				<integer>4</integer>
				<integer>30</integer>
				<integer>12</integer>
				<integer>2147483649</integer>
				<integer>2147486209</integer>
				<integer>2147483650</integer>
				<integer>2147483651</integer>
				<integer>2147483673</integer>
				<integer>2147485234</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Unicode UTF-16</string>
				<string>Unicode UTF-8</string>
				<string>Western Mac OS Roman</string>
				<string>Western Windows Latin 1</string>
				<string>Japanese Mac OS</string>
				<string>Japanese Shift JIS</string>
				<string>Traditional Chinese Mac OS</string>
				<string>Korean Mac OS</string>
				<string>Simplified Chinese Mac OS</string>
				<string>Chinese GB 18030</string>
			</array>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enable this preference to forcibly apply a default TextEdit file format. By default, TextEdit defaults to rich text - .rtf -, rather than plain text - .txt</string>
			<key>pfm_name</key>
			<string>RichText</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Plain Text</string>
				<string>Rich Text</string>
			</array>
			<key>pfm_title</key>
			<string>Text Default File Format</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enable this setting for HTML Embedded CSS styling.

ex. UseEmbeddedCSS = true == "Embedded CSS"
ex. UseEmbeddedCSS = true &amp; UseInlineCSS = false == "Embedded CSS"
ex. UseEmbeddedCSS = false &amp; UseInlineCSS = false == "No CSS"</string>
			<key>pfm_name</key>
			<string>UseEmbeddedCSS</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enable this setting for HTML Inline CSS styling.

ex. UseInlineCSS = true == "Inline CSS"
ex. UseInlineCSS = true &amp; UseEmbeddedCSS = false == "Inline CSS"
ex. UseInlineCSS = false &amp; UseEmbeddedCSS = false == "No CSS"</string>
			<key>pfm_name</key>
			<string>UseInlineCSS</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'false' to use the "Strict" HTML or XHTML document type, rather than "Transitional".

ex. UseTransiontalDocType = false &amp; UseXHTMLDocType = false == "HTML Strict"
ex. UseTransiontalDocType = false &amp; UseXHTMLDocType = true == "XHTML Strict"
ex. UseTransiontalDocType = true &amp; UseXHTMLDocType = false == "HTML Transitional"
ex. UseTransiontalDocType = true &amp; UseXHTMLDocType = true == "XHTML Transitional"</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>UseXHTMLDocType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>UseTransitionalDocType</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set this preference to 'false' to use the HTML, rather than the XHTML document type.

ex. UseTransiontalDocType = false &amp; UseXHTMLDocType = false == "HTML Strict"
ex. UseTransiontalDocType = false &amp; UseXHTMLDocType = true == "XHTML Strict"
ex. UseTransiontalDocType = true &amp; UseXHTMLDocType = false == "HTML Transitional"
ex. UseTransiontalDocType = true &amp; UseXHTMLDocType = true == "XHTML Transitional"</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>UseTransitionalDocType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>UseXHTMLDocType</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>By default, the Window Size width is 90 lines. Enable this setting to change this default window width.</string>
			<key>pfm_name</key>
			<string>WidthInChars</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>90</string>
			<key>pfm_value_unit</key>
			<string>lines</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enter a default author name for documents.</string>
			<key>pfm_name</key>
			<string>author</string>
			<key>pfm_title</key>
			<string>Default Document Author</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Author Name</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enter a default organization / company for documents.</string>
			<key>pfm_name</key>
			<string>company</string>
			<key>pfm_title</key>
			<string>Default Document Organization / Company</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Author Organization</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enter a default copyright for documents.</string>
			<key>pfm_name</key>
			<string>copyright</string>
			<key>pfm_title</key>
			<string>Default Document Copyright</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Copyright</string>
		</dict>
	</array>
	<key>pfm_title</key>
	<string>TextEdit</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>
