<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>SAP Privileges app settings</string>
	<key>pfm_documentation_url</key>
	<string>https://github.com/SAP/macOS-enterprise-privileges</string>
	<key>pfm_domain</key>
	<string>corp.sap.privileges</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2019-12-06T11:14:00Z</date>
	<key>pfm_macos_min</key>
	<string>10.12</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures SAP Privileges app settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>SAP Privileges app</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>corp.sap.privileges</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>corp.sap.privileges</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile. The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0.5</string>
			<key>pfm_description</key>
			<string>Sets a fixed timeout for the Dock tile&apos;s Toggle Privileges command. After this time, the admin rights are removed and set back to standard user rights. A value of 0 disables the timeout and allows the user to permanently toggle privileges.</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/SAP/macOS-enterprise-privileges/tree/master/application_management</string>
			<key>pfm_name</key>
			<string>DockToggleTimeout</string>
			<key>pfm_title</key>
			<string>Dock Toggle Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>0</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0.5</string>
			<key>pfm_default</key>
			<string>admin</string>
			<key>pfm_description</key>
			<string>Enforces certain privileges. Whenever Privileges.app or the PrivilegesCLI command line tool are launched,the corresponding privileges are set.</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/SAP/macOS-enterprise-privileges/tree/master/application_management</string>
			<key>pfm_name</key>
			<string>EnforcePrivileges</string>
			<key>pfm_range_list</key>
			<array>
				<string>admin</string>
				<string>user</string>
				<string>none</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Admin</string>
				<string>User</string>
				<string>None</string>
			</array>
			<key>pfm_title</key>
			<string>Enforce Privileges</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.5.0</string>
			<key>pfm_description</key>
			<string>Limits the usage of Privileges.app to the given user group.</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/SAP/macOS-enterprise-privileges/tree/master/application_management</string>
			<key>pfm_name</key>
			<string>LimitToGroup</string>
			<key>pfm_title</key>
			<string>Limit to Group</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Group</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.5.0</string>
			<key>pfm_description</key>
			<string>Limits the usage of Privileges.app to the given user account. If used with a client management system that supports variables in configuration profiles, variables like $USERNAME may be used here.</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/SAP/macOS-enterprise-privileges/tree/master/application_management</string>
			<key>pfm_name</key>
			<string>LimitToUser</string>
			<key>pfm_title</key>
			<string>Limit to User</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>User</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.5.0</string>
			<key>pfm_description</key>
			<string>If ReasonRequired is set to true, the user must provide a reason for needing admin rights. If using ReasonRequired, then the ReasonMinLength key must also be set. If setting ReasonRequired, the Toggle Privileges option is automatically disabled.</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/SAP/macOS-enterprise-privileges/tree/master/application_management</string>
			<key>pfm_name</key>
			<string>ReasonRequired</string>
			<key>pfm_title</key>
			<string>Reason Required</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
            <false/>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.5.0</string>
			<key>pfm_description</key>
			<string>The minimum number of characters the user has to enter as the reason for becoming an admin. If not set, the value defaults to 10. The text field is limited to amaximum of 100 characters, so values greater than 100 have no effect.</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/SAP/macOS-enterprise-privileges/tree/master/application_management</string>
			<key>pfm_name</key>
			<string>ReasonMinLength</string>
			<key>pfm_title</key>
			<string>Reason Minimum Length</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>10</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.5.0</string>
			<key>pfm_description</key>
			<string>A dictionary array containing the relevant server information. Please see https://tools.ietf.org/html/rfc5424#section-6.1 for further information on the options used in the SyslogOptions key.</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/SAP/macOS-enterprise-privileges/tree/master/application_management</string>
			<key>pfm_name</key>
			<string>RemoteLogging</string>
			<key>pfm_title</key>
			<string>Remote Logging</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_subkeys</key>
				<array>
				<dict>
					<key>pfm_name</key>
					<string>ServerType</string>
					<key>pfm_description</key>
					<string>The type of the logging server. This is a string value. As of now, syslog is the only supported value. Others may be supported in future releases.</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>syslog</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>ServerAddress</string>
					<key>pfm_description</key>
					<string>The address of the logging server. This will usually be an IP address, unless the syslog server is set up to respond using a DNS hostname.</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>IP_ADDRESS or HOSTNAME</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>ServerPort</string>
					<key>pfm_description</key>
					<string>This is an integer specifying the port of the logging server. By default, port 514 is used.</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>514</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>EnableTCP</string>
					<key>pfm_description</key>
					<string>This is a boolean value. If set to true, the log messages are sent via TCP instead of UDP. By default, messages are sent via UDP.</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfm_default</key>
            		<false/>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>SyslogOptions</string>
					<key>pfm_description</key>
					<string>A dictionary array containing the relevant server information</string>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>LogFacility</string>
								<key>pfm_description</key>
								<string>An integer specifying the syslog facility. If not specified, defaults to 4 (security).</string>
								<key>pfm_type</key>
								<string>integer</string>
								<key>pfm_value_placeholder</key>
								<string>4</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>LogSeverity</string>
								<key>pfm_description</key>
								<string>an integer specifying the syslog severity. If not specified, defaults to 6 (informational).</string>
								<key>pfm_type</key>
								<string>integer</string>
								<key>pfm_value_placeholder</key>
								<string>6</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>MaximumMessageSize</string>
								<key>pfm_description</key>
								<string>an integer specifying the maximum size of the  syslog message (header + event message) If not specified, the value defaults to 480 which is the minimum maximum message size a syslog server must support. If the syslog message is larger than the specified maximum, the message will be truncated at the end.</string>
								<key>pfm_type</key>
								<string>integer</string>
								<key>pfm_value_placeholder</key>
								<string>480</string>
							</dict>
						</array>
				</dict>
			</array>
			</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.5.0</string>
			<key>pfm_description</key>
			<string>Description: Requires authentication before using Privileges.app. If set to true, the logged-in user is prompted to authenticate via Touch ID or by entering their account password. If setting RequireAuthentication, the Toggle Privileges option is automatically disabled.</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/SAP/macOS-enterprise-privileges/tree/master/application_management</string>
			<key>pfm_name</key>
			<string>RequireAuthentication</string>
			<key>pfm_title</key>
			<string>Require Authentication</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
            <false/>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>SAP Privileges</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
