<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://go.ncsu.edu/confboard</string>
	<key>pfm_description</key>
	<string>ConfBoard Settings</string>
	<key>pfm_documentation_url</key>
	<string>https://go.ncsu.edu/confboard</string>
	<key>pfm_domain</key>
	<string>edu.ncsu.confboard</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2023-11-30T15:08:23Z</date>
	<key>pfm_macos_min</key>
	<string>12.0</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures ConfBoard configuration preferences</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>ConfBoard</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>edu.ncsu.confboard</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>edu.ncsu.confboard</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>https://storage.googleapis.com/confboard</string>
			<key>pfm_description</key>
			<string>The base URL to the folder containing the images.txt file or JSON information. Do NOT include trailing backslash.</string>
			<key>pfm_documentation_url</key>
			<string>https://go.ncsu.edu/confboard#h.b53vj55iw28d</string>
			<key>pfm_format</key>
			<string>^https://.*[^/]$</string>
			<key>pfm_name</key>
			<string>baseURL</string>
			<key>pfm_title</key>
			<string>URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Base URL is a JSON file or feed not text list of URIs.</string>
			<key>pfm_documentation_url</key>
			<string>https://go.ncsu.edu/confboard#h.as2mra9pviie</string>
			<key>pfm_name</key>
			<string>shouldUseJSON</string>
			<key>pfm_title</key>
			<string>Use ConfBoard JSON data file</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Show name of device on screen</string>
			<key>pfm_documentation_url</key>
			<string>https://go.ncsu.edu/confboard#h.8bfb1vc4d0zo</string>
			<key>pfm_name</key>
			<string>shouldDisplayName</string>
			<key>pfm_title</key>
			<string>Display Device Name</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>String to be added after the baseURL.  Using images.txt this adds after the baseURL and before images.txt.  Using JSON this adds after the baseURL. Can be used to specify a folder on web server with different images.txt or as ? parameter string for JSON feed. </string>
			<key>pfm_documentation_url</key>
			<string>https://go.ncsu.edu/confboard#h.8tq6r5jg8sne</string>
			<key>pfm_name</key>
			<string>groupLabel</string>
			<key>pfm_title</key>
			<string>Group Label</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>720</integer>
			<key>pfm_description</key>
			<string>Time between reloading the list of image links</string>
			<key>pfm_documentation_url</key>
			<string>https://go.ncsu.edu/confboard#h.97mek2dcu8c</string>
			<key>pfm_name</key>
			<string>reloadContentTimer</string>
			<key>pfm_range_list</key>
			<array>
				<integer>30</integer>
				<integer>60</integer>
				<integer>120</integer>
				<integer>240</integer>
				<integer>480</integer>
				<integer>720</integer>
				<integer>1440</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>30 Minutes</string>
				<string>1 Hour</string>
				<string>2 Hours</string>
				<string>4 Hours</string>
				<string>8 Hours</string>
				<string>12 Hours</string>
				<string>24 Hours</string>
			</array>
			<key>pfm_title</key>
			<string>Reload Image List Time</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>10</integer>
			<key>pfm_description</key>
			<string>Time each image will stay on screen.</string>
			<key>pfm_documentation_url</key>
			<string>https://go.ncsu.edu/confboard#h.wzrbt7u86mlv</string>
			<key>pfm_name</key>
			<string>rotateImageTimer</string>
			<key>pfm_range_list</key>
			<array>
				<integer>10</integer>
				<integer>30</integer>
				<integer>60</integer>
				<integer>120</integer>
				<integer>300</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>10 Seconds</string>
				<string>30 Seconds</string>
				<string>1 Minute</string>
				<string>2 Minutes</string>
				<string>5 Minutes</string>
			</array>
			<key>pfm_title</key>
			<string>Image Rotation Time</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>ConfBoard</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
