<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://apps.apple.com/app/tailscale/id1475387142</string>
	<key>pfm_documentation_url</key>
	<string>https://tailscale.com/kb/1315/mdm-keys/</string>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_description</key>
	<string>Configure settings for the Mac App Store variant of the Tailscale client.</string>
	<key>pfm_domain</key>
	<string>io.tailscale.ipn.macos</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-10-31T08:00:00Z</date>
	<key>pfm_title</key>
	<string>Tailscale (MAS)</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>1</integer>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Tailscale (MAS) configuration preferences</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Tailscale (MAS)</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>io.tailscale.ipn.macos</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>io.tailscale.ipn.macos</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ManagedByOrganizationName</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Organization Details: Name</string>
			<key>pfm_description</key>
			<string>Specifies the name of the organization managing Tailscale, for instance “XYZ Corp, Inc.”. The value will be displayed in the Tailscale client, so that users can easily reach your internal support resources.</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#set-your-organization-name</string>
			<key>pfm_value_placeholder</key>
			<string>XYZ Corp, Inc.</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ManagedByCaption</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Organization Details: Caption</string>
			<key>pfm_description</key>
			<string>Specifies a caption to be displayed in the Managed By view in the Tailscale client. Use this string value to provide your users with information on how to reach support resources for Tailscale in your organization.</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#set-an-info-message</string>
			<key>pfm_value_placeholder</key>
			<string>Support is available on the #tailscale channel on the company Slack.</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ManagedByURL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Organization Details: Support URL</string>
			<key>pfm_description</key>
			<string>Specifies a URL pointing to a help desk webpage, or other helpful resources for users in the organization. Clicking the Support button in the Tailscale UI will open this webpage.</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#set-a-support-url</string>
			<key>pfm_value_placeholder</key>
			<string>https://www.xyz-corp-example.com/helpdesk</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>TailscaleStartOnLogin</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_title</key>
			<string>Automatically start Tailscale when the user logs in</string>
			<key>pfm_description</key>
			<string>The first time the application is opened on a Mac, Tailscale installs a macOS login helper. This allows Tailscale to start automatically when the user logs into their account. This boolean controls whether the login helper should start Tailscale at login time.</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#automatically-start-tailscale-when-the-user-logs-in</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ForceEnabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_title</key>
			<string>Force Tailscale to always be running</string>
			<key>pfm_description</key>
			<string>When set to true, this boolean instructs Tailscale to always be connected and actively monitor the tunnel state for disconnections. The Disconnect toggle will be disabled, to prevent users from disabling the VPN themselves. An attempt to disconnect will present a banner informing the user the organization’s policy prevents Tailscale from being disconnected. If the client detects the VPN tunnel is down because the Tailscale VPN process was terminated, Tailscale will automatically restart it and reconnect. You might want to use this policy together with an always-on VPN configuration profile.</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#force-tailscale-to-always-be-running</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>Tailnet</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Suggested or required tailnet name</string>
			<key>pfm_description</key>
			<string>Specify a tailnet, and its identity provider will be used on the login page. If the policy value is prefixed with "required:"", Tailscale will force that identity provider to be used and won’t allow logging in with anything else.</string>
			<key>pfm_value_placeholder</key>
			<string>required:example.com</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#set-a-suggested-or-required-tailnet</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>LoginURL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Custom control server URL</string>
			<key>pfm_description</key>
			<string>The LoginURL policy can be used to specify a custom control server URL. This should not be changed unless you are not using the standard Tailscale server. Use this policy if you’re deploying your own server, such as Headscale.</string>
			<key>pfm_value_placeholder</key>
			<string>https://controlserver.ts.example.com</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#set-a-custom-control-server-url</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ExitNodesPicker</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Show/hide exit nodes picker</string>
			<key>pfm_description</key>
			<string>Shows or hides all UI items to choose an exit node in the Tailscale client.</string>
			<key>pfm_range_list</key>
			<array>
				<string>show</string>
				<string>hide</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Show</string>
				<string>Hide</string>
			</array>
			<key>pfm_default</key>
			<string>show</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#hide-the-exit-node-picker</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ManageTailnetLock</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Show/hide tailnet lock settings</string>
			<key>pfm_description</key>
			<string>Shows or hides the "Manage Tailnet lock" menu item.</string>
			<key>pfm_range_list</key>
			<array>
				<string>show</string>
				<string>hide</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Show</string>
				<string>Hide</string>
			</array>
			<key>pfm_default</key>
			<string>show</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#hide-the-tailnet-lock-settings</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ResetToDefaults</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Show/hide the "Reset to Defaults" menu item</string>
			<key>pfm_description</key>
			<string>Shows or hides the "Reset to Defaults" menu item.</string>
			<key>pfm_range_list</key>
			<array>
				<string>show</string>
				<string>hide</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Show</string>
				<string>Hide</string>
			</array>
			<key>pfm_default</key>
			<string>show</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#hide-the-reset-to-defaults-menu-item</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>RunExitNode</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Show/hide "Run as Exit Node" menu item</string>
			<key>pfm_description</key>
			<string>Shows or hides the "Run as Exit Node" menu item, controlling the user's ability to toggle this option.</string>
			<key>pfm_range_list</key>
			<array>
				<string>show</string>
				<string>hide</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Show</string>
				<string>Hide</string>
			</array>
			<key>pfm_default</key>
			<string>show</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#hide-the-run-as-exit-node-menu-item</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>StartOnLoginMenuItem</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Show/hide "Start on Login" menu item</string>
			<key>pfm_description</key>
			<string>Shows or hides the "Start on Login" menu item, controlling the user's ability to toggle this option.</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#hide-the-start-on-login-menu-item</string>
			<key>pfm_range_list</key>
			<array>
				<string>show</string>
				<string>hide</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Show</string>
				<string>Hide</string>
			</array>
			<key>pfm_default</key>
			<string>show</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>TestMenu</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Show/hide Debug menu</string>
			<key>pfm_description</key>
			<string>Shows or hides the debug menu in the Tailscale client. On macOS, this system policy will also hide any information displayed when holding down the Option key while clicking on the Tailscale menubar item.</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#hide-the-debug-menu</string>
			<key>pfm_range_list</key>
			<array>
				<string>show</string>
				<string>hide</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Show</string>
				<string>Hide</string>
			</array>
			<key>pfm_default</key>
			<string>show</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>Hidden network devices</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_title</key>
			<string>Hide categories of network devices</string>
			<key>pfm_description</key>
			<string>Can be used to hides one or more categories of network devices normally displayed in the Tailscale client. Administrators can choose to hide: devices owned by the current user; devices owned by other users; tagged devices. If all three options are chosen, the "Network Devices" menu item disappears entirely and users aren’t able to see any device on the tailnet.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_range_list</key>
					<array>
						<string>current-user</string>
						<string>other-users</string>
						<string>tagged-devices</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Devices belonging to the current user</string>
						<string>Devices belonging to other users</string>
						<string>Tagged devices</string>
					</array>
				</dict>
			</array>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#hide-network-devices</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>IPAddressCopiedAlertSuppressed</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_title</key>
			<string>Suppress IP Address Copied notifications</string>
			<key>pfm_description</key>
			<string>When you use the Tailscale menu bar item to copy to the Clipboard the IP address of a device, a notification displaying the IP address is presented. Use this to suppress this Copied IP address to clipboard notification.</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#suppress-ip-address-copied-notifications</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>TailscaleOnboardingSeen</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_title</key>
			<string>Suppress the first launch onboarding flow</string>
			<key>pfm_description</key>
			<string>When you start Tailscale on your Mac for the first time, an onboarding flow is presented. It explains the Tailscale privacy policy, and guides the user in setting up the VPN configuration on their Mac. You might want to disable this onboarding flow if you are going to automatically set up the VPN configuration on the system by using a configuration profile. In order to do so, this boolean suppresses the onboarding flow when Tailscale launches for the first time and the value is set to true.</string>
			<key>pfm_documentation_url</key>
			<string>https://tailscale.com/kb/1315/mdm-keys/#suppress-the-first-launch-onboarding-flow</string>
		</dict>
	</array>
</dict>
</plist>
