<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_app_url</key>
		<string>https://gitlab.com/orchardandgrove-oss/NoMADLogin-AD</string>
		<key>pfm_description</key>
		<string>NoMAD Login settings</string>
		<key>pfm_documentation_url</key>
		<string>https://gitlab.com/orchardandgrove-oss/NoMADLogin-AD/wikis/Configuration/preferences</string>
		<key>pfm_domain</key>
		<string>menu.nomad.login.ad</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_icon</key>
		<data>
		</data>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_last_modified</key>
		<date>2018-07-26T12:46:11Z</date>
		<key>pfm_subkeys</key>
		<array>
			<dict>
				<key>pfm_default</key>
				<string>Configures NoMAD Login settings</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>NoMAD Login</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>menu.nomad.login.ad</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string>menu.nomad.login.ad</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.0</string>
				<key>pfm_description</key>
				<string>Defines the AD domain you’re working with.</string>
				<key>pfm_name</key>
				<string>ADDomain</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PFC_SegmentedControl_0</string>
				<key>pfm_range_list_titles</key>
				<array>
					<string>CheckAD</string>
					<string>EULA</string>
					<string>CreateUser</string>
					<string>UserInput</string>
					<string>EnableFDE</string>
					<string>RunScript</string>
					<string>Notify</string>
					<string>KeychainAdd</string>
				</array>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_segments</key>
				<dict>
					<key>CheckAD</key>
					<array>
						<string>DenyLocal</string>
						<string>DenyLocalExcluded</string>
						<string>DenyLoginUnlessGroupMember</string>
						<string>LoginScreen</string>
						<string>LDAPOverSSL</string>
						<string>AdditionalADDomains</string>
						<string>LDAPServers</string>
						<string>UsernameFieldPlaceholder</string>
						<string>LoginLogo</string>
						<string>LoginLogoData</string>
						<string>LoginLogoAlpha</string>
						<string>BackgroundImage</string>
						<string>BackgroundImageAlpha</string>
					</array>
					<key>CreateUser</key>
					<array>
						<string>CreateAdminUser</string>
						<string>CreateAdminIfGroupMember</string>
						<string>UseCNForFullName</string>
						<string>UserProfileImage</string>
						<string>DemobilizeUsers</string>
					</array>
					<key>EULA</key>
					<array>
						<string>EULATitle</string>
						<string>EULASubTitle</string>
						<string>EULAText</string>
						<string>EULAPath</string>
					</array>
					<key>UserInput</key>
					<array>
						<string>UserInputOutputPath</string>
						<string>UserInputUI</string>
						<string>UserInputLogo</string>
						<string>UserInputTitle</string>
						<string>UserInputMainText</string>
					</array>
					<key>EnableFDE</key>
					<array>
						<string>EnableFDE</string>
						<string>EnableFDERecoveryKey</string>
						<string>EnableFDERecoveryKeyPath</string>
						<string>EnableFDERekey</string>
					</array>
					<key>RunScript</key>
					<array>
						<string>ScriptPath</string>
						<string>ScriptArgs</string>
					</array>
					<key>Notify</key>
					<array>
						<string>NotifyLogStyle</string>
					</array>
					<key>KeychainAdd</key>
					<array>
						<string>KeychainCreate</string>
						<string>KeychainAddNoMAD</string>
						<string>LastUser</string>
						<string>KeychainReset</string>
					</array>
				</dict>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			
			<!-- *** CheckAD *** -->
			
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_description_reference</key>
				<string>Determines if local user accounts are allowed to sign in, or if all auth is forced through AD.</string>
				<key>pfm_name</key>
				<string>DenyLocal</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_description_reference</key>
				<string>List of local user shortnames that will be allowed to authenticate locally instead of via AD.</string>
				<key>pfm_name</key>
				<string>DenyLocalExcluded</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_title</key>
						<string>Username</string>
						<key>pfm_type</key>
						<string>string</string>
					</dict>
				</array>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_description_reference</key>
				<string>List of AD group names. When an AD user is authenticating, only allow login if the user is a member of one of these groups.</string>
				<key>pfm_name</key>
				<string>DenyLoginUnlessGroupMember</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_title</key>
						<string>Group Name</string>
						<key>pfm_type</key>
						<string>string</string>
					</dict>
				</array>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.1.0</string>
				<key>pfm_description</key>
				<string>If set to yes, a macOS-style loginscreen will be presented instead of the NoMAD Login loginwindow style.</string>
				<key>pfm_name</key>
				<string>LoginScreen</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.0</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_description</key>
				<string>Determines if NoMAD Login uses LDAP over SSL.</string>
				<key>pfm_name</key>
				<string>LDAPOverSSL</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.2</string>
				<key>pfm_description</key>
				<string>List of domains to append at the loginwindow. If not set, the standard Managed Domain policy will apply.</string>
				<key>pfm_name</key>
				<string>AdditionalADDomains</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_app_min</key>
						<string>1.2</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_name</key>
						<string>Domain</string>
						<key>pfm_type</key>
						<string>string</string>
					</dict>
				</array>
				<key>pfm_type</key>
				<string>array</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_description</key>
				<string>List of LDAP servers that you would like to use for AD authentication instead of using SRV record lookup.</string>
				<key>pfm_name</key>
				<string>LDAPServers</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>Server</string>
						<key>pfm_type</key>
						<string>string</string>
					</dict>
				</array>
				<key>pfm_type</key>
				<string>array</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.2</string>
				<key>pfm_description</key>
				<string>Placeholder text to show in the username textfield.</string>
				<key>pfm_name</key>
				<string>UsernameFieldPlaceholder</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.1.0</string>
				<key>pfm_description</key>
				<string>Path to the logo to display on the login screen. If set to NONE, no logo will be shown.</string>
				<key>pfm_name</key>
				<string>LoginLogo</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_value_placeholder</key>
				<string>/usr/local/icons/logo.png</string>
			</dict>
			<dict>
				<key>pfm_allowed_file_types</key>
				<array>
					<string>public.image</string>
				</array>
				<key>pfm_app_min</key>
				<string>1.2</string>
				<key>pfm_description</key>
				<string>Logo to display on the login screen.</string>
				<key>pfm_name</key>
				<string>LoginLogoData</string>
				<key>pfm_type</key>
				<string>data</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_default</key>
				<integer>8</integer>
				<key>pfm_description</key>
				<string>Alpha value of the logo image.</string>
				<key>pfm_name</key>
				<string>LoginLogoAlpha</string>
				<key>pfm_range_list</key>
				<array>
					<integer>0</integer>
					<integer>1</integer>
					<integer>2</integer>
					<integer>3</integer>
					<integer>4</integer>
					<integer>5</integer>
					<integer>6</integer>
					<integer>7</integer>
					<integer>8</integer>
					<integer>9</integer>
					<integer>10</integer>
				</array>
				<key>pfm_range_list_titles</key>
				<array>
					<string>0%</string>
					<string>10%</string>
					<string>20%</string>
					<string>30%</string>
					<string>40%</string>
					<string>50%</string>
					<string>60%</string>
					<string>70%</string>
					<string>80%</string>
					<string>90%</string>
					<string>100%</string>
				</array>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.1.0</string>
				<key>pfm_description</key>
				<string>Path to the background image to be used.</string>
				<key>pfm_name</key>
				<string>BackgroundImage</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_value_placeholder</key>
				<string>/usr/local/icons/background.png</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_default</key>
				<integer>8</integer>
				<key>pfm_description</key>
				<string>Alpha value of the background image.</string>
				<key>pfm_name</key>
				<string>BackgroundImageAlpha</string>
				<key>pfm_range_list</key>
				<array>
					<integer>0</integer>
					<integer>1</integer>
					<integer>2</integer>
					<integer>3</integer>
					<integer>4</integer>
					<integer>5</integer>
					<integer>6</integer>
					<integer>7</integer>
					<integer>8</integer>
					<integer>9</integer>
					<integer>10</integer>
				</array>
				<key>pfm_range_list_titles</key>
				<array>
					<string>0%</string>
					<string>10%</string>
					<string>20%</string>
					<string>30%</string>
					<string>40%</string>
					<string>50%</string>
					<string>60%</string>
					<string>70%</string>
					<string>80%</string>
					<string>90%</string>
					<string>100%</string>
				</array>
				<key>pfm_type</key>
				<string>integer</string>
			</dict>
			
			<!-- *** EULA *** -->
			
			<dict>
				<key>pfm_app_min</key>
				<string>1.2</string>
				<key>pfm_description</key>
				<string>Text for the large title in the EULA window.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_present</key>
								<false/>
								<key>pfm_target</key>
								<string>EULAText</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_name</key>
				<string>EULATitle</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.2</string>
				<key>pfm_description</key>
				<string>Text for a subtitle in the EULA window.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_present</key>
								<false/>
								<key>pfm_target</key>
								<string>EULAText</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_name</key>
				<string>EULASubTitle</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.2</string>
				<key>pfm_description</key>
				<string>Text to present in the EULA window.</string>
				<key>pfm_name</key>
				<string>EULAText</string>
				<key>pfm_range_max</key>
				<integer>2</integer>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.2</string>
				<key>pfm_default</key>
				<string>/var/db/NoMADLogin/</string>
				<key>pfm_description</key>
				<string>Path to save acceptance records to.</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_present</key>
								<false/>
								<key>pfm_target</key>
								<string>EULAText</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_name</key>
				<string>EULAPath</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			
			
			<!-- *** CreateUser *** -->
			
			<dict>
				<key>pfm_app_min</key>
				<string>1.0</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_description</key>
				<string>Will place any local user created at login by NoMAD Login in the local admin group.</string>
				<key>pfm_name</key>
				<string>CreateAdminUser</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.2</string>
				<key>pfm_description</key>
				<string>List of groups that should have its members created as local administrators.</string>
				<key>pfm_name</key>
				<string>CreateAdminIfGroupMember</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_app_min</key>
						<string>1.2</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_name</key>
						<string>Group</string>
						<key>pfm_type</key>
						<string>string</string>
					</dict>
				</array>
				<key>pfm_type</key>
				<string>array</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_description</key>
				<string>Use the the user's CN from AD instead of attempting to create the user name from the first and last name attributes of the user's AD record.</string>
				<key>pfm_name</key>
				<string>UseCNForFullName</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.2</string>
				<key>pfm_description</key>
				<string>Path to an image to set as the user profile image.</string>
				<key>pfm_name</key>
				<string>UserProfileImage</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.0</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_description</key>
				<string>Will convert a previously cached mobile account from AD into a regular local user account on login.</string>
				<key>pfm_name</key>
				<string>DemobilizeUsers</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			
			<!-- *** UserInput *** -->
			
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_description</key>
				<string>Path where the userinfo.plist will be written.</string>
				<key>pfm_name</key>
				<string>UserInputOutputPath</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_description</key>
				<string>Path to a logo file to use for the UserInput mechanism.</string>
				<key>pfm_name</key>
				<string>UserInputLogo</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_description</key>
				<string>Title for the UserInput mechanism.</string>
				<key>pfm_name</key>
				<string>UserInputTitle</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_description</key>
				<string>Text for the UserInput mechanism.</string>
				<key>pfm_name</key>
				<string>UserInputMainText</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_range_max</key>
				<integer>4</integer>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_description</key>
				<string>UI elements shown during the UserInput mechanism.</string>
				<key>pfm_name</key>
				<string>UserInputUI</string>
				<key>pfm_type</key>
				<string>dictionary</string>
				<key>pfm_hidden</key>
				<string>container</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>TextFields</string>
						<key>pfm_type</key>
						<string>array</string>
						<key>pfm_range_max</key>
						<integer>4</integer>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>TextField</string>
								<key>pfm_type</key>
								<string>dictionary</string>
								<key>pfm_subkeys</key>
								<array>
									<dict>
										<key>pfm_title</key>
										<string>Title</string>
										<key>pfm_name</key>
										<string>title</string>
										<key>pfm_type</key>
										<string>string</string>
									</dict>
									<dict>
										<key>pfm_title</key>
										<string>Placeholder</string>
										<key>pfm_name</key>
										<string>placeholder</string>
										<key>pfm_type</key>
										<string>string</string>
									</dict>
								</array>
							</dict>
						</array>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>PopUps</string>
						<key>pfm_type</key>
						<string>array</string>
						<key>pfm_range_max</key>
						<integer>4</integer>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>PopUp</string>
								<key>pfm_type</key>
								<string>dictionary</string>
								<key>pfm_subkeys</key>
								<array>
									<dict>
										<key>pfm_title</key>
										<string>Title</string>
										<key>pfm_name</key>
										<string>title</string>
										<key>pfm_type</key>
										<string>string</string>
									</dict>
									<dict>
										<key>pfm_title</key>
										<string>Items</string>
										<key>pfm_name</key>
										<string>items</string>
										<key>pfm_type</key>
										<string>array</string>
										<key>pfm_subkeys</key>
										<array>
											<dict>
												<key>pfm_type</key>
												<string>string</string>
											</dict>
										</array>
									</dict>
								</array>
							</dict>
						</array>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>Button</string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_hidden</key>
						<string>container</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_title</key>
								<string>Button</string>
								<key>pfm_name</key>
								<string>title</string>
								<key>pfm_type</key>
								<string>string</string>
							</dict>
							<dict>
								<key>pfm_title</key>
								<string>Button Enabled</string>
								<key>pfm_name</key>
								<string>enabled</string>
								<key>pfm_type</key>
								<string>boolean</string>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
			
			<!-- *** EnableFDE *** -->
			
			<dict>
				<key>pfm_app_min</key>
				<string>1.0</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_description</key>
				<string>On systems using the APFS filesystem, this key will enable FileVault encryption as the user is signing in for the first time.</string>
				<key>pfm_name</key>
				<string>EnableFDE</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.0</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_description</key>
				<string>Write the output of the fdesetup command to /var/db/.NoMADFDESetup</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_contains_any</key>
								<array>
									<false/>
								</array>
								<key>pfm_target</key>
								<string>EnableFDE</string>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_name</key>
				<string>EnableFDERecoveryKey</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_description_reference</key>
				<string>String of a folder path where the recovery key will be stored. NoLo will create this folder if it does not already exist.</string>
				<key>pfm_name</key>
				<string>EnableFDERecoveryKeyPath</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_value_placeholder</key>
				<string>/usr/local/opt</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_description_reference</key>
				<string>Determines if the FileVault personal recovery key should be rotated when a valid FileVault user signs in.</string>
				<key>pfm_name</key>
				<string>EnableFDERekey</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			
			<!-- *** RunScript *** -->
			
			<dict>
				<key>pfm_description_reference</key>
				<string>Path to the script or other executable.</string>
				<key>pfm_name</key>
				<string>ScriptPath</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_value_placeholder</key>
				<string>/usr/local/bin/login</string>
			</dict>
			<dict>
				<key>pfm_description_reference</key>
				<string>Augments to be used with the script. &lt;&lt;User&gt;&gt; will be replaced with the current user's shortname, &lt;&lt;First&gt;&gt; with the current user's first name, &lt;&lt;Last&gt;&gt; with the current user's last name, &lt;&lt;Principal&gt;&gt; with the current user's Kerberos principal.</string>
				<key>pfm_name</key>
				<string>ScriptArgs</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_title</key>
						<string>Arguments</string>
						<key>pfm_type</key>
						<string>string</string>
					</dict>
				</array>
			</dict>
			
			<!-- *** Notify *** -->
			
			<dict>
				<key>pfm_app_min</key>
				<string>1.3</string>
				<key>pfm_description</key>
				<string>Adds the appropriate log file to the the Notify mechanism.</string>
				<key>pfm_name</key>
				<string>NotifyLogStyle</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_range_list</key>
				<array>
					<string>none</string>
					<string>jamf</string>
					<string>filewave</string>
					<string>munki</string>
				</array>
				<key>pfm_range_list_titles</key>
				<array>
					<string>None</string>
					<string>Jamf</string>
					<string>Filewave</string>
					<string>Munki</string>
				</array>
			</dict>
			
			<!-- *** KeychainAdd *** -->
			
			<dict>
				<key>pfm_app_min</key>
				<string>1.2</string>
				<key>pfm_description</key>
				<string>Create keychain if it does not exist.</string>
				<key>pfm_name</key>
				<string>KeychainCreate</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.2</string>
				<key>pfm_description</key>
				<string>Add a NoMAD entry into the keychain.</string>
				<key>pfm_name</key>
				<string>KeychainAddNoMAD</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.2.1</string>
				<key>pfm_description</key>
				<string>Shortname of the last user to login. This allows NoMAD to login on first launch.</string>
				<key>pfm_note</key>
				<string>Setting this in a profile will disable this value from being set on the system.</string>
				<key>pfm_name</key>
				<string>LastUser</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_app_min</key>
				<string>1.2</string>
				<key>pfm_description</key>
				<string>Reset keychain if login password doesn't match.</string>
				<key>pfm_name</key>
				<string>KeychainReset</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
		</array>
		<key>pfm_targets</key>
		<array>
			<string>system</string>
		</array>
		<key>pfm_title</key>
		<string>NoMAD Login</string>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_version</key>
		<integer>6</integer>
	</dict>
</plist>
