<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_documentation_url</key>
	<string>https://nomad.menu/help-center/preferences-and-what-they-do/</string>
	<key>pfm_app_url</key>
	<string>https://nomad.menu</string>
	<key>pfm_description</key>
	<string>NoMAD Pro settings</string>
	<key>pfm_domain</key>
	<string>menu.nomad.NoMADPro</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2019-09-17T08:52:31Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures NoMAD Pro settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>NoMAD Pro</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>menu.nomad.NoMADPro</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>menu.nomad.NoMADPro</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<string>dev-660125.oktapreview.com</string>
			<key>pfm_description</key>
			<string>URL for the Okta server, note no preceding https: is required.</string>
			<key>pfm_enabled</key>
			<true/>
			<key>pfm_name</key>
			<string>AuthServer</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Menu</string>
				<string>Password</string>
				<string>Kerberos</string>
				<string>AD</string>
				<string>Certificates</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>AD</key>
				<array>
					<string>IgnoreDomainReachability</string>
					<string>LDAPServers</string>
				</array>
				<key>Certificates</key>
				<array>
					<string>ExportableKey</string>
					<string>X509CA</string>
					<string>Template</string>
					<string>WifiNetworks</string>
				</array>
				<key>General</key>
				<array>
					<string>LicenseFile</string>
					<string>PeriodicUpdateTime</string>
					<string>SignInCommand</string>
					<string>PFC_SegmentedControl_General</string>
					<string>CheckSafariExtension</string>
					<string>AutoAuth</string>
					<string>DontShowWelcome</string>
					<string>UseKeychainPrompt</string>
					<string>UseKeychainPromptExlusions</string>
					<string>SignInLogo</string>
					<string>TitleSignIn</string>
					<string>LabelUsername</string>
					<string>LabelPassword</string>
					<string>MessagePluginDisable</string>
				</array>
				<key>Kerberos</key>
				<array>
					<string>KerberosRealm</string>
					<string>TicketsOnSignIn</string>
					<string>KerberosRenew</string>
					<string>KerberosShortNameAsk</string>
					<string>KerberosShortNameAskMessage</string>
					<string>KerberosShortName</string>
				</array>
				<key>Menu</key>
				<array>
					<string>MenuIcon</string>
					<string>PFC_SegmentedControl_Menu</string>
					<string>ActionsUpdateTime</string>
					<string>GetHelpType</string>
					<string>GetHelpOptions</string>
					<string>SelfServicePath</string>
					<string>HideAbout</string>
					<string>HideGetSoftware</string>
					<string>HidePreferences</string>
					<string>HideLockScreen</string>
					<string>HideQuit</string>
					<string>HideSignIn</string>
					<string>HideActions</string>
					<string>HideChangePassword</string>
					<string>HideGetHelp</string>
					<string>MenuAbout</string>
					<string>MenuActions</string>
					<string>MenuChangePassword</string>
					<string>MenuSignIn</string>
					<string>MenuPreferences</string>
					<string>MenuGetSoftware</string>
					<string>MenuLockScreen</string>
					<string>MenuGetHelp</string>
					<string>MessagePasswordChangePolicy</string>
				</array>
				<key>Password</key>
				<array>
					<string>UseKeychain</string>
					<string>LocalPasswordSync</string>
					<string>LocalPasswordSyncOnMatchOnly</string>
					<string>LocalPasswordSyncMessage</string>
					<string>PFC_SegmentedControl_Password</string>
					<string>ChangePasswordTimer</string>
					<string>ChangePasswordOrder</string>
					<string>ExpirationWarningDays</string>
					<string>PasswordExpirationMenu</string>
					<string>PasswordExpirationMenuDays</string>
					<string>ADExpirationShow</string>
					<string>WarnOnPasswordExpiration</string>
					<string>PasswordChangeCommand</string>
					<string>PasswordPolicy</string>
					<string>KeychainItems</string>
					<string>KeychainItemsDebug</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_allowed_file_types</key>
			<array>
				<string>nomadlicense</string>
			</array>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_description</key>
			<string>The contents of a .nomadlicense file encoded as Base64 data.</string>
			<key>pfm_name</key>
			<string>LicenseFile</string>
			<key>pfm_type</key>
			<string>data</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_default</key>
			<integer>15</integer>
			<key>pfm_description</key>
			<string>Time in minutes between periodic background updates.</string>
			<key>pfm_name</key>
			<string>PeriodicUpdateTime</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>Minutes</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Path to a script or other binary to be run after a successful sign in.</string>
			<key>pfm_name</key>
			<string>SignInCommand</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/usr/local/bin/scripts/signin.bash</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_General</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>SignIn Window</string>
				<string>Welcome Window</string>
				<string>Web Extensions</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>SignIn Window</key>
				<array>
					<string>UseKeychainPrompt</string>
					<string>UseKeychainPromptExlusions</string>
					<string>SignInLogo</string>
					<string>TitleSignIn</string>
					<string>LabelUsername</string>
					<string>LabelPassword</string>
				</array>
				<key>Web Extensions</key>
				<array>
					<string>AutoAuth</string>
					<string>CheckSafariExtension</string>
					<string>MessagePluginDisabled</string>
				</array>
				<key>Welcome Window</key>
				<array>
					<string>DontShowWelcome</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_description</key>
			<string>Shows the Sign In window on launch unless the user has a password in the keychain.</string>
			<key>pfm_name</key>
			<string>UseKeychainPrompt</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_description</key>
			<string>List of users that can ignore the keychain prompt.</string>
			<key>pfm_name</key>
			<string>UseKeychainPromptExlusions</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>1.1</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>User</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Path to a logo file. The space is 342x90 pixels.</string>
			<key>pfm_name</key>
			<string>SignInLogo</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/usr/local/icons/logo.png</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_default</key>
			<string>Sign in to Okta</string>
			<key>pfm_description</key>
			<string>Title of the Sign In window.</string>
			<key>pfm_name</key>
			<string>TitleSignIn</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<string>Corporate e-mail</string>
			<key>pfm_description</key>
			<string>The text label for the username field in the Sign In window.</string>
			<key>pfm_name</key>
			<string>LabelUsername</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<string>Corporate Password</string>
			<key>pfm_description</key>
			<string>The text label for the password field in the Sign In window.</string>
			<key>pfm_name</key>
			<string>LabelPassword</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_description</key>
			<string>Disables the showing of the welcome splash screen on launch.</string>
			<key>pfm_name</key>
			<string>DontShowWelcome</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Determines if web extensions automatically authenticate via the NoMAD Pro UI.</string>
			<key>pfm_name</key>
			<string>AutoAuth</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Determines if the user is warned that the NoMAD Pro extension has not been enabled in Safari.</string>
			<key>pfm_name</key>
			<string>CheckSafariExtension</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_default</key>
			<string>Please enable the plugin in Safari.</string>
			<key>pfm_description</key>
			<string>Text to show when alerting the user that the Safari plugin has not been enabled.</string>
			<key>pfm_name</key>
			<string>MessagePluginDisabled</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Determines if SRV record lookups are used to determine if the AD domain is reachable.</string>
			<key>pfm_name</key>
			<string>IgnoreDomainReachability</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Specific Domain Controllers to use for AD lookups.</string>
			<key>pfm_name</key>
			<string>LDAPServers</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>LDAPServer</string>
					<key>pfm_title</key>
					<string>LDAPServer</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>dc1.nomad.local</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Kerberos realm to use to get Kerberos tickets as a side effect of authentication.</string>
			<key>pfm_name</key>
			<string>KerberosRealm</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>NOMAD.TEST</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Causes NoMAD Pro to get Kerberos Tickets.</string>
			<key>pfm_name</key>
			<string>TicketsOnSignIn</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_description</key>
			<string>Determines if the Kerberos tickets should be renewed or not.</string>
			<key>pfm_name</key>
			<string>KerberosRenew</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Determines if the user is asked to enter their Kerberos short name on first sign in.</string>
			<key>pfm_name</key>
			<string>KerberosShortNameAsk</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_default</key>
			<string>Please enter your AD user name.</string>
			<key>pfm_description</key>
			<string>The message text when asking the user for their Kerberos short name.</string>
			<key>pfm_name</key>
			<string>KerberosShortNameAskMessage</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_default</key>
			<string>joel</string>
			<key>pfm_description</key>
			<string>The shortname to use for Kerberos tickets. If unset the sign in name is used.</string>
			<key>pfm_name</key>
			<string>KerberosShortName</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Determines if the Okta password is stored in the user’s keychain.</string>
			<key>pfm_name</key>
			<string>UseKeychain</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Determines if the Okta password is synchronized with the local account.</string>
			<key>pfm_name</key>
			<string>LocalPasswordSync</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Only sync the password if the Okta account name is the same as the local account name.</string>
			<key>pfm_name</key>
			<string>LocalPasswordSyncOnMatchOnly</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<string>Please enter your local user account password.</string>
			<key>pfm_description</key>
			<string>The alert dialog text that the user is presented with when asked to enter in his or her local password.</string>
			<key>pfm_name</key>
			<string>LocalPasswordSyncMessage</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Items to update when the user's local password is updated as well.</string>
			<key>pfm_name</key>
			<string>KeychainItems</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>{{key}}</string>
					<key>pfm_title</key>
					<string>Keychain Item</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>Exchange</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>{{value}}</string>
					<key>pfm_title</key>
					<string>Account</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>&lt;&lt;shortname&gt;&gt;@&lt;&lt;domain&gt;&gt;.onmicrosoft.com</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>KeychainItems</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Updates keychain items on every sign in. Used for debugging.</string>
			<key>pfm_name</key>
			<string>KeychainItemsDebug</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_Password</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Password Policy</string>
				<string>Password Change</string>
				<string>Password Expiration</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Password Change</key>
				<array>
					<string>PasswordChangeCommand</string>
					<string>ChangePasswordTimer</string>
					<string>ChangePasswordOrder</string>
				</array>
				<key>Password Expiration</key>
				<array>
					<string>WarnOnPasswordExpiration</string>
					<string>PasswordExpirationMenu</string>
					<string>PasswordExpirationMenuDays</string>
					<string>ExpirationWarningDays</string>
					<string>ADExpirationShow</string>
				</array>
				<key>Password Policy</key>
				<array>
					<string>PasswordPolicy</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Determines the order and setting for the password change menu. NOT IMPLEMENTED YET, THERE IS NO DOCUMENTATION ON THIS KEY.</string>
			<key>pfm_name</key>
			<string>ChangePasswordOrder</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>ChangePasswordItem</string>
					<key>pfm_subkeys</key>
					<array>
						<dict/>
					</array>
					<key>pfm_title</key>
					<string>ChangePasswordItem</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Script or other binary to run when a password is successfully changed.</string>
			<key>pfm_name</key>
			<string>PasswordChangeCommand</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/usr/local/bin/scripts/change.sh</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_default</key>
			<integer>3</integer>
			<key>pfm_description</key>
			<string>Time in minutes until the user is prompted to sign in again after a Password Change.</string>
			<key>pfm_name</key>
			<string>ChangePasswordTimer</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>Minutes</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Determines whether NoMAD Pro should warn the user on sign in if the password is about to expire.</string>
			<key>pfm_name</key>
			<string>WarnOnPasswordExpiration</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_description</key>
			<string>Determines if the countdown before password expiration is shown in the menu.</string>
			<key>pfm_name</key>
			<string>PasswordExpirationMenu</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_default</key>
			<integer>15</integer>
			<key>pfm_description</key>
			<string>Number of days remaining before the password expiration countdown is shown in the menu bar.</string>
			<key>pfm_name</key>
			<string>PasswordExpirationMenuDays</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>Days</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_default</key>
			<integer>5</integer>
			<key>pfm_description</key>
			<string>Number of days remaining before sending notifications via the Notification Center.</string>
			<key>pfm_name</key>
			<string>ExpirationWarningDays</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>Days</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_description</key>
			<string>Shows a menu item beneath the current user’s name showing the user’s password expiration as determined by AD.</string>
			<key>pfm_name</key>
			<string>ADExpirationShow</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Complexity policy for changing the password via Kerberos.</string>
			<key>pfm_name</key>
			<string>PasswordPolicy</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_format</key>
					<string>^[0-9]+$</string>
					<key>pfm_name</key>
					<string>minLength</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_type_input</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>6</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_format</key>
					<string>^[0-9]+$</string>
					<key>pfm_name</key>
					<string>minLowerCase</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_type_input</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>2</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_format</key>
					<string>^[0-9]+$</string>
					<key>pfm_name</key>
					<string>minNumber</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_type_input</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>2</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_format</key>
					<string>^[0-9]+$</string>
					<key>pfm_name</key>
					<string>minSymbol</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_type_input</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>1</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_format</key>
					<string>^[0-9]+$</string>
					<key>pfm_name</key>
					<string>minUpperCase</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_type_input</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>2</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>1.0</string>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_format</key>
					<string>^[0-9]+$</string>
					<key>pfm_name</key>
					<string>minMatches</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_type_input</key>
					<string>integer</string>
					<key>pfm_value_placeholder</key>
					<string>3</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_description</key>
			<string>Allows the private key of the user certificate to be exported.</string>
			<key>pfm_name</key>
			<string>ExportableKey</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_description</key>
			<string>FQDN of the Windows web CA for NoMAD Pro to use for certificates.</string>
			<key>pfm_name</key>
			<string>X509CA</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>dc1.nomad.test</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_default</key>
			<string>User Auth</string>
			<key>pfm_description</key>
			<string>Certificate template to request when using the Windows CA.</string>
			<key>pfm_name</key>
			<string>Template</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_description</key>
			<string>A list of wireless networks that the certificate created by NoMAD Pro should be associated with.</string>
			<key>pfm_name</key>
			<string>WifiNetworks</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>SSID</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_description</key>
			<string>Path to a 16x16 pixel image to use as the icon in the menu bar.</string>
			<key>pfm_name</key>
			<string>MenuIcon</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/usr/local/icons/icon.png</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_Menu</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Menu Items</string>
				<string>Menu Titles</string>
				<string>Actions</string>
				<string>Messages</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Actions</key>
				<array>
					<string>ActionsUpdateTime</string>
					<string>GetHelpType</string>
					<string>GetHelpOptions</string>
					<string>SelfServicePath</string>
				</array>
				<key>Menu Items</key>
				<array>
					<string>HideAbout</string>
					<string>HideActions</string>
					<string>HideChangePassword</string>
					<string>HideGetHelp</string>
					<string>HideGetSoftware</string>
					<string>HideLockScreen</string>
					<string>HidePreferences</string>
					<string>HideSignIn</string>
					<string>HideQuit</string>
				</array>
				<key>Menu Titles</key>
				<array>
					<string>MenuAbout</string>
					<string>MenuActions</string>
					<string>MenuChangePassword</string>
					<string>MenuGetHelp</string>
					<string>MenuGetSoftware</string>
					<string>MenuLockScreen</string>
					<string>MenuPreferences</string>
					<string>MenuSignIn</string>
				</array>
				<key>Messages</key>
				<array>
					<string>MessagePasswordChangePolicy</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_default</key>
			<integer>15</integer>
			<key>pfm_description</key>
			<string>Number of minutes between updating the Actions Menu.</string>
			<key>pfm_name</key>
			<string>ActionsUpdateTime</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>Minutes</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Determines type of GetHelp function</string>
			<key>pfm_name</key>
			<string>GetHelpType</string>
			<key>pfm_range_list</key>
			<array>
				<string>Bomgar</string>
				<string>URL</string>
				<string>App</string>
			</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>URL or Path for GetHelpType (&lt;&lt;serial&gt;&gt;, &lt;&lt;fullname&gt;&gt;, &lt;&lt;shortname&gt;&gt; and &lt;&lt;domain&gt;&gt; are currently supported as substitutions)</string>
			<key>pfm_name</key>
			<string>GetHelpOptions</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Applications/Google Chrome.app</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>File path for a Self Service application not found automatically.</string>
			<key>pfm_name</key>
			<string>SelfServicePath</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Applications/SelfService.app</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_description</key>
			<string>Hides the About menu item.</string>
			<key>pfm_name</key>
			<string>HideAbout</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Hides the Actions menu item.</string>
			<key>pfm_name</key>
			<string>HideActions</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Hides the Change Password menu item.</string>
			<key>pfm_name</key>
			<string>HideChangePassword</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Hides the Get Help menu item.</string>
			<key>pfm_name</key>
			<string>HideGetHelp</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Hides the Get Software menu item.</string>
			<key>pfm_name</key>
			<string>HideGetSoftware</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Hides the Lock Screen menu item.</string>
			<key>pfm_name</key>
			<string>HideLockScreen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Hides the Preferences menu item.</string>
			<key>pfm_name</key>
			<string>HidePreferences</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Hides the Sign In menu item.</string>
			<key>pfm_name</key>
			<string>HideSignIn</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Hides the Quit menu item.</string>
			<key>pfm_name</key>
			<string>HideQuit</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_default</key>
			<string>Please review the employee handbook.</string>
			<key>pfm_description</key>
			<string>Message text when changing password via Kerberos for the AD complexity policy.</string>
			<key>pfm_name</key>
			<string>MessagePasswordChangePolicy</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1</string>
			<key>pfm_default</key>
			<string>This Application</string>
			<key>pfm_description</key>
			<string>Menu item text for the About item.</string>
			<key>pfm_name</key>
			<string>MenuAbout</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_default</key>
			<string>Quick Actions</string>
			<key>pfm_description</key>
			<string>Menu item text for the Actions item.</string>
			<key>pfm_name</key>
			<string>MenuActions</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_default</key>
			<string>Change network password</string>
			<key>pfm_description</key>
			<string>Menu item text for the Change Password item.</string>
			<key>pfm_name</key>
			<string>MenuChangePassword</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<string>File ticket</string>
			<key>pfm_description</key>
			<string>Menu item text for the Get Help item.</string>
			<key>pfm_name</key>
			<string>MenuGetHelp</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<string>Get Apps</string>
			<key>pfm_description</key>
			<string>Menu item text for the Get Software item.</string>
			<key>pfm_name</key>
			<string>MenuGetSoftware</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<string>Screen Lock</string>
			<key>pfm_description</key>
			<string>Menu item text for the Lock Screen item.</string>
			<key>pfm_name</key>
			<string>MenuLockScreen</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<string>Prefs</string>
			<key>pfm_description</key>
			<string>Menu item text for the Preferences item.</string>
			<key>pfm_name</key>
			<string>MenuPreferences</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<string>Login</string>
			<key>pfm_description</key>
			<string>Menu item text for the Sign In item.</string>
			<key>pfm_name</key>
			<string>MenuSignIn</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_title</key>
	<string>NoMAD Pro</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>3</integer>
</dict>
</plist>
