<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_documentation_url</key>
	<string>https://gitlab.com/orchardandgrove-oss/NoMADLogin-AD/wikis/Configuration/preferences</string>
	<key>pfm_app_url</key>
	<string>https://gitlab.com/orchardandgrove-oss/NoMADLogin-AD</string>
	<key>pfm_description</key>
	<string>NoMAD Login settings</string>
	<key>pfm_domain</key>
	<string>menu.nomad.login.ad</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_icon</key>
	<data>
	</data>
	<key>pfm_last_modified</key>
	<date>2018-07-15T13:00:02Z</date>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures NoMAD Login settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>NoMAD Login</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>menu.nomad.login.ad</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>menu.nomad.login.ad</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_description</key>
			<string>Defines the AD domain you’re working with.</string>
			<key>pfm_name</key>
			<string>ADDomain</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Keychain</string>
				<string>Window</string>
				<string>EULA</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>EULA</key>
				<array>
					<string>EULAText</string>
					<string>EULAPath</string>
					<string>EULATitle</string>
					<string>EULASubTitle</string>
				</array>
				<key>General</key>
				<array>
					<string>CreateAdminUser</string>
					<string>DemobilizeUsers</string>
					<string>EnableFDE</string>
					<string>EnableFDERecoveryKey</string>
					<string>LDAPOverSSL</string>
				</array>
				<key>Keychain</key>
				<array>
					<string>KeychainCreate</string>
					<string>KeychainAddNoMAD</string>
					<string>KeychainReset</string>
				</array>
				<key>Window</key>
				<array>
					<string>LoginLogo</string>
					<string>BackgroundImage</string>
					<string>BackgroundImageAlpha</string>
					<string>LoginScreen</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Will place any local user created at login by NoMAD Login in the local admin group.</string>
			<key>pfm_name</key>
			<string>CreateAdminUser</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Will convert a previously cached mobile account from AD into a regular local user account on login.</string>
			<key>pfm_name</key>
			<string>DemobilizeUsers</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>On systems using the APFS filesystem, this key will enable FileVault encryption as the user is signing in for the first time.</string>
			<key>pfm_name</key>
			<string>EnableFDE</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Write the output of the fdesetup command to /var/db/.NoMADFDESetup</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>EnableFDE</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>EnableFDERecoveryKey</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Determines if NoMAD Login uses LDAP over SSL.</string>
			<key>pfm_name</key>
			<string>LDAPOverSSL</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Create keychain if it does not exist.</string>
			<key>pfm_name</key>
			<string>KeychainCreate</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Add a NoMAD entry into the keychain.</string>
			<key>pfm_name</key>
			<string>KeychainAddNoMAD</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Reset keychain if login password doesn't match.</string>
			<key>pfm_name</key>
			<string>KeychainReset</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1.0</string>
			<key>pfm_description</key>
			<string>A full path to the logo to be used. If set to NONE, no logo will be shown.</string>
			<key>pfm_name</key>
			<string>LoginLogo</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/usr/local/icons/logo.png</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1.0</string>
			<key>pfm_description</key>
			<string>A full path to the background image to be used.</string>
			<key>pfm_name</key>
			<string>BackgroundImage</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/usr/local/icons/background.png</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_default</key>
			<integer>80</integer>
			<key>pfm_description</key>
			<string>Alpha value of the background image.</string>
			<key>pfm_name</key>
			<string>BackgroundImageAlpha</string>
			<key>pfm_range_max</key>
			<integer>100</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.1.0</string>
			<key>pfm_description</key>
			<string>If set to yes, a macOS-style loginscreen will be presented instead of the NoMAD Login loginwindow style.</string>
			<key>pfm_name</key>
			<string>LoginScreen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Text to present in the EULA window.</string>
			<key>pfm_name</key>
			<string>EULAText</string>
			<key>pfm_range_max</key>
			<integer>2</integer>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_default</key>
			<string>/var/db/NoMADLogin/</string>
			<key>pfm_description</key>
			<string>Path to save acceptance records to.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>EULAText</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>EULAPath</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Text for the large title in the EULA window.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>EULAText</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>EULATitle</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.2</string>
			<key>pfm_description</key>
			<string>Text for a subtitle in the EULA window.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>EULAText</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>EULASubTitle</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>NoMAD Login</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>3</integer>
</dict>
</plist>
