<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://particulars.app/</string>
	<key>pfm_description</key>
	<string>Particulars Today Extension (Widget) settings</string>
	<key>pfm_domain</key>
	<string>net.glencode.Particulars.Widget</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2021-12-02T08:52:31Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Particulars settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Particulars</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>net.glencode.Particulars</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>net.glencode.Particulars</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Lab Mode eases deployment of Particulars in a computer lab or data center.</string>
			<key>pfm_name</key>
			<string>labMode</string>
			<key>pfm_title</key>
			<string>Lab Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_description</key>
			<string>Adjust detail level options. See documentation URL for instructions.</string>
			<key>pfm_name</key>
			<string>detailLevel</string>
			<key>pfm_title</key>
			<string>Detail Level</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_description</key>
			<string>Sets the letter case of the labels. Each case option has a corresponding number.</string>
			<key>pfm_name</key>
			<string>labelCase</string>
			<key>pfm_title</key>
			<string>Label Case</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Unaltered</string>
				<string>lower (default)</string>
				<string>UPPER</string>
			</array>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_description</key>
			<string>Particulars shows the DHCP server address and the length of the DHCP lease. Setting this preference will also show the remaining lease time.</string>
			<key>pfm_name</key>
			<string>dhcpLeaseRemaining</string>
			<key>pfm_title</key>
			<string>Show DHCP Lease Time Remaining</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_description</key>
			<string>By default, MAC (Media Access Control) addresses are formatted with colon separators and in lowercase. Use this preference to select another MAC address format.</string>
			<key>pfm_name</key>
			<string>macAddressFormat</string>
			<key>pfm_title</key>
			<string>MAC Address Format</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Plain (example: 0123456789ab)</string>
				<string>Unix (default, example: 01:23:45:67:89:ab)</string>
				<string>Cisco (example: 0123.4567.89ab)</string>
				<string>Windows/IEEE (example: 01-23-45-67-89-AB)</string>
			</array>
		</dict>
		<dict>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_description</key>
			<string>By default, all network information is displayed. It is possible to construct a custom set of network information. Use this preference to create a custom network detail level. See documentation URL for instructions.</string>
			<key>pfm_name</key>
			<string>networkDetailLevel</string>
			<key>pfm_title</key>
			<string>Network Detail Level</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_description</key>
			<string>Use this preference to have Particulars display subnet masks in the short CIDR (Classless Inter-domain Routing) notation. For example, 255.255.254.0 will show as /23.</string>
			<key>pfm_name</key>
			<string>subnetMaskCIDRNotation</string>
			<key>pfm_title</key>
			<string>Subnet Mask CIDR Notation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_description</key>
			<string>Adds a count of CPU cores to the CPU item. Changing this preference requires a restart of the application/widget to take effect.</string>
			<key>pfm_name</key>
			<string>coreCount</string>
			<key>pfm_title</key>
			<string>Show CPU Core Count</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_description</key>
			<string>Free/available disk space can be displayed in multiple ways. See documentation URL for options.</string>
			<key>pfm_name</key>
			<string>diskFreeSpace</string>
			<key>pfm_title</key>
			<string>Show Disk Free Space</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Free</string>
				<string>All available (including purgeable)</string>
				<string>Free and purgeable</string>
			</array>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Particulars Today Extension (Widget)</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
