<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://github.com/root3nl/SupportApp</string>
	<key>pfm_description</key>
	<string>SupportApp by Root3 settings</string>
	<key>pfm_documentation_url</key>
	<string>https://github.com/root3nl/SupportApp/#configuration</string>
	<key>pfm_domain</key>
	<string>nl.root3.support</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2024-07-29T11:57:57Z</date>
	<key>pfm_macos_min</key>
	<string>11.0.1</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>SupportApp by Root3</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>nl.root3.support</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>nl.root3.support</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs. During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>SupportApp by Root3 settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Extensions</string>
				<string>Info Items</string>
				<string>First Row Left</string>
				<string>First Row Middle</string>
				<string>First Row Right</string>
				<string>Second Row Left</string>
				<string>Second Row Middle</string>
				<string>Second Row Right</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Extensions</key>
				<array>
					<string>ExtensionLinkA</string>
					<string>ExtensionSymbolA</string>
					<string>ExtensionTitleA</string>
					<string>ExtensionTypeA</string>
					<string>ExtensionLinkB</string>
					<string>ExtensionSymbolB</string>
					<string>ExtensionTitleB</string>
					<string>ExtensionTypeB</string>
				</array>
				<key>First Row Left</key>
				<array>
					<string>FirstRowLinkLeft</string>
					<string>FirstRowSubtitleLeft</string>
					<string>FirstRowSymbolLeft</string>
					<string>FirstRowTitleLeft</string>
					<string>FirstRowTypeLeft</string>
				</array>
				<key>First Row Middle</key>
				<array>
					<string>FirstRowLinkMiddle</string>
					<string>FirstRowSubtitleMiddle</string>
					<string>FirstRowSymbolMiddle</string>
					<string>FirstRowTitleMiddle</string>
					<string>FirstRowTypeMiddle</string>
				</array>
				<key>First Row Right</key>
				<array>
					<string>FirstRowLinkRight</string>
					<string>FirstRowSubtitleRight</string>
					<string>FirstRowSymbolRight</string>
					<string>FirstRowTitleRight</string>
					<string>FirstRowTypeRight</string>
				</array>
				<key>General</key>
				<array>
					<string>CustomColor</string>
					<string>CustomColorDarkMode</string>
					<string>ErrorMessage</string>
					<string>FooterText</string>
					<string>HideFirstRow</string>
					<string>HideMajorUpdates</string>
					<string>HideSecondRow</string>
					<string>Logo</string>
					<string>LogoDarkMode</string>
					<string>NotificationIcon</string>
					<string>OpenAtLogin</string>
					<string>ShowWelcomeScreen</string>
					<string>StatusBarIcon</string>
					<string>StatusBarIconNotifierEnabled</string>
					<string>StatusBarIconSFSymbol</string>
					<string>Title</string>
				</array>
				<key>Info Items</key>
				<array>
					<string>HideFirstRow</string>
					<string>InfoItemOne</string>
					<string>InfoItemTwo</string>
					<string>InfoItemThree</string>
					<string>InfoItemFour</string>
					<string>InfoItemFive</string>
					<string>InfoItemSix</string>
					<string>PasswordExpiryLimit</string>
					<string>PasswordType</string>
					<string>PasswordLabel</string>
					<string>StorageLimit</string>
					<string>UptimeDaysLimit</string>
				</array>
				<key>Second Row Left</key>
				<array>
					<string>SecondRowLinkLeft</string>
					<string>SecondRowSubtitleLeft</string>
					<string>SecondRowSymbolLeft</string>
					<string>SecondRowTitleLeft</string>
					<string>SecondRowTypeLeft</string>
				</array>
				<key>Second Row Middle</key>
				<array>
					<string>SecondRowLinkMiddle</string>
					<string>SecondRowSubtitleMiddle</string>
					<string>SecondRowSymbolMiddle</string>
					<string>SecondRowTitleMiddle</string>
					<string>SecondRowTypeMiddle</string>
				</array>
				<key>Second Row Right</key>
				<array>
					<string>SecondRowLinkRight</string>
					<string>SecondRowSubtitleRight</string>
					<string>SecondRowSymbolRight</string>
					<string>SecondRowTitleRight</string>
					<string>SecondRowTypeRight</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Support</string>
			<key>pfm_description</key>
			<string>Text shown in the top left corner when the app opens</string>
			<key>pfm_name</key>
			<string>Title</string>
			<key>pfm_title</key>
			<string>Title</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>"Your Company Name", "IT Helpdesk" etc.</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Path to the logo shown in the top right corner when the app opens. Scales to 48 points maximum height</string>
			<key>pfm_name</key>
			<string>Logo</string>
			<key>pfm_note</key>
			<string>Some preference keys like the icon and status bar icon point to a file location. Due to the sandboxed characteristic of the app, not all file locations are allowed. We suggest putting the files in a folder within Application Support such as /Library/Application Support/Your Company/ where the app can read the contents. Other supported file locations can be found in Apple's documentation about App Sandbox: https://developer.apple.com/library/archive/documentation/Security/Conceptual/AppSandboxDesignGuide/AppSandboxInDepth/AppSandboxInDepth.html#/apple_ref/doc/uid/TP40011183-CH3-SW17</string>
			<key>pfm_title</key>
			<string>Custom Logo</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Library/Application Support/Your Company/LightModeLogo.png</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Path to the logo shown in the top right corner when the app opens for Dark Mode. Scales to 48 points maximum height</string>
			<key>pfm_name</key>
			<string>LogoDarkMode</string>
			<key>pfm_note</key>
			<string>Some preference keys like the icon and status bar icon point to a file location. Due to the sandboxed characteristic of the app, not all file locations are allowed. We suggest putting the files in a folder within Application Support such as /Library/Application Support/Your Company/ where the app can read the contents. Other supported file locations can be found in Apple's documentation about App Sandbox: https://developer.apple.com/library/archive/documentation/Security/Conceptual/AppSandboxDesignGuide/AppSandboxInDepth/AppSandboxInDepth.html#/apple_ref/doc/uid/TP40011183-CH3-SW17</string>
			<key>pfm_title</key>
			<string>Custom Logo Dark Mode</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Library/Application Support/Your Company/DarkModeLogo.png</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Path to the notification icon</string>
			<key>pfm_name</key>
			<string>NotificationIcon</string>
			<key>pfm_note</key>
			<string>Some preference keys like the icon and status bar icon point to a file location. Due to the sandboxed characteristic of the app, not all file locations are allowed. We suggest putting the files in a folder within Application Support such as /Library/Application Support/Your Company/ where the app can read the contents. Other supported file locations can be found in Apple's documentation about App Sandbox: https://developer.apple.com/library/archive/documentation/Security/Conceptual/AppSandboxDesignGuide/AppSandboxInDepth/AppSandboxInDepth.html#/apple_ref/doc/uid/TP40011183-CH3-SW17</string>
			<key>pfm_title</key>
			<string>Custom Notification Icon</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Library/Application Support/Your Company/Logo.png</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Path to the status bar icon shown in the menu bar. Recommended: PNG, 16x16 points</string>
			<key>pfm_name</key>
			<string>StatusBarIcon</string>
			<key>pfm_note</key>
			<string>Some preference keys like the icon and status bar icon point to a file location. Due to the sandboxed characteristic of the app, not all file locations are allowed. We suggest putting the files in a folder within Application Support such as /Library/Application Support/Your Company/ where the app can read the contents. Other supported file locations can be found in Apple's documentation about App Sandbox: https://developer.apple.com/library/archive/documentation/Security/Conceptual/AppSandboxDesignGuide/AppSandboxInDepth/AppSandboxInDepth.html#/apple_ref/doc/uid/TP40011183-CH3-SW17</string>
			<key>pfm_title</key>
			<string>Custom Status Bar Icon</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Library/Application Support/Your Company/menubaricon.png</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Custom status bar icon using an SF Symbol. Ignored when StatusBarIcon is also set</string>
			<key>pfm_name</key>
			<string>StatusBarIconSFSymbol</string>
			<key>pfm_note</key>
			<string>For more info on how to use SF Symbols, checkout https://github.com/root3nl/SupportApp/#how-to-use-sf-symbols</string>
			<key>pfm_title</key>
			<string>Custom Status Bar Icon using SF Symbols</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>lifepreserver</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Shows a small notification badge in the Status Bar Icon when there is an Apple Software Update available or when the UptimeDaysLimit or PasswordExpiryLimit is reached</string>
			<key>pfm_name</key>
			<string>StatusBarIconNotifierEnabled</string>
			<key>pfm_title</key>
			<string>Notification badge in Status Bar Icon</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>HEX color in RGB format. Example: #8cc63f. Leave empty to use macOS Accent Color</string>
			<key>pfm_name</key>
			<string>CustomColor</string>
			<key>pfm_note</key>
			<string>Root3 recommends to not to use a very light color as text may become hard to read.</string>
			<key>pfm_title</key>
			<string>Custom Color</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>#8cc63f</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>HEX color in RGB format for Dark Mode. Example: #8cc63f. CustomColor is used when CustomColorDarkMode is not specified</string>
			<key>pfm_name</key>
			<string>CustomColorDarkMode</string>
			<key>pfm_note</key>
			<string>Root3 recommends to not to use a very dark color as text may become hard to read.</string>
			<key>pfm_title</key>
			<string>Custom Color Dark Mode</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>#8cc63f</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Hides the first row of configurable items.</string>
			<key>pfm_name</key>
			<string>HideFirstRow</string>
			<key>pfm_title</key>
			<string>Hide First Row</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Hides the second row of configurable items.</string>
			<key>pfm_name</key>
			<string>HideSecondRow</string>
			<key>pfm_title</key>
			<string>Hide Second Row</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Please contact IT</string>
			<key>pfm_description</key>
			<string>Shown when clicking an action results in an error</string>
			<key>pfm_name</key>
			<string>ErrorMessage</string>
			<key>pfm_title</key>
			<string>Custom error message</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>A welcome screen and feature explanation to show when the app is first opened</string>
			<key>pfm_name</key>
			<string>ShowWelcomeScreen</string>
			<key>pfm_title</key>
			<string>Welcome Screen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Shown at the bottom as footnote. Supports both text and Emoji. Markdown is supported for macOS Monterey and higher</string>
			<key>pfm_name</key>
			<string>FooterText</string>
			<key>pfm_title</key>
			<string>Footer text</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Provided by IT</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disabled by default. Launch Support (non-PKG) automatically at login and keep it open (macOS 13 and higher). This setting is ignored if a legacy LaunchAgent is installed/active. Keep disabled if you don't want to open Support at login or use your own LaunchAgent</string>
			<key>pfm_name</key>
			<string>OpenAtLogin</string>
			<key>pfm_title</key>
			<string>Automatically Support (non-PKG) at login</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>ComputerName</string>
			<key>pfm_description</key>
			<string>Info item shown in the upper left corner</string>
			<key>pfm_name</key>
			<string>InfoItemOne</string>
			<key>pfm_range_list</key>
			<array>
				<string>ComputerName</string>
				<string>MacOSVersion</string>
				<string>Network</string>
				<string>Password</string>
				<string>Storage</string>
				<string>Uptime</string>
				<string>ExtensionA</string>
				<string>ExtensionB</string>
				<string>AppCatalog</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Computer Name</string>
				<string>macOS Version</string>
				<string>Network</string>
				<string>Password</string>
				<string>Storage</string>
				<string>Uptime</string>
				<string>Extension A</string>
				<string>Extension B</string>
				<string>App Catalog</string>
			</array>
			<key>pfm_title</key>
			<string>Info item 1st tile</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>MacOSVersion</string>
			<key>pfm_description</key>
			<string>Info item shown in the upper right corner</string>
			<key>pfm_name</key>
			<string>InfoItemTwo</string>
			<key>pfm_range_list</key>
			<array>
				<string>ComputerName</string>
				<string>MacOSVersion</string>
				<string>Network</string>
				<string>Password</string>
				<string>Storage</string>
				<string>Uptime</string>
				<string>ExtensionA</string>
				<string>ExtensionB</string>
				<string>AppCatalog</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Computer Name</string>
				<string>macOS Version</string>
				<string>Network</string>
				<string>Password</string>
				<string>Storage</string>
				<string>Uptime</string>
				<string>Extension A</string>
				<string>Extension B</string>
				<string>App Catalog</string>
			</array>
			<key>pfm_title</key>
			<string>Info item 2nd tile</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Uptime</string>
			<key>pfm_description</key>
			<string>Info item shown in the second row left</string>
			<key>pfm_name</key>
			<string>InfoItemThree</string>
			<key>pfm_range_list</key>
			<array>
				<string>ComputerName</string>
				<string>MacOSVersion</string>
				<string>Network</string>
				<string>Password</string>
				<string>Storage</string>
				<string>Uptime</string>
				<string>ExtensionA</string>
				<string>ExtensionB</string>
				<string>AppCatalog</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Computer Name</string>
				<string>macOS Version</string>
				<string>Network</string>
				<string>Password</string>
				<string>Storage</string>
				<string>Uptime</string>
				<string>Extension A</string>
				<string>Extension B</string>
				<string>App Catalog</string>
			</array>
			<key>pfm_title</key>
			<string>Info item 3rd tile</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Storage</string>
			<key>pfm_description</key>
			<string>Info item shown in the second row right</string>
			<key>pfm_name</key>
			<string>InfoItemFour</string>
			<key>pfm_range_list</key>
			<array>
				<string>ComputerName</string>
				<string>MacOSVersion</string>
				<string>Network</string>
				<string>Password</string>
				<string>Storage</string>
				<string>Uptime</string>
				<string>ExtensionA</string>
				<string>ExtensionB</string>
				<string>AppCatalog</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Computer Name</string>
				<string>macOS Version</string>
				<string>Network</string>
				<string>Password</string>
				<string>Storage</string>
				<string>Uptime</string>
				<string>Extension A</string>
				<string>Extension B</string>
				<string>App Catalog</string>
			</array>
			<key>pfm_title</key>
			<string>Info item 4th tile</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Storage</string>
			<key>pfm_description</key>
			<string>Info item shown in the third row left</string>
			<key>pfm_name</key>
			<string>InfoItemFive</string>
			<key>pfm_range_list</key>
			<array>
				<string>ComputerName</string>
				<string>MacOSVersion</string>
				<string>Network</string>
				<string>Password</string>
				<string>Storage</string>
				<string>Uptime</string>
				<string>ExtensionA</string>
				<string>ExtensionB</string>
				<string>AppCatalog</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Computer Name</string>
				<string>macOS Version</string>
				<string>Network</string>
				<string>Password</string>
				<string>Storage</string>
				<string>Uptime</string>
				<string>Extension A</string>
				<string>Extension B</string>
				<string>App Catalog</string>
			</array>
			<key>pfm_title</key>
			<string>Info item 5th tile</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Storage</string>
			<key>pfm_description</key>
			<string>Info item shown in the third row right</string>
			<key>pfm_name</key>
			<string>InfoItemSix</string>
			<key>pfm_range_list</key>
			<array>
				<string>ComputerName</string>
				<string>MacOSVersion</string>
				<string>Network</string>
				<string>Password</string>
				<string>Storage</string>
				<string>Uptime</string>
				<string>ExtensionA</string>
				<string>ExtensionB</string>
				<string>AppCatalog</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Computer Name</string>
				<string>macOS Version</string>
				<string>Network</string>
				<string>Password</string>
				<string>Storage</string>
				<string>Uptime</string>
				<string>Extension A</string>
				<string>Extension B</string>
				<string>App Catalog</string>
			</array>
			<key>pfm_title</key>
			<string>Info item 6th tile</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>Days of uptime after which a notification badge is shown</string>
			<key>pfm_name</key>
			<string>UptimeDaysLimit</string>
			<key>pfm_title</key>
			<string>Maximum uptime in days</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>Days until password expiry after which a notification badge is shown</string>
			<key>pfm_name</key>
			<string>PasswordExpiryLimit</string>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Maximum password expiry in days</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Mac Password</string>
			<key>pfm_description</key>
			<string>Alternative text label shown in the Password info item</string>
			<key>pfm_name</key>
			<string>PasswordLabel</string>
			<key>pfm_title</key>
			<string>Password item label</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>Percentage of storage after which a notification badge is shown</string>
			<key>pfm_name</key>
			<string>StorageLimit</string>
			<key>pfm_title</key>
			<string>Maximum used storage percentage</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>%</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Remote Support</string>
			<key>pfm_description</key>
			<string>The text shown in the button label</string>
			<key>pfm_name</key>
			<string>FirstRowTitleLeft</string>
			<key>pfm_title</key>
			<string>First Row Left: Title</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Subtitle text will appear under title when the user hovers over the button. Ignored if left empty.</string>
			<key>pfm_name</key>
			<string>FirstRowSubtitleLeft</string>
			<key>pfm_title</key>
			<string>First Row Left: Subtitle</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Type of link the item should open. Can be anything like screen sharing tools, company stores, file servers or core applications in your organization. App by default.</string>
			<key>pfm_name</key>
			<string>FirstRowTypeLeft</string>
			<key>pfm_note</key>
			<string>DistributedNotification requires 'SupportHelper' to be installed.</string>
			<key>pfm_range_list</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>Command</string>
				<string>PrivilegedScript</string>
				<string>DistributedNotification</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>User Command</string>
				<string>Privileged Script</string>
				<string>Command or Script (deprecated as of v2.6, use Privileged Script)</string>
			</array>
			<key>pfm_title</key>
			<string>First Row Left: Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>FirstRowTypeLeft</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<string>com.apple.ScreenSharing</string>
			<key>pfm_description</key>
			<string>The Bundle Identifier of the app, link, command or path to script</string>
			<key>pfm_name</key>
			<string>FirstRowLinkLeft</string>
			<key>pfm_note</key>
			<string>App: Bundle Identifier of the app
URL: Link to a webpage or other links that would normaly work like PROTOCOL://URL
Command: Zsh command or path to a script. Be aware that this will be executed as the user and therefore has its limitations</string>
			<key>pfm_title</key>
			<string>First Row Left: Link</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>cursorarrow</string>
			<key>pfm_description</key>
			<string>The SF Symbol shown in the button</string>
			<key>pfm_name</key>
			<string>FirstRowSymbolLeft</string>
			<key>pfm_note</key>
			<string>For more info on how to use SF Symbols, checkout https://github.com/root3nl/SupportApp/#how-to-use-sf-symbols</string>
			<key>pfm_title</key>
			<string>First Row Left: SF Symbol name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Company Store</string>
			<key>pfm_description</key>
			<string>The text shown in the button label</string>
			<key>pfm_name</key>
			<string>FirstRowTitleMiddle</string>
			<key>pfm_title</key>
			<string>First Row Middle: Title</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Subtitle text will appear under title when the user hovers over the button. Ignored if left empty.</string>
			<key>pfm_name</key>
			<string>FirstRowSubtitleMiddle</string>
			<key>pfm_title</key>
			<string>First Row Middle: Subtitle</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Type of link the item should open. Can be anything like screen sharing tools, company stores, file servers or core applications in your organization. App by default.</string>
			<key>pfm_name</key>
			<string>FirstRowTypeMiddle</string>
			<key>pfm_note</key>
			<string>DistributedNotification requires 'SupportHelper' to be installed.</string>
			<key>pfm_range_list</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>Command</string>
				<string>PrivilegedScript</string>
				<string>DistributedNotification</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>User Command</string>
				<string>Privileged Script</string>
				<string>Command or Script (deprecated as of v2.6, use Privileged Script)</string>
			</array>
			<key>pfm_title</key>
			<string>First Row Middle: Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>FirstRowTypeRight</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<string>com.apple.ScreenSharing</string>
			<key>pfm_description</key>
			<string>The Bundle Identifier of the app, link, command or path to script</string>
			<key>pfm_name</key>
			<string>FirstRowLinkMiddle</string>
			<key>pfm_note</key>
			<string>App: Bundle Identifier of the app
URL: Link to a webpage or other links that would normaly work like PROTOCOL://URL
Command: Zsh command or path to a script. Be aware that this will be executed as the user and therefore has its limitations</string>
			<key>pfm_title</key>
			<string>First Row Middle: Link</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>cart.fill</string>
			<key>pfm_description</key>
			<string>The SF Symbol shown in the button</string>
			<key>pfm_name</key>
			<string>FirstRowSymbolMiddle</string>
			<key>pfm_note</key>
			<string>For more info on how to use SF Symbols, checkout https://github.com/root3nl/SupportApp/#how-to-use-sf-symbols</string>
			<key>pfm_title</key>
			<string>First Row Middle: SF Symbol name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Company Store</string>
			<key>pfm_description</key>
			<string>The text shown in the button label.</string>
			<key>pfm_name</key>
			<string>FirstRowTitleRight</string>
			<key>pfm_title</key>
			<string>First Row Right: Title</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Subtitle text will appear under title when the user hovers over the button. Ignored if left empty.</string>
			<key>pfm_name</key>
			<string>FirstRowSubtitleRight</string>
			<key>pfm_title</key>
			<string>First Row Right: Subtitle</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Type of link the item should open. Can be anything like screen sharing tools, company stores, file servers or core applications in your organization. App by default.</string>
			<key>pfm_name</key>
			<string>FirstRowTypeRight</string>
			<key>pfm_note</key>
			<string>DistributedNotification requires 'SupportHelper' to be installed.</string>
			<key>pfm_range_list</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>Command</string>
				<string>PrivilegedScript</string>
				<string>DistributedNotification</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>User Command</string>
				<string>Privileged Script</string>
				<string>Command or Script (deprecated as of v2.6, use Privileged Script)</string>
			</array>
			<key>pfm_title</key>
			<string>First Row Right: Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>FirstRowTypeRight</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<string>com.apple.ScreenSharing</string>
			<key>pfm_description</key>
			<string>The Bundle Identifier of the app, link, command or path to script</string>
			<key>pfm_name</key>
			<string>FirstRowLinkRight</string>
			<key>pfm_note</key>
			<string>App: Bundle Identifier of the app
URL: Link to a webpage or other links that would normaly work like PROTOCOL://URL
Command: Zsh command or path to a script. Be aware that this will be executed as the user and therefore has its limitations</string>
			<key>pfm_title</key>
			<string>First Row Right: Link</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>cart.fill</string>
			<key>pfm_description</key>
			<string>The SF Symbol shown in the button.</string>
			<key>pfm_name</key>
			<string>FirstRowSymbolRight</string>
			<key>pfm_note</key>
			<string>For more info on how to use SF Symbols, checkout https://github.com/root3nl/SupportApp/#how-to-use-sf-symbols</string>
			<key>pfm_title</key>
			<string>First Row Right: SF Symbol name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Support Ticket</string>
			<key>pfm_description</key>
			<string>The text shown in the button label.</string>
			<key>pfm_name</key>
			<string>SecondRowTitleLeft</string>
			<key>pfm_title</key>
			<string>Second Row Left: Title</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Create ticket</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Subtitle text will replace the title when the user hovers over the button. Ignored if left empty.</string>
			<key>pfm_name</key>
			<string>SecondRowSubtitleLeft</string>
			<key>pfm_title</key>
			<string>Second Row Left: Subtitle</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Type of link the item should open. Can be anything like screen sharing tools, company stores, file servers or core applications in your organization. URL by default.</string>
			<key>pfm_name</key>
			<string>SecondRowTypeLeft</string>
			<key>pfm_note</key>
			<string>DistributedNotification requires 'SupportHelper' to be installed.</string>
			<key>pfm_range_list</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>Command</string>
				<string>PrivilegedScript</string>
				<string>DistributedNotification</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>User Command</string>
				<string>Privileged Script</string>
				<string>Command or Script (deprecated as of v2.6, use Privileged Script)</string>
			</array>
			<key>pfm_title</key>
			<string>Second Row Left: Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>SecondRowTypeLeft</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<string>com.apple.ScreenSharing</string>
			<key>pfm_description</key>
			<string>The Bundle Identifier of the app, link, command or path to script.</string>
			<key>pfm_name</key>
			<string>SecondRowLinkLeft</string>
			<key>pfm_note</key>
			<string>App: Bundle Identifier of the app
URL: Link to a webpage or other links that would normaly work like PROTOCOL://URL
Command: Zsh command or path to a script. Be aware that this will be executed as the user and therefore has its limitations</string>
			<key>pfm_title</key>
			<string>Second Row Left: Link</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>ticket</string>
			<key>pfm_description</key>
			<string>The SF Symbol shown in the button.</string>
			<key>pfm_name</key>
			<string>SecondRowSymbolLeft</string>
			<key>pfm_note</key>
			<string>For more info on how to use SF Symbols, checkout https://github.com/root3nl/SupportApp/#how-to-use-sf-symbols</string>
			<key>pfm_title</key>
			<string>Second Row Left: SF Symbol name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Email</string>
			<key>pfm_description</key>
			<string>The text shown in the button label.</string>
			<key>pfm_name</key>
			<string>SecondRowTitleMiddle</string>
			<key>pfm_title</key>
			<string>Second Row Middle: Title</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Subtitle text will replace the title when the user hovers over the button. Ignored if left empty.</string>
			<key>pfm_name</key>
			<string>SecondRowSubtitleMiddle</string>
			<key>pfm_title</key>
			<string>Second Row Middle: Subtitle</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Type of link the item should open. Can be anything like screen sharing tools, company stores, file servers or core applications in your organization. URL by default.</string>
			<key>pfm_name</key>
			<string>SecondRowTypeMiddle</string>
			<key>pfm_note</key>
			<string>DistributedNotification requires 'SupportHelper' to be installed.</string>
			<key>pfm_range_list</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>Command</string>
				<string>PrivilegedScript</string>
				<string>DistributedNotification</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>User Command</string>
				<string>Privileged Script</string>
				<string>Command or Script (deprecated as of v2.6, use Privileged Script)</string>
			</array>
			<key>pfm_title</key>
			<string>Second Row Middle: Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>SecondRowTypeMiddle</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<string>com.apple.ScreenSharing</string>
			<key>pfm_description</key>
			<string>The Bundle Identifier of the app, link, command or path to script.</string>
			<key>pfm_name</key>
			<string>SecondRowLinkMiddle</string>
			<key>pfm_note</key>
			<string>App: Bundle Identifier of the app
URL: Link to a webpage or other links that would normaly work like PROTOCOL://URL
Command: Zsh command or path to a script. Be aware that this will be executed as the user and therefore has its limitations</string>
			<key>pfm_title</key>
			<string>Second Row Middle: Link</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>envelope</string>
			<key>pfm_description</key>
			<string>The SF Symbol shown in the button.</string>
			<key>pfm_name</key>
			<string>SecondRowSymbolMiddle</string>
			<key>pfm_note</key>
			<string>For more info on how to use SF Symbols, checkout https://github.com/root3nl/SupportApp/#how-to-use-sf-symbols</string>
			<key>pfm_title</key>
			<string>Second Row Middle: SF Symbol name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Phone</string>
			<key>pfm_description</key>
			<string>The text shown in the button label.</string>
			<key>pfm_name</key>
			<string>SecondRowTitleRight</string>
			<key>pfm_title</key>
			<string>Second Row Right: Title</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Subtitle text will replace the title when the user hovers over the button. Ignored if left empty.</string>
			<key>pfm_name</key>
			<string>SecondRowSubtitleRight</string>
			<key>pfm_title</key>
			<string>Second Row Right: Subtitle</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Type of link the item should open. Can be anything like screen sharing tools, company stores, file servers or core applications in your organization. URL by default.</string>
			<key>pfm_name</key>
			<string>SecondRowTypeRight</string>
			<key>pfm_note</key>
			<string>DistributedNotification requires 'SupportHelper' to be installed.</string>
			<key>pfm_range_list</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>Command</string>
				<string>PrivilegedScript</string>
				<string>DistributedNotification</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>User Command</string>
				<string>Privileged Script</string>
				<string>Command or Script (deprecated as of v2.6, use Privileged Script)</string>
			</array>
			<key>pfm_title</key>
			<string>Second Row Right: Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>SecondRowTypeRight</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<string>com.apple.ScreenSharing</string>
			<key>pfm_description</key>
			<string>The Bundle Identifier of the app, link, command or path to script.</string>
			<key>pfm_name</key>
			<string>SecondRowLinkRight</string>
			<key>pfm_note</key>
			<string>App: Bundle Identifier of the app
URL: Link to a webpage or other links that would normaly work like PROTOCOL://URL
Command: Zsh command or path to a script. Be aware that this will be executed as the user and therefore has its limitations</string>
			<key>pfm_title</key>
			<string>Second Row Right: Link</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>phone</string>
			<key>pfm_description</key>
			<string>The SF Symbol shown in the button.</string>
			<key>pfm_name</key>
			<string>SecondRowSymbolRight</string>
			<key>pfm_note</key>
			<string>For more info on how to use SF Symbols, checkout https://github.com/root3nl/SupportApp/#how-to-use-sf-symbols</string>
			<key>pfm_title</key>
			<string>Second Row Right: SF Symbol name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.4</string>
			<key>pfm_description</key>
			<string>The text shown in the Extension.</string>
			<key>pfm_name</key>
			<string>ExtensionTitleA</string>
			<key>pfm_title</key>
			<string>Extension Title A</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Last Check-In</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.4</string>
			<key>pfm_description</key>
			<string>The SF Symbol shown in the Extension.</string>
			<key>pfm_name</key>
			<string>ExtensionSymbolA</string>
			<key>pfm_title</key>
			<string>Extension SF Symbol A</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>clock.badge.checkmark.fill</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.4</string>
			<key>pfm_default</key>
			<string>App</string>
			<key>pfm_description</key>
			<string>Type of link the Extension should open.</string>
			<key>pfm_name</key>
			<string>ExtensionTypeA</string>
			<key>pfm_note</key>
			<string>DistributedNotification requires 'SupportHelper' to be installed.</string>
			<key>pfm_range_list</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>Command</string>
				<string>PrivilegedScript</string>
				<string>DistributedNotification</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>User Command</string>
				<string>Privileged Script</string>
				<string>Command or Script (deprecated as of v2.6, use Privileged Script)</string>
			</array>
			<key>pfm_title</key>
			<string>Extension Link Type A</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.4</string>
			<key>pfm_description</key>
			<string>The Bundle Identifier of the app, link, command or path to script.</string>
			<key>pfm_name</key>
			<string>ExtensionLinkA</string>
			<key>pfm_title</key>
			<string>Extension Link A</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>defaults write /Library/Preferences/nl.root3.support.plist ExtensionLoadingA -bool true; /usr/local/bin/jamf policy; /usr/local/bin/jamf_last_check-in_time.zsh</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.4</string>
			<key>pfm_description</key>
			<string>The text shown in the Extension.</string>
			<key>pfm_name</key>
			<string>ExtensionTitleB</string>
			<key>pfm_title</key>
			<string>Extension Title B</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Last Check-In</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.4</string>
			<key>pfm_description</key>
			<string>The SF Symbol shown in the Extension.</string>
			<key>pfm_name</key>
			<string>ExtensionSymbolB</string>
			<key>pfm_title</key>
			<string>Extension SF Symbol B</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>clock.badge.checkmark.fill</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.4</string>
			<key>pfm_default</key>
			<string>App</string>
			<key>pfm_description</key>
			<string>Type of link the Extension should open</string>
			<key>pfm_name</key>
			<string>ExtensionTypeB</string>
			<key>pfm_note</key>
			<string>DistributedNotification requires 'SupportHelper' to be installed.</string>
			<key>pfm_range_list</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>Command</string>
				<string>PrivilegedScript</string>
				<string>DistributedNotification</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>App</string>
				<string>URL</string>
				<string>User Command</string>
				<string>Privileged Script</string>
				<string>Command or Script (deprecated as of v2.6, use Privileged Script)</string>
			</array>
			<key>pfm_title</key>
			<string>Extension Link Type B</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.4</string>
			<key>pfm_description</key>
			<string>The Bundle Identifier of the app, link, command or path to script.</string>
			<key>pfm_name</key>
			<string>ExtensionLinkB</string>
			<key>pfm_title</key>
			<string>Extension Link B</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>defaults write /Library/Preferences/nl.root3.support.plist ExtensionLoadingA -bool true; /usr/local/bin/jamf policy; /usr/local/bin/jamf_last_check-in_time.zsh</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.4.3</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Ignore macOS major updates. This will prevent the menu bar icon and the macOS version info item from showing an available major update.</string>
			<key>pfm_macos_min</key>
			<string>12.3</string>
			<key>pfm_name</key>
			<string>HideMajorUpdates</string>
			<key>pfm_title</key>
			<string>Hide Major macOS Updates / Upgrades</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Optional text to shown in the macOS Managed Updates popover to tell users about the updates</string>
			<key>pfm_name</key>
			<string>UpdateText</string>
			<key>pfm_title</key>
			<string>Update Text</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Hide the first row with Info Items</string>
			<key>pfm_name</key>
			<string>HideFirstRowInfoItems</string>
			<key>pfm_title</key>
			<string>Hide first row Info Items</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Hide the second row with Info Items</string>
			<key>pfm_name</key>
			<string>HideSecondRowInfoItems</string>
			<key>pfm_title</key>
			<string>Hide second row Info Items</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Hide the third row with Info Items</string>
			<key>pfm_name</key>
			<string>HideThirdRowInfoItems</string>
			<key>pfm_title</key>
			<string>Hide third row Info Items</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Hide the first row with configurable items</string>
			<key>pfm_name</key>
			<string>HideFirstRowButtons</string>
			<key>pfm_title</key>
			<string>Hide first row configurable buttons</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Hide the second row with configurable items</string>
			<key>pfm_name</key>
			<string>HideSecondRowButtons</string>
			<key>pfm_title</key>
			<string>Hide second row configurable buttons</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Password expiry information source: Apple (local account or AD), Jamf Connect or Kerberos SSO Extension</string>
			<key>pfm_name</key>
			<string>PasswordType</string>
			<key>pfm_range_list</key>
			<array>
				<string>Apple</string>
				<string>JamfConnect</string>
				<string>KerberosSSO</string>
				<string>Nomad</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Apple</string>
				<string> Jamf Connect</string>
				<string>Kerberos SSO Extension</string>
				<string>NoMAD</string>
			</array>
			<key>pfm_title</key>
			<string>Password type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Path to script script or command to be executed when the Support App is opened by clicking on the menu bar item.</string>
			<key>pfm_name</key>
			<string>OnAppearAction</string>
			<key>pfm_title</key>
			<string>On Appear Script/Command</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Option to enable or disable the Privileged Helper Tool. Re-enabling requires the reinstallation of the Support App.</string>
			<key>pfm_name</key>
			<string>DisablePrivilegedHelperTool</string>
			<key>pfm_title</key>
			<string>Enable or Disable Privileged Helper Tool</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>SupportApp by Root3</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>4</integer>
</dict>
</plist>
