<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://www.mozilla.org/firefox</string>
	<key>pfm_description</key>
	<string>Configures Firefox settings</string>
	<key>pfm_distribution</key>
	<array>
		<string>Manual</string>
		<string>Push</string>
	</array>
	<key>pfm_documentation_url</key>
	<string>https://github.com/mozilla/policy-templates/tree/master/mac</string>
	<key>pfm_domain</key>
	<string>org.mozilla.firefox</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>undefined</string>
	<key>pfm_last_modified</key>
	<date>2020-01-29T15:30:11Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Firefox settings</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Firefox</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>org.mozilla.firefox</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>org.mozilla.firefox</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF).</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>63</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Enable policy support on macOS.</string>
			<key>pfm_description_reference</key>
			<string>macOS defaults takes precedence over JSON policies (an alternative method to manage Firefox preferences). This preference must be set to true in macOS defaults in order to manage Firefox preferences through macOS defaults (configuration profile, plist, etc.). Once this value is set to true, JSON policies set through a policies.json config file (e.g. /Applications/Firefox.app/Contents/Resources/distribution/policies.json) are disabled even if no other policies are set in macOS defaults (this configuration profile).</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#enterprisepoliciesenabled</string>
			<key>pfm_name</key>
			<string>EnterprisePoliciesEnabled</string>
			<key>pfm_note</key>
			<string>macOS defaults takes precedence over JSON policies (an alternative method to manage Firefox preferences). This preference must be set to true in macOS defaults in order to manage Firefox preferences through macOS defaults (configuration profile, plist, etc.). Once this value is set to true, JSON policies set through a policies.json config file (e.g. /Applications/Firefox.app/Contents/Resources/distribution/policies.json) are disabled even if no other policies are set in macOS defaults (this configuration profile).</string>
			<key>pfm_required</key>
			<true/>
			<key>pfm_title</key>
			<string>Enable Enterprise Policies</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Network</string>
				<string>Privacy</string>
				<string>Security</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>General</key>
				<array>
					<string>General_SegmentedControl</string>
					<string>AppUpdateURL</string>
					<string>Authentication</string>
					<string>BlockAboutConfig</string>
					<string>BlockAboutProfiles</string>
					<string>BlockAboutSupport</string>
					<string>DefaultDownloadDirectory</string>
					<string>DisableAppUpdate</string>
					<string>DisableBuiltinPDFViewer</string>
					<string>DisableDeveloperTools</string>
					<string>DisableFeedbackCommands</string>
					<string>DisableFirefoxAccounts</string>
					<string>DisableFirefoxScreenshots</string>
					<string>DisableFirefoxStudies</string>
					<string>DisableForgetButton</string>
					<string>DisableMasterPasswordCreation</string>
					<string>DisplayMenuBar</string>
					<string>DisablePocket</string>
					<string>DisablePrivateBrowsing</string>
					<string>DisableProfileImport</string>
					<string>DisableProfileRefresh</string>
					<string>DisableSafeMode</string>
					<string>DisableSetDesktopBackground</string>
					<string>DontCheckDefaultBrowser</string>
					<string>DownloadDirectory</string>
					<string>FirefoxHome</string>
					<string>HardwareAcceleration</string>
					<string>Homepage</string>
					<string>LinkLocalFiles</string>
					<string>NewTabPage</string>
					<string>OverrideFirstRunPage</string>
					<string>OverridePostUpdatePage</string>
					<string>PromptForDownloadLocation</string>
					<string>SanitizeOnShutdown</string>
					<string>SearchBar</string>
					<!--Bookmarks Pane -->
					<string>Bookmarks</string>
					<string>DisplayBookmarksToolbar</string>
					<string>NoDefaultBookmarks</string>
					<!--Extensions/Addons Pane -->
					<string>Extensions</string>
					<string>ExtensionSettings</string>
					<string>ExtensionUpdate</string>
					<string>BlockAboutAddons</string>
					<string>DisableSystemAddonUpdate</string>
					<!--Locales Pane -->
					<string>RequestedLocales</string>
					<!--Other Preferences Pane -->
					<string>Preferences</string>
					<string>SupportMenu</string>
				</array>
				<key>Network</key>
				<array>
					<string>DNSOverHTTPS</string>
					<string>NetworkPrediction</string>
					<string>Proxy</string>
					<string>SSLVersionMax</string>
					<string>SSLVersionMin</string>
				</array>
				<key>Privacy</key>
				<array>
					<string>Privacy_SegmentedControl</string>
					<string>Cookies</string>
					<string>DisableFormHistory</string>
					<string>DisablePasswordReveal</string>
					<string>DisableTelemetry</string>
					<string>EnableTrackingProtection</string>
					<string>FlashPlugin</string>
					<string>InstallAddonsPermission</string>
					<string>OfferToSaveLogins</string>
					<string>OfferToSaveLoginsDefault</string>
					<string>PasswordManagerEnabled</string>
					<string>Permissions</string>
					<string>PopupBlocking</string>
				</array>
				<key>Security</key>
				<array>
					<string>Security_SegmentedControl</string>
					<string>CaptivePortal</string>
					<string>Certificates</string>
					<string>DisableSecurityBypass</string>
					<string>SecurityDevices</string>
					<string>WebsiteFilter</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>General_SegmentedControl</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Add-ons</string>
				<string>Bookmarks</string>
				<string>Languages</string>
				<string>Other Preferences</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Add-ons</key>
				<array>
					<string>Extensions</string>
					<string>ExtensionSettings</string>
					<string>ExtensionUpdate</string>
					<string>BlockAboutAddons</string>
					<string>DisableSystemAddonUpdate</string>
				</array>
				<key>Bookmarks</key>
				<array>
					<string>Bookmarks</string>
					<string>DisplayBookmarksToolbar</string>
					<string>NoDefaultBookmarks</string>
				</array>
				<key>General</key>
				<array>
					<string>AppUpdateURL</string>
					<string>Authentication</string>
					<string>BlockAboutConfig</string>
					<string>BlockAboutProfiles</string>
					<string>BlockAboutSupport</string>
					<string>DefaultDownloadDirectory</string>
					<string>DisableAppUpdate</string>
					<string>DisableBuiltinPDFViewer</string>
					<string>DisableDeveloperTools</string>
					<string>DisableFeedbackCommands</string>
					<string>DisableFirefoxAccounts</string>
					<string>DisableFirefoxScreenshots</string>
					<string>DisableFirefoxStudies</string>
					<string>DisableForgetButton</string>
					<string>DisableMasterPasswordCreation</string>
					<string>DisablePocket</string>
					<string>DisablePrivateBrowsing</string>
					<string>DisableProfileImport</string>
					<string>DisableProfileRefresh</string>
					<string>DisableSafeMode</string>
					<string>DisableSetDesktopBackground</string>
					<string>DisplayMenuBar</string>
					<string>DontCheckDefaultBrowser</string>
					<string>DownloadDirectory</string>
					<string>FirefoxHome</string>
					<string>HardwareAcceleration</string>
					<string>Homepage</string>
					<string>LinkLocalFiles</string>
					<string>NewTabPage</string>
					<string>OverrideFirstRunPage</string>
					<string>OverridePostUpdatePage</string>
					<string>PromptForDownloadLocation</string>
					<string>SanitizeOnShutdown</string>
					<string>SearchBar</string>
				</array>
				<key>Languages</key>
				<array>
					<string>RequestedLocales</string>
				</array>
				<key>Other Preferences</key>
				<array>
					<string>Preferences</string>
					<string>SupportMenu</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>Privacy_SegmentedControl</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Cookies</string>
				<string>Permissions</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Cookies</key>
				<array>
					<string>Cookies</string>
				</array>
				<key>General</key>
				<array>
					<string>DisableFormHistory</string>
					<string>DisablePasswordReveal</string>
					<string>DisableTelemetry</string>
					<string>EnableTrackingProtection</string>
					<string>OfferToSaveLogins</string>
					<string>OfferToSaveLoginsDefault</string>
					<string>PasswordManagerEnabled</string>
				</array>
				<key>Permissions</key>
				<array>
					<string>FlashPlugin</string>
					<string>InstallAddonsPermission</string>
					<string>Permissions</string>
					<string>PopupBlocking</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>Security_SegmentedControl</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Certificates</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Certificates</key>
				<array>
					<string>Certificates</string>
				</array>
				<key>General</key>
				<array>
					<string>CaptivePortal</string>
					<string>DisableSecurityBypass</string>
					<string>SecurityDevices</string>
					<string>WebsiteFilter</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>62</string>
			<key>pfm_description</key>
			<string>Change the URL for application update.</string>
			<key>pfm_description_reference</key>
			<string>This preference is for changing the URL used for application update. E.g. https://www.example.com/update.xml

For more information on setting up your own update server: https://developer.mozilla.org/docs/Mozilla/Setting_up_an_update_server</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#AppUpdateURL</string>
			<key>pfm_name</key>
			<string>AppUpdateURL</string>
			<key>pfm_note</key>
			<string>For more information on setting up your own update server: https://developer.mozilla.org/docs/Mozilla/Setting_up_an_update_server</string>
			<key>pfm_title</key>
			<string>Application Update URL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://www.yoursite.com/update.xml</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_description</key>
			<string>Configure sites that support integrated authentication.</string>
			<key>pfm_description_reference</key>
			<string>This preference is for configuring sites that support integrated authentication. See https://developer.mozilla.org/en-US/docs/Mozilla/Integrated_authentication for more information.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#Authentication</string>
			<key>pfm_name</key>
			<string>Authentication</string>
			<key>pfm_note</key>
			<string>See https://developer.mozilla.org/en-US/docs/Mozilla/Integrated_authentication for more information.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>If this preference is enabled, the specified websites are permitted to engage in SPNEGO authentication with the browser. Entries in the list are formatted as mydomain.com or https://myotherdomain.com.

If this preference is disabled or not configured, no websites are permitted to engage in SPNEGO authentication with the browser.

For more information, see https://developer.mozilla.org/en-US/docs/Mozilla/Integrated_authentication.
						</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, the specified websites are permitted to engage in SPNEGO authentication with the browser. Entries in the list are formatted as mydomain.com or https://myotherdomain.com.

If this preference is disabled or not configured, no websites are permitted to engage in SPNEGO authentication with the browser.

For more information, see https://developer.mozilla.org/en-US/docs/Mozilla/Integrated_authentication.
						</string>
					<key>pfm_name</key>
					<string>SPNEGO</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Domain</string>
							<key>pfm_title</key>
							<string>Domain</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://example.org</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>SPNEGO</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If this preference is enabled, the browser may delegate user authorization to the server for the specified websites. Entries in the list are formatted as mydomain.com or https://myotherdomain.com.

If this preference is disabled or not configured, the browser will not delegate user authorization to the server for any websites.

For more information, see https://developer.mozilla.org/en-US/docs/Mozilla/Integrated_authentication
						</string>
					<key>pfm_description_reference</key>
					<string>
							Optional. If this preference is enabled, the browser may delegate user authorization to the server for the specified websites. Entries in the list are formatted as mydomain.com or https://myotherdomain.com.

							If this preference is disabled or not configured, the browser will not delegate user authorization to the server for any websites.

							For more information, see https://developer.mozilla.org/en-US/docs/Mozilla/Integrated_authentication
						</string>
					<key>pfm_name</key>
					<string>Delegated</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Domain</string>
							<key>pfm_title</key>
							<string>Domain</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://example.org</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Delegated</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If this preference is enabled, the specified websites are trusted to use NTLM authentification. Entries in the list are formatted as mydomain.com or https://myotherdomain.com.

If this policy is disabled or not configured, no websites are trusted to use NTLM authentification.

For more information, see https://developer.mozilla.org/en-US/docs/Mozilla/Integrated_authentication.
						</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, the specified websites are trusted to use NTLM authentification. Entries in the list are formatted as mydomain.com or https://myotherdomain.com.

							If this policy is disabled or not configured, no websites are trusted to use NTLM authentification.

							For more information, see https://developer.mozilla.org/en-US/docs/Mozilla/Integrated_authentication.
						</string>
					<key>pfm_name</key>
					<string>NTLM</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Domain</string>
							<key>pfm_title</key>
							<string>Domain</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://example.org</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>NTLM</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If this preference is enabled, you can always allow SPNEGO or NTLM on non FQDNs (fully qualified domain names). If this preference is disabled or not configured, NTLM and SPNEGO are not enabled on non FQDNs.</string>
					<key>pfm_description_reference</key>
					<string>If this preference is enabled, you can always allow SPNEGO or NTLM on non FQDNs (fully qualified domain names). If this preference is disabled or not configured, NTLM and SPNEGO are not enabled on non FQDNs.</string>
					<key>pfm_name</key>
					<string>AllowNonFQDN</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_name</key>
							<string>NTLM</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_name</key>
							<string>SPNEGO</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Block access to the Add-ons Manager (about:addons).</string>
			<key>pfm_description_reference</key>
			<string>This preference removes access to about:addons.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#blockaboutaddons</string>
			<key>pfm_name</key>
			<string>BlockAboutAddons</string>
			<key>pfm_title</key>
			<string>Block about:addons page</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Block access to about:config.</string>
			<key>pfm_description_reference</key>
			<string>This preference removes access to about:config.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#blockaboutconfig</string>
			<key>pfm_name</key>
			<string>BlockAboutConfig</string>
			<key>pfm_title</key>
			<string>Block about:config page</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Block access to About Profiles (about:profiles).</string>
			<key>pfm_description_reference</key>
			<string>This preference removes access to about:profiles.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#blockaboutprofiles</string>
			<key>pfm_name</key>
			<string>BlockAboutProfiles</string>
			<key>pfm_title</key>
			<string>Block about:profiles page</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Block access to Troubleshooting Information (about:support).</string>
			<key>pfm_description_reference</key>
			<string>This preference removes access to about:support.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#blockaboutsupport</string>
			<key>pfm_name</key>
			<string>BlockAboutSupport</string>
			<key>pfm_title</key>
			<string>Block about:support page</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_description</key>
			<string>Add bookmarks in either the bookmarks toolbar or menu.</string>
			<key>pfm_description_reference</key>
			<string>Add bookmarks in either the bookmarks toolbar or menu. Only Title and URL are required. If Placement is not specified, the bookmark will be placed on the toolbar. If Folder is specified, it is automatically created and bookmarks with the same folder name are grouped together.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#bookmarks</string>
			<key>pfm_name</key>
			<string>Bookmarks</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>Bookmarks</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Bookmark Title</string>
							<key>pfm_name</key>
							<string>Title</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>Example Title</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Full URL to be bookmarked (e.g. https://www.example.org/)</string>
							<key>pfm_description_reference</key>
							<string>Full URL to be bookmarked (e.g. https://www.example.org/)</string>
							<key>pfm_name</key>
							<string>URL</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://www.example.org</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Place bookmark in either the Bookmark menu or Bookmark Toolbar.</string>
							<key>pfm_description_reference</key>
							<string>Place bookmark in either the Bookmark menu or Bookmark Toolbar.</string>
							<key>pfm_name</key>
							<string>Placement</string>
							<key>pfm_range_list</key>
							<array>
								<string>toolbar</string>
								<string>menu</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>toolbar</string>
								<string>menu</string>
							</array>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>URL to icon file to display on bookmark (e.g. https://www.example.org/favicon.ico)</string>
							<key>pfm_description_reference</key>
							<string>URL to icon file to display on bookmark (e.g. https://www.example.org/favicon.ico)</string>
							<key>pfm_name</key>
							<string>Favicon</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://www.example.org/favicon.ico</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Folder to place bookmark in. If a folder is specified, it is automatically created and bookmarks with the same folder name are grouped together. You cannot nest folders.</string>
							<key>pfm_description_reference</key>
							<string>Folder to place bookmark in. If a folder is specified, it is automatically created and bookmarks with the same folder name are grouped together. You cannot nest folders.</string>
							<key>pfm_name</key>
							<string>Folder</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>ExampleFolder</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>68</string>
			<key>pfm_description</key>
			<string>Set the default download directory.</string>
			<key>pfm_description_reference</key>
			<string>Set the default download directory.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#defaultdownloaddirectory</string>
			<key>pfm_name</key>
			<string>DefaultDownloadDirectory</string>
			<key>pfm_note</key>
			<string>You can use ${home} for the native home directory.</string>
			<key>pfm_title</key>
			<string>Default Download Directory</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>${home}/Downloads</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Turn off application updates.</string>
			<key>pfm_description_reference</key>
			<string>This preference turns off application updates.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disableappupdate</string>
			<key>pfm_name</key>
			<string>DisableAppUpdate</string>
			<key>pfm_title</key>
			<string>Disable Application Update</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the built in PDF viewer. PDF files are downloaded and sent externally.</string>
			<key>pfm_description_reference</key>
			<string>This preference disables the built in PDF viewer. PDF files are downloaded and sent externally.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disablebuiltinpdfviewer</string>
			<key>pfm_name</key>
			<string>DisableBuiltinPDFViewer</string>
			<key>pfm_title</key>
			<string>Disable Built-in PDF Viewer</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Remove access to all developer tools.</string>
			<key>pfm_description_reference</key>
			<string>This preference removes access to all developer tools.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disabledevelopertools</string>
			<key>pfm_name</key>
			<string>DisableDeveloperTools</string>
			<key>pfm_title</key>
			<string>Disable Developer Tools</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the menus for reporting sites (Submit Feedback, Report Deceptive Site).</string>
			<key>pfm_description_reference</key>
			<string>This preference disables the menus for reporting sites (Submit Feedback, Report Deceptive Site).</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disablefeedbackcommands</string>
			<key>pfm_name</key>
			<string>DisableFeedbackCommands</string>
			<key>pfm_title</key>
			<string>Disable Feedback Commands</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable Firefox Accounts integration (Sync).</string>
			<key>pfm_description_reference</key>
			<string>This preference disables Sync.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disablefirefoxaccounts</string>
			<key>pfm_name</key>
			<string>DisableFirefoxAccounts</string>
			<key>pfm_title</key>
			<string>Disable Firefox Accounts / Sync</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Remove access to Firefox Screenshots.</string>
			<key>pfm_description_reference</key>
			<string>This preference removes access to Firefox Screenshots.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disablefirefoxscreenshots</string>
			<key>pfm_name</key>
			<string>DisableFirefoxScreenshots</string>
			<key>pfm_title</key>
			<string>Disable Firefox Screenshots</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable Firefox studies (Shield).</string>
			<key>pfm_description_reference</key>
			<string>This preference disables Firefox studies (Shield).</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disablefirefoxstudies</string>
			<key>pfm_name</key>
			<string>DisableFirefoxStudies</string>
			<key>pfm_title</key>
			<string>Disable Firefox Studies (Shield)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the "Forget" button.</string>
			<key>pfm_description_reference</key>
			<string>This preference disables the "Forget" button.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disableforgetbutton</string>
			<key>pfm_name</key>
			<string>DisableForgetButton</string>
			<key>pfm_title</key>
			<string>Disable Forget Button</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Remove the master password functionality.</string>
			<key>pfm_description_reference</key>
			<string>If this preference is set to true, the master password functionality is removed.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disablemasterpasswordcreation</string>
			<key>pfm_name</key>
			<string>DisableMasterPasswordCreation</string>
			<key>pfm_title</key>
			<string>Disable Master Password Creation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Remove Pocket in the Firefox UI.</string>
			<key>pfm_description_reference</key>
			<string>This preference turns off Pocket.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disablepocket</string>
			<key>pfm_name</key>
			<string>DisablePocket</string>
			<key>pfm_note</key>
			<string>This does not remove it from the new tab page.</string>
			<key>pfm_title</key>
			<string>Disable Pocket</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Remove access to private browsing.</string>
			<key>pfm_description_reference</key>
			<string>This preference removes access to private browsing.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disableprivatebrowsing</string>
			<key>pfm_name</key>
			<string>DisablePrivateBrowsing</string>
			<key>pfm_title</key>
			<string>Disable Private Browsing</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disables the "Import data from another browser" option in the bookmarks window.</string>
			<key>pfm_description_reference</key>
			<string>This preference disables the "Import data from another browser" option in the bookmarks window.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disableprofileimport</string>
			<key>pfm_name</key>
			<string>DisableProfileImport</string>
			<key>pfm_title</key>
			<string>Disable Profile Import</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the Refresh Firefox button on about:support and support.mozilla.org, as well as the prompt that displays offering to refresh Firefox when you haven't used it in a while.</string>
			<key>pfm_description_reference</key>
			<string>This preference disables the Refresh Firefox button on about:support and support.mozilla.org.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disableprofilerefresh</string>
			<key>pfm_name</key>
			<string>DisableProfileRefresh</string>
			<key>pfm_title</key>
			<string>Disable Profile Refresh</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable safe mode within the browser.</string>
			<key>pfm_description_reference</key>
			<string>This policy disables safe mode.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disablesafemode</string>
			<key>pfm_name</key>
			<string>DisableSafeMode</string>
			<key>pfm_title</key>
			<string>Disable Safe Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>This preference removes the "Set As Desktop Background..." menu item when right clicking on an image.</string>
			<key>pfm_description_reference</key>
			<string>This preference removes the "Set As Desktop Background..." menu item when right clicking on an image.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disablesetdesktopbackground</string>
			<key>pfm_name</key>
			<string>DisableSetDesktopBackground</string>
			<key>pfm_title</key>
			<string>Disable Set Desktop Background</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Set the initial state of the menubar. A user can still hide it and it will stay hidden.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#displaymenubar</string>
			<key>pfm_name</key>
			<string>DisplayMenuBar</string>
			<key>pfm_title</key>
			<string>Display Menu Bar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Prevent system add-ons from being installed or update.</string>
			<key>pfm_description_reference</key>
			<string>This preference prevents system add-ons from being updated or installed.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disablesystemaddonupdate</string>
			<key>pfm_name</key>
			<string>DisableSystemAddonUpdate</string>
			<key>pfm_title</key>
			<string>Disable System Add-on Update</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Set the initial state of the bookmarks toolbar. A user can still hide it and it will stay hidden.</string>
			<key>pfm_description_reference</key>
			<string>This preference turns on the bookmarks toolbar by default. A user can still turn it off, and it will stay off.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#displaybookmarkstoolbar</string>
			<key>pfm_name</key>
			<string>DisplayBookmarksToolbar</string>
			<key>pfm_title</key>
			<string>Display Bookmarks Toolbar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Don't check if Firefox is the default browser at startup.</string>
			<key>pfm_description_reference</key>
			<string>This preference stops Firefox from checking if it is the default browser at startup.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#dontcheckdefaultbrowser</string>
			<key>pfm_name</key>
			<string>DontCheckDefaultBrowser</string>
			<key>pfm_title</key>
			<string>Do Not Check Default Browser</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>68</string>
			<key>pfm_description</key>
			<string>Set and lock the download directory.</string>
			<key>pfm_description_reference</key>
			<string>Set and lock the download directory.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#downloaddirectory</string>
			<key>pfm_name</key>
			<string>DownloadDirectory</string>
			<key>pfm_note</key>
			<string>You can use ${home} for the native home directory.</string>
			<key>pfm_title</key>
			<string>Download Directory</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>${home}/Downloads</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_description</key>
			<string>Control the installation, uninstallation and locking of extensions. Locked extensions cannot be disabled or uninstalled. For Install, you specify a list of URLs or paths. For Uninstall and Locked, you specify extension IDs.</string>
			<key>pfm_description_reference</key>
			<string>This preference controls the installation, uninstallation and locking of extensions. Locked extensions cannot be disabled or uninstalled. For Install, you specify a list of URLs or paths. For Uninstall and Locked, you specify extension IDs. For more on determining extension IDs: http://kb.mozillazine.org/Determine_extension_ID</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#extensions</string>
			<key>pfm_name</key>
			<string>Extensions</string>
			<key>pfm_note</key>
			<string>For more on determining extension IDs: http://kb.mozillazine.org/Determine_extension_ID</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A list of URLs or native paths for extensions to be installed.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, you can specify a list of extension URLs or paths that will be installed when Firefox is started. Anytime this list is changed, the extensions will be reinstalled. If this preference is disabled or not configured, no extensions are installed. Example of valid entries are: "https://addons.mozilla.org/firefox/downloads/somefile.xpi" or "//path/to/xpi"</string>
					<key>pfm_name</key>
					<string>Install</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Install</string>
							<key>pfm_title</key>
							<string>Install</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>E.g. https://addons.mozilla.org/firefox/downloads/somefile.xpi or //path/to/xpi</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Install</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A list of extension IDs that should be uninstalled if found.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, you can specify a list of extension IDs that will be uninstalled. Anytime this list is changed, the extensions will be uninstalled. If this preference is disabled or not configured, no extensions are uninstalled.</string>
					<key>pfm_name</key>
					<string>Uninstall</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Uninstall</string>
							<key>pfm_title</key>
							<string>Extension ID To Uninstall</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>E.g. addon_id@mozilla.org</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Uninstall</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A list of extension IDs that the user cannot disable or uninstall.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, you can specify a list of extension IDs that the user will be unable to uninstall or disable. If this preference is disabled or not configured, no extensions are locked</string>
					<key>pfm_name</key>
					<string>Locked</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Locked</string>
							<key>pfm_title</key>
							<string>Extension ID To Lock</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>E.g. addon_id@mozilla.org</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Locked</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>69</string>
			<key>pfm_description</key>
			<string>Manage all aspects of extensions.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#extensionsettings</string>
			<key>pfm_name</key>
			<string>ExtensionSettings</string>
			<key>pfm_note</key>
			<string>This policy is based heavily on the Chrome policy of the same name.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_description_reference</key>
					<string></string>
					<key>pfm_name</key>
					<string>{{key}}</string>
					<key>pfm_title</key>
					<string>Extension ID</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_description_reference</key>
					<string></string>
					<key>pfm_name</key>
					<string>{{value}}</string>
					<key>pfm_hidden</key>
					<string>container</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Maps to a string indicating the installation mode for the extension.</string>
							<key>pfm_description_reference</key>
							<string></string>
							<key>pfm_name</key>
							<string>installation_mode</string>
							<key>pfm_range_list</key>
							<array>
								<string>allowed</string>
								<string>blocked</string>
								<string>force_installed</string>
								<string>normal_installed</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Allowed (default behavior)</string>
								<string>Blocked</string>
								<string>Force Installed</string>
								<string>Normal Installed</string>
							</array>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Maps to a string indicating where Firefox can download a force_installed or normal_installed extension. If installing from the addons.mozilla.org, use the following URL (substituting SHORT_NAME from the URL on AMO), https://addons.mozilla.org/firefox/downloads/latest/SHORT_NAME/latest.xpi. If installing from the local file system, use a file:/// URL. Languages packs are available from https://releases.mozilla.org/pub/firefox/releases/VERSION/PLATFORM/xpi/LANGUAGE.xpi.</string>
							<key>pfm_description_reference</key>
							<string>Maps to a URL indicating where Firefox can download a force_installed or normal_installed extension. If installing from the addons.mozilla.org, use the following URL (substituting SHORT_NAME from the URL on AMO), https://addons.mozilla.org/firefox/downloads/latest/SHORT_NAME/latest.xpi. If installing from the local file system, use a file:/// URL. Languages packs are available from https://releases.mozilla.org/pub/firefox/releases/VERSION/PLATFORM/xpi/LANGUAGE.xpi.</string>
							<key>pfm_name</key>
							<string>install_url</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Each item in this list is an extension-style match pattern.</string>
							<key>pfm_description_reference</key>
							<string>Each item in this list is an extension-style match pattern. Users will be able to easily install items from any URL that matches an item in this list. Both the location of the *.xpi file and the page where the download is started from (i.e. the referrer) must be allowed by these patterns. This setting can be used only for the default configuration.</string>
							<key>pfm_name</key>
							<string>install_sources</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>This setting whitelists the allowed types of extension/apps that can be installed in Firefox.</string>
							<key>pfm_description_reference</key>
							<string>This setting whitelists the allowed types of extension/apps that can be installed in Firefox. The value is a list of strings, each of which should be one of the following: "extension", "theme", "dictionary", "langpack" This setting can be used only for the default configuration.</string>
							<key>pfm_name</key>
							<string>allowed_types</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>extension</string>
										<string>theme</string>
										<string>dictionary</string>
										<string>langpack</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>This maps to a string specifying the error message to display to users if they're blocked from installing an extension.</string>
							<key>pfm_description_reference</key>
							<string>This maps to a string specifying the error message to display to users if they're blocked from installing an extension. This setting allows you to append text to the generic error message displayed when the extension is blocked. This could be be used to direct users to your help desk, explain why a particular extension is blocked, or something else.</string>
							<key>pfm_name</key>
							<string>blocked_install_message</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>67</string>
			<key>pfm_description_reference</key>
			<string>Control extension updates.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#extensionupdate</string>
			<key>pfm_name</key>
			<string>ExtensionUpdate</string>
			<key>pfm_title</key>
			<string>Extension Update</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Control hardware acceleration.</string>
			<key>pfm_description_reference</key>
			<string>This preference disables hardware acceleration by locking the preference layers.acceleration.disabled to true.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#hardwareacceleration</string>
			<key>pfm_name</key>
			<string>HardwareAcceleration</string>
			<key>pfm_title</key>
			<string>Hardware Acceleration</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>68</string>
			<key>pfm_description</key>
			<string>Customize the Firefox Home page.</string>
			<key>pfm_description_reference</key>
			<string>Customize the Firefox Home page.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#firefoxhome</string>
			<key>pfm_name</key>
			<string>FirefoxHome</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>Search</string>
					<key>pfm_title</key>
					<string>Search</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>TopSites</string>
					<key>pfm_title</key>
					<string>TopSites</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>Highlights</string>
					<key>pfm_title</key>
					<string>Highlights</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>Pocket</string>
					<key>pfm_title</key>
					<string>Pocket</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>Snippets</string>
					<key>pfm_title</key>
					<string>Snippets</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>Locked</string>
					<key>pfm_title</key>
					<string>Locked</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>FirefoxHome</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_description</key>
			<string>Configure the default homepage and how Firefox starts.</string>
			<key>pfm_description_reference</key>
			<string>This preference sets the default homepage value and the default start page. It can also be used to lock the homepage or add additional homepages.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#homepage</string>
			<key>pfm_name</key>
			<string>Homepage</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Optional. Set the default home page.</string>
					<key>pfm_description_reference</key>
					<string>Optional. Set the default home page.</string>
					<key>pfm_name</key>
					<string>URL</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>https://www.example.com</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Optional. Set additional homepages.</string>
					<key>pfm_description_reference</key>
					<string>Optional. Set additional homepages.</string>
					<key>pfm_name</key>
					<string>Additional</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Additional</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://www.example.com</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Additional Homepages</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Optional. This preference sets what displays when Firefox starts. It can be the homepage, the previous session, or a blank page.</string>
					<key>pfm_description_reference</key>
					<string>Optional. This preference sets what displays when Firefox starts. It can be the homepage, the previous session, or a blank page.</string>
					<key>pfm_name</key>
					<string>StartPage</string>
					<key>pfm_range_list</key>
					<array>
						<string>none</string>
						<string>homepage</string>
						<string>previous-session</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>None</string>
						<string>Homepage</string>
						<string>Previous Session</string>
					</array>
					<key>pfm_title</key>
					<string>StartPage</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If true, prevents the user from changing homepage preferences.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this is true, Homepage preferences cannot be changed.</string>
					<key>pfm_name</key>
					<string>Locked</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>68</string>
			<key>pfm_description</key>
			<string>Enable linking to local files by origin</string>
			<key>pfm_description_reference</key>
			<string>Enable linking to local files by origin.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#localfilelinks</string>
			<key>pfm_name</key>
			<string>LocalFileLinks</string>
			<key>pfm_title</key>
			<string>Local File Links</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>68</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Enable or disable the New Tab page.</string>
			<key>pfm_description_reference</key>
			<string>Enable or disable the New Tab page.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#newtabpage</string>
			<key>pfm_name</key>
			<string>NewTabPage</string>
			<key>pfm_title</key>
			<string>New Tab Page</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Disable the creation of default bookmarks.</string>
			<key>pfm_description_reference</key>
			<string>This preference prevents the default bookmarks or the Smart Bookmarks (Most Visited, Recent Tags) from being created. Note: this preference is only effective if used before the first run of the profile.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#nodefaultbookmarks</string>
			<key>pfm_name</key>
			<string>NoDefaultBookmarks</string>
			<key>pfm_note</key>
			<string>This policy is only effective if the user profile has not been created yet.</string>
			<key>pfm_title</key>
			<string>No Default Bookmarks</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_description</key>
			<string>Override the first run page. If the value is blank, no first run page is displayed.</string>
			<key>pfm_description_reference</key>
			<string>This preference allows you to override the first run page. If you leave the URL blank, the first run page will not be displayed. E.g. https://www.example.com</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#overridefirstrunpage</string>
			<key>pfm_name</key>
			<string>OverrideFirstRunPage</string>
			<key>pfm_title</key>
			<string>Override First Run Page</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://www.example.com</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_description</key>
			<string>Override the upgrade page. If the value is blank, no upgrade page is displayed.</string>
			<key>pfm_description_reference</key>
			<string>This preference allows you to override the upgrade page. If you leave the URL blank, the upgrade page will not be displayed.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#overridepostupdatepage</string>
			<key>pfm_name</key>
			<string>OverridePostUpdatePage</string>
			<key>pfm_title</key>
			<string>Override Post Update Page</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>http://example.org</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>68</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Ask where to save each file before downloading.</string>
			<key>pfm_description_reference</key>
			<string>Ask where to save each file before downloading.</string>
			<key>pfm_name</key>
			<string>PromptForDownloadLocation</string>
			<key>pfm_title</key>
			<string>Prompt for Download Location</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This preference sets the list of requested locales for the application in order of preference. It will cause the corresponding language pack to become active.</string>
			<key>pfm_description_reference</key>
			<string>This preference sets the list of requested locales for the application in order of preference. It will cause the corresponding language pack to become active.</string>
			<key>pfm_name</key>
			<string>RequestedLocales</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<string></string>
					<key>pfm_description</key>
					<string>Action</string>
					<key>pfm_name</key>
					<string>action</string>
					<key>pfm_range_list</key>
					<array>
						<string>ach</string>
						<string>af</string>
						<string>sq</string>
						<string>ar</string>
						<string>an</string>
						<string>hy-AM</string>
						<string>as</string>
						<string>ast</string>
						<string>az</string>
						<string>eu</string>
						<string>be</string>
						<string>bn-BD</string>
						<string>bn-IN</string>
						<string>bs</string>
						<string>br</string>
						<string>bg</string>
						<string>my</string>
						<string>ca</string>
						<string>zh-CN</string>
						<string>zh-TW</string>
						<string>hr</string>
						<string>cs</string>
						<string>da</string>
						<string>nl</string>
						<string>en-GB</string>
						<string>en-CA</string>
						<string>en-ZA</string>
						<string>en-US</string>
						<string>eo</string>
						<string>et</string>
						<string>fi</string>
						<string>fr</string>
						<string>fy-NL</string>
						<string>ff</string>
						<string>gd</string>
						<string>gl</string>
						<string>ka</string>
						<string>de</string>
						<string>el</string>
						<string>gn</string>
						<string>gu-IN</string>
						<string>he</string>
						<string>hi-IN</string>
						<string>hu</string>
						<string>is</string>
						<string>id</string>
						<string>ia</string>
						<string>ga-IE</string>
						<string>it</string>
						<string>ja</string>
						<string>kab</string>
						<string>kn</string>
						<string>cak</string>
						<string>kk</string>
						<string>km</string>
						<string>ko</string>
						<string>lv</string>
						<string>lij</string>
						<string>lt</string>
						<string>dsb</string>
						<string>mk</string>
						<string>mai</string>
						<string>ms</string>
						<string>ml</string>
						<string>mr</string>
						<string>ne-NP</string>
						<string>nb-NO</string>
						<string>nn-NO</string>
						<string>oc</string>
						<string>or</string>
						<string>fa</string>
						<string>pl</string>
						<string>pt-BR</string>
						<string>pt-PT</string>
						<string>pa-IN</string>
						<string>ro</string>
						<string>rm</string>
						<string>ru</string>
						<string>sr</string>
						<string>si</string>
						<string>sk</string>
						<string>sl</string>
						<string>son</string>
						<string>es-AR</string>
						<string>es-CL</string>
						<string>es-MX</string>
						<string>es-ES</string>
						<string>sv-SE</string>
						<string>ta</string>
						<string>te</string>
						<string>th</string>
						<string>tr</string>
						<string>uk</string>
						<string>hsb</string>
						<string>ur</string>
						<string>uz</string>
						<string>vi</string>
						<string>cy</string>
						<string>xh</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Acholi</string>
						<string>Afrikaans</string>
						<string>Albanian</string>
						<string>Arabic</string>
						<string>Aragonese</string>
						<string>Armenian</string>
						<string>Assamese</string>
						<string>Asturian</string>
						<string>Azerbaijani</string>
						<string>Basque</string>
						<string>Belarusian</string>
						<string>Bengali (Bangladesh)</string>
						<string>Bengali (India)</string>
						<string>Bosnian</string>
						<string>Breton</string>
						<string>Bulgarian</string>
						<string>Burmese</string>
						<string>Catalan</string>
						<string>Chinese (Simplified)</string>
						<string>Chinese (Traditional)</string>
						<string>Croatian</string>
						<string>Czech</string>
						<string>Danish</string>
						<string>Dutch</string>
						<string>English (British)</string>
						<string>English (Canadian)</string>
						<string>English (South African)</string>
						<string>English (US)</string>
						<string>Esperanto</string>
						<string>Estonian</string>
						<string>Finnish</string>
						<string>French</string>
						<string>Frisian</string>
						<string>Fulah</string>
						<string>Gaelic (Scotland)</string>
						<string>Galician</string>
						<string>Georgian</string>
						<string>German</string>
						<string>Greek</string>
						<string>Guarani</string>
						<string>Gujarati (India)</string>
						<string>Hebrew</string>
						<string>Hindi (India)</string>
						<string>Hungarian</string>
						<string>Icelandic</string>
						<string>Indonesian</string>
						<string>Interlingua</string>
						<string>Irish</string>
						<string>Italian</string>
						<string>Japanese</string>
						<string>Kabyle</string>
						<string>Kannada</string>
						<string>Kaqchikel</string>
						<string>Kazakh</string>
						<string>Khmer</string>
						<string>Korean</string>
						<string>Latvian</string>
						<string>Ligurian</string>
						<string>Lithuanian</string>
						<string>Lower Sorbian</string>
						<string>Macedonian</string>
						<string>Maithili</string>
						<string>Malay</string>
						<string>Malayalam</string>
						<string>Marathi</string>
						<string>Nepali</string>
						<string>Norwegian (Bokmål)</string>
						<string>Norwegian (Nynorsk)</string>
						<string>Occitan (Lengadocian)</string>
						<string>Odia</string>
						<string>Persian</string>
						<string>Polish</string>
						<string>Portuguese (Brazilian)</string>
						<string>Portuguese (Portugal)</string>
						<string>Punjabi (India)</string>
						<string>Romanian</string>
						<string>Romansh</string>
						<string>Russian</string>
						<string>Serbian</string>
						<string>Sinhala</string>
						<string>Slovak</string>
						<string>Slovenian</string>
						<string>Songhai</string>
						<string>Spanish (Argentina)</string>
						<string>Spanish (Chile)</string>
						<string>Spanish (Mexico)</string>
						<string>Spanish (Spain)</string>
						<string>Swedish</string>
						<string>Tamil</string>
						<string>Telugu</string>
						<string>Thai</string>
						<string>Turkish</string>
						<string>Ukrainian</string>
						<string>Upper Sorbian</string>
						<string>Urdu</string>
						<string>Uzbek</string>
						<string>Vietnamese</string>
						<string>Welsh</string>
						<string>Xhosa</string>
					</array>
					<key>pfm_title</key>
					<string>Action</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Requested Locales</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_type_input</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>68</string>
			<key>pfm_description</key>
			<string>Clear data on shutdown. Choose from Cache, Cookies, Download History, Form &amp; Search History, Browsing History, Active Logins, Site Preferences and Offline Website Data.</string>
			<key>pfm_description_reference</key>
			<string>Clear data on shutdown. Choose from Cache, Cookies, Download History, Form &amp; Search History, Browsing History, Active Logins, Site Preferences and Offline Website Data.</string>
			<key>pfm_name</key>
			<string>SanitizeOnShutdown</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>Cache</string>
					<key>pfm_title</key>
					<string>Cache</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>Cookies</string>
					<key>pfm_title</key>
					<string>Cookies</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>Downloads</string>
					<key>pfm_title</key>
					<string>Downloads</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>FormData</string>
					<key>pfm_title</key>
					<string>FormData</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>History</string>
					<key>pfm_title</key>
					<string>History</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>Sessions</string>
					<key>pfm_title</key>
					<string>Sessions</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>SiteSettings</string>
					<key>pfm_title</key>
					<string>SiteSettings</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_name</key>
					<string>OfflineApps</string>
					<key>pfm_title</key>
					<string>OfflineApps</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Sanitize On Shutdown (Selective)</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>separate</string>
			<key>pfm_description</key>
			<string>This preference can be used to determine if the search bar is separate or combined with the URL bar.</string>
			<key>pfm_description_reference</key>
			<string>This preference can be used to determine if the search bar is separate or combined with the URL bar.</string>
			<key>pfm_name</key>
			<string>SearchBar</string>
			<key>pfm_range_list</key>
			<array>
				<string>separate</string>
				<string>unified</string>
			</array>
			<key>pfm_title</key>
			<string>Search Bar</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>63</string>
			<key>pfm_description</key>
			<string>Configure DNS over HTTPS.</string>
			<key>pfm_description_reference</key>
			<string>This preference configures DNS over HTTPS.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#dnsoverhttps</string>
			<key>pfm_name</key>
			<string>DNSOverHTTPS</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Enable DNS over HTTPS.</string>
					<key>pfm_description_reference</key>
					<string>Required. Enable DNS over HTTPS.</string>
					<key>pfm_name</key>
					<string>Enabled</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>URL to an alternative DNS over HTTPS provider.</string>
					<key>pfm_description_reference</key>
					<string>Required. URL to an alternative DNS over HTTPS provider.</string>
					<key>pfm_name</key>
					<string>ProviderURL</string>
					<key>pfm_title</key>
					<string>ProviderURL</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>https://mozilla.cloudflare-dns.com/dns-query</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If this is true, DNS over HTTPS preferences cannot be changed.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this is true, DNS over HTTPS preferences cannot be changed.</string>
					<key>pfm_name</key>
					<string>Locked</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>DNS over HTTPS</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This preference allows you to specify proxy settings. These settings correspond to the connection settings in Firefox preferences. To specify ports, append them to the hostnames with a colon (:). If Locked is set to true, the values cannot be changed by the user.</string>
			<key>pfm_description_reference</key>
			<string>This preference allows you to specify proxy settings. These settings correspond to the connection settings in Firefox preferences. To specify ports, append them to the hostnames with a colon (:). If Locked is set to true, the values cannot be changed by the user.</string>
			<key>pfm_name</key>
			<string>Proxy</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>If this preference is enabled, you will be setting the proxy mode.</string>
					<key>pfm_description_reference</key>
					<string>Required. If this preference is enabled, you will be setting the proxy mode.</string>
					<key>pfm_name</key>
					<string>Mode</string>
					<key>pfm_range_list</key>
					<array>
						<string>none</string>
						<string>system</string>
						<string>manual</string>
						<string>autoDetect</string>
						<string>autoConfig</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>No Proxy</string>
						<string>Use system proxy settings</string>
						<string>Manual proxy configuration</string>
						<string>Auto-detect proxy settings</string>
						<string>Automatic proxy configuration</string>
					</array>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If this preference is enabled, Proxy preferences cannot be changed.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, Proxy preferences cannot be changed.</string>
					<key>pfm_name</key>
					<string>Locked</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If this preference is enabled, do not prompt for authentication if password is saved.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, do not prompt for authentication if password is saved.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>none</string>
									</array>
									<key>pfm_target</key>
									<string>Proxy.Mode</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AutoLogin</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If this preference is enabled, you will use Proxy DNS when using SOCKS v5.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, you will use Proxy DNS when using SOCKS v5.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>none</string>
									</array>
									<key>pfm_target</key>
									<string>Proxy.Mode</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>UseProxyForDNS</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>HTTP Proxy URL.</string>
					<key>pfm_description_reference</key>
					<string>Optional. HTTP Proxy URL.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>manual</string>
									</array>
									<key>pfm_target</key>
									<string>Proxy.Mode</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPProxy</string>
					<key>pfm_title</key>
					<string>HTTP Proxy</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>htttp://proxy.example.com:8080</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If this preference is enabled, use the HTTP proxy server for all protocols.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, use the HTTP proxy server for all protocols.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>manual</string>
									</array>
									<key>pfm_target</key>
									<string>Proxy.Mode</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>UseHTTPProxyForAllProtocols</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>SSL Proxy URL.</string>
					<key>pfm_description_reference</key>
					<string>Optional. SSL Proxy URL.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>manual</string>
									</array>
									<key>pfm_target</key>
									<string>Proxy.Mode</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>SSLProxy</string>
					<key>pfm_title</key>
					<string>SSL Proxy</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>htttp://proxy.example.com:8080</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>FTP Proxy URL.</string>
					<key>pfm_description_reference</key>
					<string>Optional. FTP Proxy URL.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>manual</string>
									</array>
									<key>pfm_target</key>
									<string>Proxy.Mode</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>FTPProxy</string>
					<key>pfm_title</key>
					<string>FTP Proxy</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>htttp://proxy.example.com:8080</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>SOCKS Proxy URL.</string>
					<key>pfm_description_reference</key>
					<string>Optional. SOCKS Proxy URL.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>manual</string>
									</array>
									<key>pfm_target</key>
									<string>Proxy.Mode</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>SOCKSProxy</string>
					<key>pfm_title</key>
					<string>SOCKS Proxy</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>htttp://proxy.example.com:8080</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Select SOCKS Version.</string>
					<key>pfm_description_reference</key>
					<string>Optional. Select SOCKS Version.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>manual</string>
									</array>
									<key>pfm_target</key>
									<string>Proxy.Mode</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>SOCKSVersion</string>
					<key>pfm_range_list</key>
					<array>
						<string>4</string>
						<string>5</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>4</string>
						<string>5</string>
					</array>
					<key>pfm_title</key>
					<string>SOCKS Version</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>localhost, 127.0.0.1</string>
					<key>pfm_description</key>
					<string>Proxy bypass URLs.</string>
					<key>pfm_description_reference</key>
					<string>Optional. Proxy bypass URLs.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>manual</string>
									</array>
									<key>pfm_target</key>
									<string>Proxy.Mode</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>Passthrough</string>
					<key>pfm_title</key>
					<string>No Proxy For</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>E.g.: .mozilla.org, .net.nz, 192.168.1.0/24</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Proxy bypass URLs.</string>
					<key>pfm_description_reference</key>
					<string>Optional. Proxy bypass URLs.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>autoConfig</string>
									</array>
									<key>pfm_target</key>
									<string>Proxy.Mode</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AutoConfigURL</string>
					<key>pfm_title</key>
					<string>Automatic Proxy Configuration URL</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>htttp://proxy.example.com:8080/proxy.pac</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>66</string>
			<key>pfm_description_reference</key>
			<string>This policy allows you to set the minimum TLS version.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates#sslversionmin</string>
			<key>pfm_name</key>
			<string>SSLVersionMin</string>
			<key>pfm_range_list</key>
			<array>
				<string>tls1</string>
				<string>tls1.1</string>
				<string>tls1.2</string>
				<string>tls1.3</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>TLS 1.0</string>
				<string>TLS 1.1</string>
				<string>TLS 1.2</string>
				<string>TLS 1.3</string>
			</array>
			<key>pfm_title</key>
			<string>SSLVersionMin</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>66</string>
			<key>pfm_description_reference</key>
			<string>This policy allows you to set the maximum TLS version.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates#sslversionmax</string>
			<key>pfm_name</key>
			<string>SSLVersionMax</string>
			<key>pfm_range_list</key>
			<array>
				<string>tls1</string>
				<string>tls1.1</string>
				<string>tls1.2</string>
				<string>tls1.3</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>TLS 1.0</string>
				<string>TLS 1.1</string>
				<string>TLS 1.2</string>
				<string>TLS 1.3</string>
			</array>
			<key>pfm_title</key>
			<string>SSLVersionMax</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>67</string>
			<key>pfm_description</key>
			<string>Enable or disable network prediction (DNS prefetching).</string>
			<key>pfm_description_reference</key>
			<string>This policy enables or disables network prediction (DNS prefetching) by setting and locking the preferences network.dns.disablePrefetch and network.dns.disablePrefetchFromHTTPS.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#networkprediction</string>
			<key>pfm_name</key>
			<string>NetworkPrediction</string>
			<key>pfm_title</key>
			<string>Network Prediction</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_description</key>
			<string>Configure cookie preferences.</string>
			<key>pfm_description_reference</key>
			<string>This preference controls various settings related to cookies.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#cookies</string>
			<key>pfm_name</key>
			<string>Cookies</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>60</string>
					<key>pfm_description</key>
					<string>Domains where cookies are always allowed.</string>
					<key>pfm_description_reference</key>
					<string>Optional. Domains where cookies are always allowed.</string>
					<key>pfm_name</key>
					<string>Allow</string>
					<key>pfm_note</key>
					<string>You must include http or https.</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_format</key>
							<string>^https?://.*$</string>
							<key>pfm_name</key>
							<string>URL</string>
							<key>pfm_title</key>
							<string>URL</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://www.example.org/</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Allow</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>60</string>
					<key>pfm_description</key>
					<string>Domains where cookies are always blocked.</string>
					<key>pfm_description_reference</key>
					<string>Optional. Domains where cookies are always blocked.</string>
					<key>pfm_name</key>
					<string>Block</string>
					<key>pfm_note</key>
					<string>You must include http or https.</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_format</key>
							<string>^https?://.*$</string>
							<key>pfm_name</key>
							<string>URL</string>
							<key>pfm_title</key>
							<string>URL</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://www.example.org/</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Block</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>60</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>This sets the default value for "Accept cookies from websites".</string>
					<key>pfm_description_reference</key>
					<string>Optional. This sets the default value for "Accept cookies from websites".</string>
					<key>pfm_name</key>
					<string>Default</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>60</string>
					<key>pfm_description</key>
					<string>This sets the default value for "Accept third-party cookies".</string>
					<key>pfm_description_reference</key>
					<string>Optional. This sets the default value for "Accept third-party cookies".</string>
					<key>pfm_name</key>
					<string>AcceptThirdParty</string>
					<key>pfm_range_list</key>
					<array>
						<string>always</string>
						<string>never</string>
						<string>from-visited</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>always</string>
						<string>never</string>
						<string>from-visited</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>60</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>This determines when cookies expire.</string>
					<key>pfm_description_reference</key>
					<string>Optional. This determines when cookies expire.</string>
					<key>pfm_name</key>
					<string>ExpireAtSessionEnd</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>63</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Only reject trackers.</string>
					<key>pfm_description_reference</key>
					<string>Optional. Only reject trackers.</string>
					<key>pfm_name</key>
					<string>RejectTracker</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>60</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If this is true, cookies preferences cannot be changed.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this is true, cookies preferences cannot be changed.</string>
					<key>pfm_name</key>
					<string>Locked</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Turn off saving information on web forms and the search bar.</string>
			<key>pfm_description_reference</key>
			<string>This preference turns off the browser.formfill.enable preferences.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disableformhistory</string>
			<key>pfm_name</key>
			<string>DisableFormHistory</string>
			<key>pfm_title</key>
			<string>Disable Form History</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>71</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Do not allow passwords to be shown in saved logins</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disablepasswordreveal</string>
			<key>pfm_name</key>
			<string>DisablePasswordReveal</string>
			<key>pfm_title</key>
			<string>Disable Password Reveal</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Prevent the upload of telemetry data.</string>
			<key>pfm_description_reference</key>
			<string>This preference prevents the upload of telemetry data. Mozilla recommends that you do not disable telemetry. Information collected through telemetry helps Mozilla build a better product for businesses like yours.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disabletelemetry</string>
			<key>pfm_name</key>
			<string>DisableTelemetry</string>
			<key>pfm_note</key>
			<string>Mozilla recommends that you do not disable telemetry. Information collected through telemetry helps build a better product for businesses like yours.</string>
			<key>pfm_title</key>
			<string>Disable Telemetry</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<dict>
				<key>Locked</key>
				<true/>
				<key>Value</key>
				<true/>
			</dict>
			<key>pfm_description</key>
			<string>Configure tracking protection. If this policy is not configured, tracking protection is not enabled by default in the browser, but it is enabled by default in private browsing and the user can change it.</string>
			<key>pfm_description_reference</key>
			<string>This preference affects tracking protection. If this preference is not configured, tracking protection is not enabled by default in the browser, but it is enabled by default in private browsing and the user can change it.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#enabletrackingprotection</string>
			<key>pfm_name</key>
			<string>EnableTrackingProtection</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>60</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If Value is set to false, tracking protection is disabled and locked in both the regular browser and private browsing. If Value is set to true, tracking protection is enabled by default in both the regular browser and private browsing.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If Value is set to false, tracking protection is disabled and locked in both the regular browser and private browsing. If Value is set to true, tracking protection is enabled by default in both the regular browser and private browsing.</string>
					<key>pfm_name</key>
					<string>Value</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>60</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If this is true, Tracking Protection preferences cannot be changed.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this is true, Tracking Protection preferences cannot be changed.</string>
					<key>pfm_name</key>
					<string>Locked</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If Cryptomining is set to true, cryptomining scripts on websites are blocked.</string>
					<key>pfm_description_reference</key>
					<string>If Cryptomining is set to true, cryptomining scripts on websites are blocked.</string>
					<key>pfm_name</key>
					<string>Cryptomining</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68.2</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If Fingerprinting is set to true, fingerprinting scripts on websites are blocked.</string>
					<key>pfm_description_reference</key>
					<string>If Fingerprinting is set to true, fingerprinting scripts on websites are blocked.</string>
					<key>pfm_name</key>
					<string>Fingerprinting</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Enable Tracking Protection</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_description</key>
			<string>Configure the default Flash plugin policy as well as origins for which Flash is allowed.</string>
			<key>pfm_description_reference</key>
			<string>This preference sets the behavior of Flash on the specified domains as well as the default behavior.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#flashplugin</string>
			<key>pfm_name</key>
			<string>FlashPlugin</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>If this preference is enabled, sites on the allow list do not override Flash being completely disabled. Flash is activated by default for the domains indicated unless Flash is completely disabled. If a top level domain is specified (http://example.org), Flash is allowed for all subdomains as well.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, sites on the allow list do not override Flash being completely disabled. Flash is activated by default for the domains indicated unless Flash is completely disabled. If a top level domain is specified (http://example.org), Flash is allowed for all subdomains as well.</string>
					<key>pfm_name</key>
					<string>Allow</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_format</key>
							<string>^https?://.*</string>
							<key>pfm_name</key>
							<string>Allowed Domains</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://www.example.com</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Allowed Domains</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If this preference is enabled, Flash is blocked for the domains indicated. If a top level domain is specified (http://example.org), Flash is blocked from all subdomains as well.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, Flash is blocked for the domains indicated. If a top level domain is specified (http://example.org), Flash is blocked from all subdomains as well.</string>
					<key>pfm_name</key>
					<string>Block</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_format</key>
							<string>^https?://.*</string>
							<key>pfm_name</key>
							<string>Blocked Domains</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://www.example.com</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Blocked Domains</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If this is true, Flash preferences cannot be changed. If this is false, Flash is never activated on websites even if they are in the specified in the Allow list.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this is true, Flash preferences cannot be changed. If this is false, Flash is never activated on websites even if they are in the specified in the Allow list.</string>
					<key>pfm_name</key>
					<string>Default</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If this is true, Flash preferences cannot be changed.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this is true, Flash preferences cannot be changed.</string>
					<key>pfm_name</key>
					<string>Locked</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Flash Plugin Permissions</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_description</key>
			<string>Configure the default extension install policy as well as origins for extension installs are allowed.</string>
			<key>pfm_description_reference</key>
			<string>This preference sets domains that can install extensions as well as the default behavior. If default behavior value is set to false, add-ons cannot be installed by the user.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#installaddonspermission</string>
			<key>pfm_name</key>
			<string>InstallAddonsPermission</string>
			<key>pfm_note</key>
			<string>This policy does not override turning off all extension installs.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>If this preference is enabled, add-ons are always allowed for the domains indicated unless add-on install is disabled. If a top level domain is specified (http://example.org), add-ons are allowed for all subdomains as well.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, add-ons are always allowed for the domains indicated unless add-on install is disabled. If a top level domain is specified (http://example.org), add-ons are allowed for all subdomains as well.</string>
					<key>pfm_name</key>
					<string>Allow</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Allowed Domains</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://www.example.com</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Allowed Domains</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If this is set to false, add-ons cannot be installed by the user.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this is set to false, add-ons cannot be installed by the user.</string>
					<key>pfm_name</key>
					<string>Default</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Install Add-ons Permissions</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Control whether or not Firefox offers to save passwords.</string>
			<key>pfm_description_reference</key>
			<string>This preference sets the signon.rememberSignons preference. It determines whether or not Firefox offers to save passwords. It can either be enabled or disabled.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#offertosavelogins</string>
			<key>pfm_name</key>
			<string>OfferToSaveLogins</string>
			<key>pfm_title</key>
			<string>Offer To Save Logins</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>70</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Sets the default value of signon.rememberSignons without locking it.</string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#offertosaveloginsdefault</string>
			<key>pfm_name</key>
			<string>OfferToSaveLoginsDefault</string>
			<key>pfm_title</key>
			<string>Offer To Save Logins Default</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>70</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Remove access to the password manager via preferences and blocks about:logins on Firefox 70.</string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#passwordmanagerenabled</string>
			<key>pfm_name</key>
			<string>PasswordManagerEnabled</string>
			<key>pfm_title</key>
			<string>Enable Password Manager</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>62</string>
			<key>pfm_description</key>
			<string>Set permissions associated with camera, microphone, location, and notifications.</string>
			<key>pfm_description_reference</key>
			<string>This preference allows you to change the permissions associated with camera, microphone, location, and notifications.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#permissions</string>
			<key>pfm_hidden</key>
			<string>container</string>
			<key>pfm_name</key>
			<string>Permissions</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>This preference allows you to change the camera permissions.</string>
					<key>pfm_name</key>
					<string>Camera</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>If this preference is enabled, access to the camera is always allowed for the domains indicated. If this preference is disabled or not configured, the default camera preference is followed.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, access to the camera is always allowed for the domains indicated. If this preference is disabled or not configured, the default camera preference is followed.</string>
							<key>pfm_name</key>
							<string>Allow</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>Allowed Domains</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>https://www.example.com</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Allow</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>If this preference is enabled, access to the camera is blocked for the domains indicated. If this preference is disabled or not configured, access to the camera is not blocked by default.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, access to the camera is blocked for the domains indicated. If this preference is disabled or not configured, access to the camera is not blocked by default.</string>
							<key>pfm_name</key>
							<string>Block</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>Blocked Domains</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>https://www.example.com</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Block</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_description</key>
							<string>If this preference is enabled, sites that are not in the Allow preference will not be allowed to ask permission to access the camera. If this preference is disabled or not configured, any site that is not in the Block preference can ask permission to access the camera.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, sites that are not in the Allow preference will not be allowed to ask permission to access the camera. If this preference is disabled or not configured, any site that is not in the Block preference can ask permission to access the camera.</string>
							<key>pfm_name</key>
							<string>BlockNewRequests</string>
							<key>pfm_title</key>
							<string>BlockNewRequests</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<false/>
							<key>pfm_description</key>
							<string>If this preference is enabled, camera preferences cannot be changed by the user. If this preference is disabled or not configured, the user can change their camera preferences.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, camera preferences cannot be changed by the user. If this preference is disabled or not configured, the user can change their camera preferences.</string>
							<key>pfm_name</key>
							<string>Locked</string>
							<key>pfm_title</key>
							<string>Locked</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Camera Permissions</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>This preference allows you to change the microphone permissions.</string>
					<key>pfm_name</key>
					<string>Microphone</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>If this preference is enabled, access to the microphone is always allowed for the domains indicated. If this preference is disabled or not configured, the default microphone preference is followed.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, access to the microphone is always allowed for the domains indicated. If this preference is disabled or not configured, the default microphone preference is followed.</string>
							<key>pfm_name</key>
							<string>Allow</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>Allowed Domains</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>https://www.example.com</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Allow</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>If this preference is enabled, access to the microphone is blocked for the domains indicated. If this preference is disabled or not configured, access to the microphone is not blocked by default.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, access to the microphone is blocked for the domains indicated. If this preference is disabled or not configured, access to the microphone is not blocked by default.</string>
							<key>pfm_name</key>
							<string>Block</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>Blocked Domains</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>https://www.example.com</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Block</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_description</key>
							<string>If this preference is enabled, sites that are not in the Allow preference will not be allowed to ask permission to access the microphone. If this preference is disabled or not configured, any site that is not in the Block preference can ask permission to access the microphone.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, sites that are not in the Allow preference will not be allowed to ask permission to access the microphone. If this preference is disabled or not configured, any site that is not in the Block preference can ask permission to access the microphone.</string>
							<key>pfm_name</key>
							<string>BlockNewRequests</string>
							<key>pfm_title</key>
							<string>BlockNewRequests</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<false/>
							<key>pfm_description</key>
							<string>If this preference is enabled, microphone preferences cannot be changed by the user. If this preference is disabled or not configured, the user can change their microphone preferences.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, microphone preferences cannot be changed by the user. If this preference is disabled or not configured, the user can change their microphone preferences.</string>
							<key>pfm_name</key>
							<string>Locked</string>
							<key>pfm_title</key>
							<string>Locked</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Microphone Permissions</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>This preference allows you to change the location permissions.</string>
					<key>pfm_name</key>
					<string>Location</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>If this preference is enabled, access to location is always allowed for the domains indicated. If this preference is disabled or not configured, the default location preference is followed.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, access to location is always allowed for the domains indicated. If this preference is disabled or not configured, the default location preference is followed.</string>
							<key>pfm_name</key>
							<string>Allow</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>Allowed Domains</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>https://www.example.com</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Allow</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>If this preference is enabled, access to location is blocked for the domains indicated. If this preference is disabled or not configured, access to location is not blocked by default.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, access to location is blocked for the domains indicated. If this preference is disabled or not configured, access to location is not blocked by default.</string>
							<key>pfm_name</key>
							<string>Block</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>Blocked Domains</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>https://www.example.com</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Block</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_description</key>
							<string>If this preference is enabled, sites that are not in the Allow preference will not be allowed to ask permission to access location. If this preference is disabled or not configured, any site that is not in the Block preference can ask permission to access the location.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, sites that are not in the Allow preference will not be allowed to ask permission to access location. If this preference is disabled or not configured, any site that is not in the Block preference can ask permission to access the location.</string>
							<key>pfm_name</key>
							<string>BlockNewRequests</string>
							<key>pfm_title</key>
							<string>BlockNewRequests</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<false/>
							<key>pfm_description</key>
							<string>If this preference is enabled, location preferences cannot be changed by the user. If this preference is disabled or not configured, the user can change their location preferences.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, location preferences cannot be changed by the user. If this preference is disabled or not configured, the user can change their location preferences.</string>
							<key>pfm_name</key>
							<string>Locked</string>
							<key>pfm_title</key>
							<string>Locked</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Location Permissions</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>This preference allows you to change the notifications permissions.</string>
					<key>pfm_name</key>
					<string>Notifications</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>If this preference is enabled, notifications can always be sent for the domains indicated. If this preference is disabled or not configured, the default nofication preference is followed.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, notifications can always be sent for the domains indicated. If this preference is disabled or not configured, the default nofication preference is followed.</string>
							<key>pfm_name</key>
							<string>Allow</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>Allowed Domains</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>https://www.example.com</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Allow</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>If this preference is enabled, notifications are always blocked for the domains indicated. If this preference is disabled or not configured, notifications are not blocked by default.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, notifications are always blocked for the domains indicated. If this preference is disabled or not configured, notifications are not blocked by default.</string>
							<key>pfm_name</key>
							<string>Block</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>Blocked Domains</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>https://www.example.com</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Block</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_description</key>
							<string>If this preference is enabled, sites that are not in the Allow preference will not be allowed to ask permission to send notifications. If this preference is disabled or not configured, any site that is not in the Block preference can ask permission to send notifications.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, sites that are not in the Allow preference will not be allowed to ask permission to send notifications. If this preference is disabled or not configured, any site that is not in the Block preference can ask permission to send notifications.</string>
							<key>pfm_name</key>
							<string>BlockNewRequests</string>
							<key>pfm_title</key>
							<string>BlockNewRequests</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<false/>
							<key>pfm_description</key>
							<string>If this preference is enabled, notification preferences cannot be changed by the user. If this preference is disabled or not configured, the user can change their notification preferences.</string>
							<key>pfm_description_reference</key>
							<string>Optional. If this preference is enabled, location preferences cannot be changed by the user. If this preference is disabled or not configured, the user can change their location preferences.</string>
							<key>pfm_name</key>
							<string>Locked</string>
							<key>pfm_title</key>
							<string>Locked</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Notifications Permissions</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_description</key>
			<string>Configure the default pop-up window policy as well as origins for which pop-up windows are allowed.</string>
			<key>pfm_description_reference</key>
			<string>This preference sets domains for which pop-up windows are allowed. It also sets the default pop-up preference.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#popupblocking</string>
			<key>pfm_name</key>
			<string>PopupBlocking</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Specify the domains for which pop-up windows are always allowed. If a top level domain is specified (http://example.org), pop-up windows are allowed for all subdomains as well.</string>
					<key>pfm_description_reference</key>
					<string>Optional. Specify the domains for which pop-up windows are always allowed. If a top level domain is specified (http://example.org), pop-up windows are allowed for all subdomains as well.</string>
					<key>pfm_name</key>
					<string>Allow</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Allowed Domains</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>https://www.example.com</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Allowed Domains</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If this is false, pop-up windows are allowed by default.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this is false, pop-up windows are allowed by default.</string>
					<key>pfm_name</key>
					<string>Default</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If this is true, pop-up blocking preferences cannot be changed.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this is true, pop-up blocking preferences cannot be changed.</string>
					<key>pfm_name</key>
					<string>Locked</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Popup Blocking</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Trust certificates that have been added to the operating system certificate store by a user or administrator in the macOS Keychain.</string>
			<key>pfm_description_reference</key>
			<string>This preference can be used to install certificates or to read (import) certificates from the system certificate store on macOS (keychain). Certificates can be located in the following locations:
/Library/Application Support/Mozilla/Certificates
~/Library/Application Support/Mozilla/Certificates

In Firefox 65, you can specify a fully qualified path.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#certificates</string>
			<key>pfm_name</key>
			<string>Certificates</string>
			<key>pfm_note</key>
			<string>Certificates can be located in the following locations:
/Library/Application Support/Mozilla/Certificates
~/Library/Application Support/Mozilla/Certificates</string>
			<key>pfm_note</key>
			<string>See https://support.mozilla.org/kb/setting-certificate-authorities-firefox for more detail.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>63</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If this preference is enabled, Firefox will read certificates from the macOS keychain. If this preference is disabled or not configured, Firefox will not read certificates from the macOS keychain.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, Firefox will read certificates from the macOS keychain. If this preference is disabled or not configured, Firefox will not read certificates from the macOS keychain.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/mozilla/policy-templates/blob/master/README.md#certificates--importenterpriseroots</string>
					<key>pfm_name</key>
					<string>ImportEnterpriseRoots</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>64</string>
					<key>pfm_description</key>
					<string>If this preference is enabled, Firefox will install the listed certificates. It will look in /Library/Application Support/Mozilla/Certificates and ~/Library/Application Support/Mozilla/Certificates.

If this preference is disabled or not configured, Firefox will not install additional certificates.

Starting in Firefox 65, you can specify a fully qualified path (e.g. /Library/Company/cer1.der). If Firefox does not find something at your fully qualified path, it will search the default directories.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, Firefox will install the listed certificates. It will look in /Library/Application Support/Mozilla/Certificates and ~/Library/Application Support/Mozilla/Certificates.

If this preference is disabled or not configured, Firefox will not install additional certificates.

Starting in Firefox 65, you can specify a fully qualified path (e.g. /Library/Company/cer1.der). If Firefox does not find something at your fully qualified path, it will search the default directories.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/mozilla/policy-templates/blob/master/README.md#certificates--install</string>
					<key>pfm_name</key>
					<string>Install</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Certificate</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>cer1.der or /Library/CompanyFolder/cer2.pem</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Install</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>60</string>
			<key>pfm_description</key>
			<string>Prevent the user from bypassing security in certain cases.</string>
			<key>pfm_description_reference</key>
			<string>This preference prevents the user from bypassing security in certain cases.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#disablesecuritybypass</string>
			<key>pfm_name</key>
			<string>DisableSecurityBypass</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Prevents adding an exception when an invalid certificate is shown. If this preference is enabled, the "Add Exception" button is not available when a certificate is invalid. This prevents the user from overriding the certificate error. If this preference is disabled or not configured, certificate errors can be overridden.</string>
					<key>pfm_description_reference</key>
					<string>Optional. Prevents adding an exception when an invalid certificate is shown. If this preference is enabled, the "Add Exception" button is not available when a certificate is invalid. This prevents the user from overriding the certificate error. If this preference is disabled or not configured, certificate errors can be overridden.</string>
					<key>pfm_name</key>
					<string>InvalidCertificate</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Prevents selecting "ignore the risk" and visiting a harmful site anyway. If this preference is enabled, a user cannot bypass the warning and visit a harmful site. If this preference is disabled or not configured, a user can choose to visit a harmful site.</string>
					<key>pfm_description_reference</key>
					<string>Optional. Prevents selecting "ignore the risk" and visiting a harmful site anyway. If this preference is enabled, a user cannot bypass the warning and visit a harmful site. If this preference is disabled or not configured, a user can choose to visit a harmful site.</string>
					<key>pfm_name</key>
					<string>SafeBrowsing</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Disable Security Bypass</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<dict>
				<key>NAME_OF_DEVICE</key>
				<string>PATH_TO_LIBRARY_FOR_DEVICE</string>
			</dict>
			<key>pfm_description</key>
			<string>This preference allows you to add PKCS #11 Modules</string>
			<key>pfm_description_reference</key>
			<string>This preference allows you to add PKCS #11 Modules</string>
			<key>pfm_name</key>
			<string>SecurityDevices</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_description_reference</key>
					<string></string>
					<key>pfm_name</key>
					<string>{{key}}</string>
					<key>pfm_title</key>
					<string>Device Name</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>NAME_OF_DEVICE</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_description_reference</key>
					<string></string>
					<key>pfm_name</key>
					<string>{{value}}</string>
					<key>pfm_title</key>
					<string>Library Path</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>PATH_TO_LIBRARY_FOR_DEVICE</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This preference blocks websites from being visited. The parameters take an array of Match Patterns, as documented in https://developer.mozilla.org/en-US/Add-ons/WebExtensions/Match_patterns. Only http/https addresses are supported at the moment. The arrays are limited to 1000 entries each. You cannot have entries in Exceptions without entries in Block.</string>
			<key>pfm_description_reference</key>
			<string>This preference blocks websites from being visited. The parameters take an array of Match Patterns, as documented in https://developer.mozilla.org/en-US/Add-ons/WebExtensions/Match_patterns. Only http/https addresses are supported at the moment. The arrays are limited to 1000 entries each. You cannot have entries in Exceptions without entries in Block.</string>
			<key>pfm_name</key>
			<string>WebsiteFilter</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>If this preference is enabled, you can specify match patterns that indicate sites to be blocked. The match patterns are documented at https://developer.mozilla.org/en-US/Add-ons/WebExtensions/Match_patterns. Only http/https addresses are supported at the moment. There is a 1000 entry limit. If this preference is disabled or not configured, no websites are blocked.</string>
					<key>pfm_description_reference</key>
					<string>Required. If this preference is enabled, you can specify match patterns that indicate sites to be blocked. The match patterns are documented at https://developer.mozilla.org/en-US/Add-ons/WebExtensions/Match_patterns. Only http/https addresses are supported at the moment. There is a 1000 entry limit. If this preference is disabled or not configured, no websites are blocked.</string>
					<key>pfm_name</key>
					<string>Block</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Block</string>
							<key>pfm_title</key>
							<string>Blocked Sites</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>E.g. &lt;all_urls&gt;</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Block</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If this preference is enabled, and the website filter is enabled, you can specify match patterns for sites you do not want to block. The match patterns are documented at https://developer.mozilla.org/en-US/Add-ons/WebExtensions/Match_patterns. Only http/https addresses are supported at the moment. There is a 1000 entry limit. If this preference is disabled or not configured, there are no exceptions to the website filter.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If this preference is enabled, you can specify a list of extension IDs that will be uninstalled. Anytime this list is changed, the extensions will be uninstalled. If this preference is disabled or not configured, no extensions are uninstalled.</string>
					<key>pfm_name</key>
					<string>Exceptions</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Exceptions</string>
							<key>pfm_title</key>
							<string>Exceptions To Website Filter</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>http://example.org/*</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Exceptions</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>67</string>
			<key>pfm_description</key>
			<string>Enable or disable the detection of captive portals.</string>
			<key>pfm_description_reference</key>
			<string>This policy enables or disables captive portal support by setting and locking the preference network.captive-portal-service.enabled.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates#captiveportal</string>
			<key>pfm_name</key>
			<string>CaptivePortal</string>
			<key>pfm_title</key>
			<string>Captive Portal</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Set and lock certain preferences.</string>
			<key>pfm_description_reference</key>
			<string>Set and lock certain preferences.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/mozilla/policy-templates/blob/master/README.md#preferences</string>
			<key>pfm_name</key>
			<string>Preferences</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If set to 1, platform accessibility is disabled.</string>
					<key>pfm_name</key>
					<string>accessibility.force_disabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Not Disabled</string>
						<string>Disabled</string>
					</array>
					<key>pfm_title</key>
					<string>accessibility.force_disabled</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, Firefox doesn't automatically install update.</string>
					<key>pfm_name</key>
					<string>app.update.auto</string>
					<key>pfm_title</key>
					<string>app.update.auto</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If true, bookmarks are exported on shutdown.</string>
					<key>pfm_name</key>
					<string>browser.bookmarks.autoExportHTML</string>
					<key>pfm_title</key>
					<string>browser.bookmarks.autoExportHTML</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_description</key>
					<string> If set, the name of the file where bookmarks are exported and imported.</string>
					<key>pfm_name</key>
					<string>browser.bookmarks.file</string>
					<key>pfm_title</key>
					<string>browser.bookmarks.file</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If true, bookmarks are restored to their defaults.</string>
					<key>pfm_name</key>
					<string>browser.bookmarks.restore_default_bookmarks</string>
					<key>pfm_title</key>
					<string>browser.bookmarks.restore_default_bookmarks</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, don't store cache on the hard drive.</string>
					<key>pfm_name</key>
					<string>browser.cache.disk.enable</string>
					<key>pfm_title</key>
					<string>browser.cache.disk.enable</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<string>Profile temporary directory</string>
					<key>pfm_description</key>
					<string>If set, changes the location of the disk cache.</string>
					<key>pfm_name</key>
					<string>browser.cache.disk.parent_directory</string>
					<key>pfm_note</key>
					<string>Firefox policy documentation indicates this policy doesn't work, but is being worked on.</string>
					<key>pfm_title</key>
					<string>browser.cache.disk.parent_directory</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If true, single words are sent to DNS, not directly to search.</string>
					<key>pfm_name</key>
					<string>browser.fixup.dns_first_for_single_words</string>
					<key>pfm_title</key>
					<string>browser.fixup.dns_first_for_single_words</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>72</string>
					<key>pfm_description</key>
					<string>If set, a list of URLs to use as the default top sites on the new tab page.</string>
					<key>pfm_name</key>
					<string>browser.newtabpage.activity-stream.default.sites</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_title</key>
							<string>Sites</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>browser.newtabpage.activity-stream.default.sites</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_description</key>
					<string>If true, bookmarks are always imported on startup.</string>
					<key>pfm_name</key>
					<string>browser.places.importBookmarksHTML</string>
					<key>pfm_title</key>
					<string>browser.places.importBookmarksHTML</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, malware protection is not enabled (Not recommended)</string>
					<key>pfm_name</key>
					<string>browser.safebrowsing.malware.enabled</string>
					<key>pfm_title</key>
					<string>browser.safebrowsing.malware.enabled</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, phishing protection is not enabled (Not recommended)</string>
					<key>pfm_name</key>
					<string>browser.safebrowsing.phishing.enabled</string>
					<key>pfm_title</key>
					<string>browser.safebrowsing.phishing.enabled</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, updates for search engines are not checked.</string>
					<key>pfm_name</key>
					<string>browser.search.update</string>
					<key>pfm_title</key>
					<string>browser.search.update</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string> If true, a notification isn't shown if startup is slow.</string>
					<key>pfm_name</key>
					<string>browser.slowStartup.notificationDisabled</string>
					<key>pfm_title</key>
					<string>browser.slowStartup.notificationDisabled</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, there is no warning when the browser is closed.</string>
					<key>pfm_name</key>
					<string>browser.tabs.warnOnClose</string>
					<key>pfm_title</key>
					<string>browser.tabs.warnOnClose</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If true, tab previews are shown in the Windows taskbar.</string>
					<key>pfm_name</key>
					<string>browser.taskbar.previews.enable</string>
					<key>pfm_title</key>
					<string>browser.taskbar.previews.enable</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, bookmarks aren't suggested when typing in the URL bar.</string>
					<key>pfm_name</key>
					<string>browser.urlbar.suggest.bookmark</string>
					<key>pfm_title</key>
					<string>browser.urlbar.suggest.bookmark</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, history isn't suggested when typing in the URL bar.</string>
					<key>pfm_name</key>
					<string>browser.urlbar.suggest.history</string>
					<key>pfm_title</key>
					<string>browser.urlbar.suggest.history</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, open tabs aren't suggested when typing in the URL bar.</string>
					<key>pfm_name</key>
					<string>browser.urlbar.suggest.openpage</string>
					<key>pfm_title</key>
					<string>browser.urlbar.suggest.openpage</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If true, don't show the privacy policy tab on first run.</string>
					<key>pfm_name</key>
					<string>datareporting.policy.dataSubmissionPolicyBypassNotification</string>
					<key>pfm_title</key>
					<string>datareporting.policy.dataSubmissionPolicyBypassNotification</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, web page can close windows.</string>
					<key>pfm_name</key>
					<string>dom.allow_scripts_to_close_windows</string>
					<key>pfm_title</key>
					<string>dom.allow_scripts_to_close_windows</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, web pages can focus and activate windows.</string>
					<key>pfm_name</key>
					<string>dom.disable_window_flip</string>
					<key>pfm_title</key>
					<string>dom.disable_window_flip</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If true, web pages can't move or resize windows.</string>
					<key>pfm_name</key>
					<string>dom.disable_window_move_resize</string>
					<key>pfm_title</key>
					<string>dom.disable_window_move_resize</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, web pages can't override context menus.</string>
					<key>pfm_name</key>
					<string>dom.event.contextmenu.enabled</string>
					<key>pfm_title</key>
					<string>dom.event.contextmenu.enabled</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<string></string>
					<key>pfm_description</key>
					<string>See https://support.mozilla.org/en-US/kb/dom-events-changes-introduced-firefox-66</string>
					<key>pfm_name</key>
					<string>dom.keyboardevent.keypress.hack.dispatch_non_printable_keys.addl</string>
					<key>pfm_title</key>
					<string>dom.keyboardevent.keypress.hack.dispatch_non_printable_keys.addl</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<string></string>
					<key>pfm_description</key>
					<string>See https://support.mozilla.org/en-US/kb/dom-events-changes-introduced-firefox-66</string>
					<key>pfm_name</key>
					<string>dom.keyboardevent.keypress.hack.use_legacy_keycode_and_charcode.addl</string>
					<key>pfm_title</key>
					<string>dom.keyboardevent.keypress.hack.use_legacy_keycode_and_charcode.addl</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, the extensions blocklist is not used (Not recommended)</string>
					<key>pfm_name</key>
					<string>extensions.blocklist.enabled</string>
					<key>pfm_title</key>
					<string>extensions.blocklist.enabled</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If false, the Recommendations tab is not displayed in the Add-ons Manager.</string>
					<key>pfm_name</key>
					<string>extensions.getAddons.showPane</string>
					<key>pfm_title</key>
					<string>extensions.getAddons.showPane</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>72</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, recommendations are not shown on the Extensions tab in the Add-ons Manager.</string>
					<key>pfm_name</key>
					<string>extensions.htmlaboutaddons.recommendations.enabled</string>
					<key>pfm_title</key>
					<string>extensions.htmlaboutaddons.recommendations.enabled</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, the geolocation API is disabled.</string>
					<key>pfm_name</key>
					<string>geo.enabled</string>
					<key>pfm_title</key>
					<string>geo.enabled</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_description</key>
					<string>If set, preferred language for web pages.</string>
					<key>pfm_name</key>
					<string>intl.accept_languages</string>
					<key>pfm_title</key>
					<string>intl.accept_languages</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>70</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, Encrypted Media Extensions are not enabled.</string>
					<key>pfm_name</key>
					<string>media.eme.enabled</string>
					<key>pfm_title</key>
					<string>media.eme.enabled</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, the OpenH264 plugin is not downloaded.</string>
					<key>pfm_name</key>
					<string>media.gmp-gmpopenh264.enabled</string>
					<key>pfm_title</key>
					<string>media.gmp-gmpopenh264.enabled</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, the Widevine plugin is not downloaded.</string>
					<key>pfm_name</key>
					<string>media.gmp-widevinecdm.enabled</string>
					<key>pfm_title</key>
					<string>media.gmp-widevinecdm.enabled</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>72</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, WebRTC is disabled</string>
					<key>pfm_name</key>
					<string>media.peerconnection.enabled</string>
					<key>pfm_title</key>
					<string>media.peerconnection.enabled</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If true, IPv6 DNS lokoups are disabled.</string>
					<key>pfm_name</key>
					<string>network.dns.disableIPv6</string>
					<key>pfm_title</key>
					<string>network.dns.disableIPv6</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If true, display the punycode version of internationalized domain names.</string>
					<key>pfm_name</key>
					<string>network.IDN_show_punycode</string>
					<key>pfm_title</key>
					<string>network.IDN_show_punycode</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, history is not enabled.</string>
					<key>pfm_name</key>
					<string>places.history.enabled</string>
					<key>pfm_title</key>
					<string>places.history.enabled</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<string>Ask Every Time</string>
					<key>pfm_description</key>
					<string>If set to "Select Automatically", Firefox automatically chooses the default personal certificate. Other possible option is "Ask Every Time".</string>
					<key>pfm_name</key>
					<string>security.default_personal_cert</string>
					<key>pfm_title</key>
					<string>security.default_personal_cert</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>68</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If false, SSL errors cannot be sent to Mozilla.</string>
					<key>pfm_name</key>
					<string>security.ssl.errorReporting.enabled</string>
					<key>pfm_title</key>
					<string>security.ssl.errorReporting.enabled</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Preferences</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>68.0.1</string>
			<key>pfm_description</key>
			<string>Adds a menuitem to the help menu for specifying support information.</string>
			<key>pfm_description_reference</key>
			<string>Adds a menuitem to the help menu for specifying support information.</string>
			<key>pfm_name</key>
			<string>SupportMenu</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>Title</string>
					<key>pfm_title</key>
					<string>Title</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>Support</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>URL</string>
					<key>pfm_title</key>
					<string>URL</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>https://example.com/support</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>AccessKey</string>
					<key>pfm_title</key>
					<string>AccessKey</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>S</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Support Menu</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_supervised</key>
	<false/>
	<key>pfm_target</key>
	<array>
		<string>User</string>
		<string>System</string>
	</array>
	<key>pfm_title</key>
	<string>Firefox</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_user_approved</key>
	<false/>
	<key>pfm_version</key>
	<integer>5</integer>
</dict>
</plist>
