<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>NoMADLogin-AD settings</string>
	<key>pfm_title</key>
	<string>NoMADLogin-AD</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_version</key>
	<integer>1</integer>
	<key>pfm_icon</key>
	<data></data>
	<key>pfm_domain</key>
	<string>menu.nomad.login.ad</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_app_url</key>
	<string>https://gitlab.com/orchardandgrove-oss/NoMADLogin-AD</string>
	<key>pfm_app_documentation_url</key>
	<string>https://gitlab.com/orchardandgrove-oss/NoMADLogin-AD/wikis/Configuration/preferences</string>
	<key>pfm_subkeys</key>
	<array>
		
		<!-- Default Payload Keys -->
		
		<dict>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>Configures NoMADLogin-AD settings</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>NoMAD</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>menu.nomad.login.ad</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<!-- Custom Payload Keys -->
		
		<dict>
			<key>pfm_name</key>
			<string>ADDomain</string>
			<key>pfm_description</key>
			<string>Defines the AD domain you’re working with</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_app_min</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>BackgroundImage</string>
			<key>pfm_description</key>
			<string>A full path to the background image to be used.</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_app_min</key>
			<string>1.1.0</string>
			<key>pfm_placeholder</key>
			<string>/path/to/imageFile</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>CreateAdminUser</string>
			<key>pfm_description</key>
			<string>Will place any local user created at login by NoMADLogin-AD in the local admin group</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>DemobilizeUsers</string>
			<key>pfm_description</key>
			<string>Will convert a previously cached mobile account from AD into a regular local user account on login</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>EnableFDE</string>
			<key>pfm_description</key>
			<string>On systems using the APFS filesystem, this key will enable FileVault encryption as the user is signing in for the first time.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>EnableFDERecoveryKey</string>
			<key>pfm_description</key>
			<string>Write the output of the fdesetup command to /var/db/.NoMADFDESetup</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_target</key>
							<string>EnableFDE</string>
							<key>pfm_contains_any</key>
							<array>
								<false/>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>LDAPOverSSL</string>
			<key>pfm_description</key>
			<string>Determines if NoMADLogin-AD uses LDAP over SSL.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_app_min</key>
			<string>1.0</string>
			<key>pfm_default</key>
			<false/>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>LoginLogo</string>
			<key>pfm_description</key>
			<string>A full path to the logo to be used. If set to NONE, no logo will be shown.</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_app_min</key>
			<string>1.1.0</string>
			<key>pfm_placeholder</key>
			<string>/path/to/imageFile</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>LoginScreen</string>
			<key>pfm_description</key>
			<string>Determines if NoMADLogin-AD uses LDAP over SSL.</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_app_min</key>
			<string>1.1.0</string>
			<key>pfm_default</key>
			<false/>
		</dict>
	</array>
</dict>
</plist>
