<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Energy Saver settings</string>
		<key>pfm_title</key>
		<string>Energy Saver</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.apple.MCX</string>
		<key>pfm_interaction</key>
		<string>combined</string>
		<key>pfm_targets</key>
		<array>
			<string>system</string>
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_subkeys</key>
		<array>
			
			<!-- Default Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures Energy Saver settings</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Energy Saver</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.MCX</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.MCX</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			
			<!-- Custom Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>PFC_SegmentedControl_0</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_segments</key>
				<dict>
					<key>Desktop</key>
					<array>
						<string>com.apple.EnergySaver.desktop.ACPower</string>
					</array>
					<key>Portable</key>
					<array>
						<string>PFC_SegmentedControl_Portable</string>
						<string>com.apple.EnergySaver.portable.BatteryPower</string>
						<string>com.apple.EnergySaver.portable.ACPower</string>
					</array>
					<key>Schedule</key>
					<array>
						<string></string>
					</array>
				</dict>
				<key>pfm_range_list_titles</key>
				<array>
					<string>Desktop</string>
					<string>Portable</string>
					<string>Schedule</string>
				</array>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			
			<!-- Energy Settings: Desktop -->
			
			<dict>
				<key>pfm_name</key>
				<string>com.apple.EnergySaver.desktop.ACPower</string>
				<key>pfm_title</key>
				<string>Desktop Energy Saver Settings</string>
				<key>pfm_description</key>
				<string>Managed settings for the desktop energy profile.</string>
				<key>pfm_type</key>
				<string>dictionary</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>Display Sleep Timer</string>
						<key>pfm_title</key>
						<string>Put the display(s) to sleep after:</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>integer</string>
						<key>pfm_range_list</key>
						<array>
							<integer>0</integer>
							<integer>1</integer>
							<integer>2</integer>
							<integer>3</integer>
							<integer>5</integer>
							<integer>10</integer>
							<integer>20</integer>
							<integer>30</integer>
							<integer>45</integer>
							<integer>60</integer>
							<integer>75</integer>
							<integer>90</integer>
							<integer>105</integer>
							<integer>120</integer>
						</array>
						<key>pfm_range_list_titles</key>
						<array>
							<string>Never</string>
							<string>1 Minute</string>
							<string>2 Minutes</string>
							<string>3 Minutes</string>
							<string>5 Minutes</string>
							<string>10 Minutes</string>
							<string>20 Minutes</string>
							<string>30 Minutes</string>
							<string>45 Minutes</string>
							<string>1 Hour</string>
							<string>1 Hour 15 Minutes</string>
							<string>1 Hour 30 Minutes</string>
							<string>1 Hour 45 Minutes</string>
							<string>2 Hours</string>
						</array>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>System Sleep Timer</string>
						<key>pfm_title</key>
						<string>Put the computer to sleep after:</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>integer</string>
						<key>pfm_range_list</key>
						<array>
							<integer>0</integer>
							<integer>1</integer>
							<integer>2</integer>
							<integer>3</integer>
							<integer>5</integer>
							<integer>10</integer>
							<integer>20</integer>
							<integer>30</integer>
							<integer>45</integer>
							<integer>60</integer>
							<integer>75</integer>
							<integer>90</integer>
							<integer>105</integer>
							<integer>120</integer>
						</array>
						<key>pfm_range_list_titles</key>
						<array>
							<string>Never</string>
							<string>1 Minute</string>
							<string>2 Minutes</string>
							<string>3 Minutes</string>
							<string>5 Minutes</string>
							<string>10 Minutes</string>
							<string>20 Minutes</string>
							<string>30 Minutes</string>
							<string>45 Minutes</string>
							<string>1 Hour</string>
							<string>1 Hour 15 Minutes</string>
							<string>1 Hour 30 Minutes</string>
							<string>1 Hour 45 Minutes</string>
							<string>2 Hours</string>
						</array>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>Disk Sleep Timer-boolean</string>
						<key>pfm_title</key>
						<string>Put the hard disk(s) to sleep whenever possible</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>boolean</string>
						<key>pfm_default</key>
						<true/>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>Wake On LAN</string>
						<key>pfm_title</key>
						<string>Wake for Ethernet network administrator access</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>integer</string>
						<key>pfm_type_input</key>
						<string>boolean</string>
						<key>pfm_default</key>
						<integer>1</integer>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>Sleep On Power Button</string>
						<key>pfm_title</key>
						<string>Allow power button to sleep the computer</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>integer</string>
						<key>pfm_type_input</key>
						<string>boolean</string>
						<key>pfm_default</key>
						<integer>1</integer>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>Automatic Restart On Power Loss</string>
						<key>pfm_title</key>
						<string>Start up automatically after a power failure</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>integer</string>
						<key>pfm_type_input</key>
						<string>boolean</string>
					</dict>
				</array>
			</dict>
			
			
			<!-- Energy Settings: Portable -->
			
			<dict>
				<key>pfm_name</key>
				<string>PFC_SegmentedControl_Portable</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_segments</key>
				<dict>
					<key>Battery</key>
					<array>
						<string>com.apple.EnergySaver.portable.BatteryPower</string>
					</array>
					<key>Power Adapter</key>
					<array>
						<string></string>
						<string>com.apple.EnergySaver.portable.ACPower</string>
					</array>
				</dict>
				<key>pfm_range_list_titles</key>
				<array>
					<string>Battery</string>
					<string>Power Adapter</string>
				</array>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			
			<!-- Energy Settings: Portable: Battery-->
			
			<dict>
				<key>pfm_name</key>
				<string>com.apple.EnergySaver.portable.BatteryPower</string>
				<key>pfm_title</key>
				<string>Portable Energy Saver Settings</string>
				<key>pfm_description</key>
				<string>Managed settings for the portable battery power energy profile</string>
				<key>pfm_type</key>
				<string>dictionary</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>Display Sleep Timer</string>
						<key>pfm_title</key>
						<string>Put the display(s) to sleep after:</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>integer</string>
						<key>pfm_range_list</key>
						<array>
							<integer>0</integer>
							<integer>1</integer>
							<integer>2</integer>
							<integer>3</integer>
							<integer>5</integer>
							<integer>10</integer>
							<integer>20</integer>
							<integer>30</integer>
							<integer>45</integer>
							<integer>60</integer>
							<integer>75</integer>
							<integer>90</integer>
							<integer>105</integer>
							<integer>120</integer>
						</array>
						<key>pfm_range_list_titles</key>
						<array>
							<string>Never</string>
							<string>1 Minute</string>
							<string>2 Minutes</string>
							<string>3 Minutes</string>
							<string>5 Minutes</string>
							<string>10 Minutes</string>
							<string>20 Minutes</string>
							<string>30 Minutes</string>
							<string>45 Minutes</string>
							<string>1 Hour</string>
							<string>1 Hour 15 Minutes</string>
							<string>1 Hour 30 Minutes</string>
							<string>1 Hour 45 Minutes</string>
							<string>2 Hours</string>
						</array>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>System Sleep Timer</string>
						<key>pfm_title</key>
						<string>Put the computer to sleep after:</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>integer</string>
						<key>pfm_range_list</key>
						<array>
							<integer>0</integer>
							<integer>1</integer>
							<integer>2</integer>
							<integer>3</integer>
							<integer>5</integer>
							<integer>10</integer>
							<integer>20</integer>
							<integer>30</integer>
							<integer>45</integer>
							<integer>60</integer>
							<integer>75</integer>
							<integer>90</integer>
							<integer>105</integer>
							<integer>120</integer>
						</array>
						<key>pfm_range_list_titles</key>
						<array>
							<string>Never</string>
							<string>1 Minute</string>
							<string>2 Minutes</string>
							<string>3 Minutes</string>
							<string>5 Minutes</string>
							<string>10 Minutes</string>
							<string>20 Minutes</string>
							<string>30 Minutes</string>
							<string>45 Minutes</string>
							<string>1 Hour</string>
							<string>1 Hour 15 Minutes</string>
							<string>1 Hour 30 Minutes</string>
							<string>1 Hour 45 Minutes</string>
							<string>2 Hours</string>
						</array>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>Disk Sleep Timer-boolean</string>
						<key>pfm_title</key>
						<string>Put the hard disk(s) to sleep whenever possible</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>boolean</string>
						<key>pfm_default</key>
						<true/>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>Wake On LAN</string>
						<key>pfm_title</key>
						<string>Wake for Ethernet network administrator access</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>integer</string>
						<key>pfm_type_input</key>
						<string>boolean</string>
						<key>pfm_default</key>
						<integer>1</integer>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>Automatic Restart On Power Loss</string>
						<key>pfm_title</key>
						<string>Start up automatically after a power failure</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>integer</string>
						<key>pfm_type_input</key>
						<string>boolean</string>
					</dict>
				</array>
			</dict>
			
			<!-- Energy Settings: Portable: Power Adapter-->
			
			<dict>
				<key>pfm_name</key>
				<string>com.apple.EnergySaver.portable.ACPower</string>
				<key>pfm_title</key>
				<string>Portable Energy Saver Settings</string>
				<key>pfm_description</key>
				<string>Managed settings for the portable AC power energy profile.</string>
				<key>pfm_type</key>
				<string>dictionary</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>Display Sleep Timer</string>
						<key>pfm_title</key>
						<string>Put the display(s) to sleep after:</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>integer</string>
						<key>pfm_range_list</key>
						<array>
							<integer>0</integer>
							<integer>1</integer>
							<integer>2</integer>
							<integer>3</integer>
							<integer>5</integer>
							<integer>10</integer>
							<integer>20</integer>
							<integer>30</integer>
							<integer>45</integer>
							<integer>60</integer>
							<integer>75</integer>
							<integer>90</integer>
							<integer>105</integer>
							<integer>120</integer>
						</array>
						<key>pfm_range_list_titles</key>
						<array>
							<string>Never</string>
							<string>1 Minute</string>
							<string>2 Minutes</string>
							<string>3 Minutes</string>
							<string>5 Minutes</string>
							<string>10 Minutes</string>
							<string>20 Minutes</string>
							<string>30 Minutes</string>
							<string>45 Minutes</string>
							<string>1 Hour</string>
							<string>1 Hour 15 Minutes</string>
							<string>1 Hour 30 Minutes</string>
							<string>1 Hour 45 Minutes</string>
							<string>2 Hours</string>
						</array>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>System Sleep Timer</string>
						<key>pfm_title</key>
						<string>Put the computer to sleep after:</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>integer</string>
						<key>pfm_range_list</key>
						<array>
							<integer>0</integer>
							<integer>1</integer>
							<integer>2</integer>
							<integer>3</integer>
							<integer>5</integer>
							<integer>10</integer>
							<integer>20</integer>
							<integer>30</integer>
							<integer>45</integer>
							<integer>60</integer>
							<integer>75</integer>
							<integer>90</integer>
							<integer>105</integer>
							<integer>120</integer>
						</array>
						<key>pfm_range_list_titles</key>
						<array>
							<string>Never</string>
							<string>1 Minute</string>
							<string>2 Minutes</string>
							<string>3 Minutes</string>
							<string>5 Minutes</string>
							<string>10 Minutes</string>
							<string>20 Minutes</string>
							<string>30 Minutes</string>
							<string>45 Minutes</string>
							<string>1 Hour</string>
							<string>1 Hour 15 Minutes</string>
							<string>1 Hour 30 Minutes</string>
							<string>1 Hour 45 Minutes</string>
							<string>2 Hours</string>
						</array>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>Disk Sleep Timer-boolean</string>
						<key>pfm_title</key>
						<string>Put the hard disk(s) to sleep whenever possible</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>boolean</string>
						<key>pfm_default</key>
						<true/>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>Wake On LAN</string>
						<key>pfm_title</key>
						<string>Wake for Ethernet network administrator access</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>integer</string>
						<key>pfm_type_input</key>
						<string>boolean</string>
						<key>pfm_default</key>
						<integer>1</integer>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>Automatic Restart On Power Loss</string>
						<key>pfm_title</key>
						<string>Start up automatically after a power failure</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>integer</string>
						<key>pfm_type_input</key>
						<string>boolean</string>
					</dict>
				</array>
			</dict>
			
			<!-- Energy Settings: Schedule -->
			
			
			<!--
				
				<dict>
				<key>pfm_name</key>
				<string>timeZone</string>
				<key>pfm_title</key>
				<string>Timezone</string>
				<key>pfm_description</key>
				<string>Name of timezone, as found in /usr/share/zoneinfo. Basically relinks /etc/localtime but does not show in UI</string>
				<key>pfm_type</key>
				<string>string</string>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>timeServer</string>
				<key>pfm_title</key>
				<string>NTP Servers</string>
				<key>pfm_description</key>
				<string>NTP Servers, separated by a comma. Appends to /etc/ntp.conf</string>
				<key>pfm_type</key>
				<string>string</string>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>EnableGuestAccount</string>
				<key>pfm_title</key>
				<string>Enable the Guest account</string>
				<key>pfm_description</key>
				<string>Enable the Guest account</string>
				<key>pfm_type</key>
				<string>boolean</string>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>DisableGuestAccount</string>
				<key>pfm_title</key>
				<string>Disable the Guest Account</string>
				<key>pfm_description</key>
				<string>Disable the Guest Account</string>
				<key>pfm_type</key>
				<string>boolean</string>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>DisableGuestSharedFolders</string>
				<key>pfm_title</key>
				<string>Disable Guest Shared Folders</string>
				<key>pfm_description</key>
				<string>Disable Guest Shared Folders</string>
				<key>pfm_type</key>
				<string>boolean</string>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>forceInternetSharingOff</string>
				<key>pfm_title</key>
				<string>Force Internet Sharing to Off</string>
				<key>pfm_description</key>
				<string>Force Internet Sharing to Off</string>
				<key>pfm_type</key>
				<string>boolean</string>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>DisableLocationServices</string>
				<key>pfm_title</key>
				<string>Force Disable Location Services</string>
				<key>pfm_description</key>
				<string>Force Disable Location Services</string>
				<key>pfm_type</key>
				<string>boolean</string>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>DestroyFVKeyOnStandby</string>
				<key>pfm_title</key>
				<string>Destroy FileVault key on standby</string>
				<key>pfm_description</key>
				<string>Destroy FileVault key on standby</string>
				<key>pfm_type</key>
				<string>boolean</string>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>SleepDisabled</string>
				<key>pfm_title</key>
				<string>Disable Sleep</string>
				<key>pfm_description</key>
				<string>Key needs verification</string>
				<key>pfm_type</key>
				<string>boolean</string>
				</dict>
				
				
            
				<dict>
				<key>pfm_name</key>
				<string>com.apple.EnergySaver.desktop.ACPower-ProfileNumber</string>
				<key>pfm_title</key>
				<string>Desktop Energy Saver Profile</string>
				<key>pfm_description</key>
				<string>Desktop Energy Saver Profile (-1 for none?)</string>
				<key>pfm_type</key>
				<string>integer</string>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>com.apple.EnergySaver.portable.ACPower-ProfileNumber</string>
				<key>pfm_title</key>
				<string>Portable AC Power Energy Saver Profile</string>
				<key>pfm_description</key>
				<string>Energy Saver Profile (-1 for none?)</string>
				<key>pfm_type</key>
				<string>integer</string>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>com.apple.EnergySaver.portable.BatteryPower-ProfileNumber</string>
				<key>pfm_title</key>
				<string>Portable on Battery Power Energy Saver Profile</string>
				<key>pfm_description</key>
				<string>Energy Saver Profile (-1 for none?)</string>
				<key>pfm_type</key>
				<string>integer</string>
				</dict>
				
				
				<dict>
				<key>pfm_name</key>
				<string>com.apple.EnergySaver.desktop.Schedule</string>
				<key>pfm_title</key>
				<string>Power Schedule</string>
				<key>pfm_description</key>
				<string>Use this key to manage scheduled power on and power off events</string>
				<key>pfm_type</key>
				<string>dict</string>
				<key>pfm_subkeys</key>
				<array>
				<dict>
				<key>pfm_name</key>
				<string>RepeatingPowerOn</string>
				<key>pfm_title</key>
				<string>Start up or wake time</string>
				<key>pfm_description</key>
				<string>Use this key to describe a repeating start up/wake time</string>
				<key>pfm_type</key>
				<string>dict</string>
				<key>pfm_subkeys</key>
				<array>
				<dict>
				<key>pfm_name</key>
				<string>eventtype</string>
				<key>pfm_title</key>
				<string>The action to take</string>
				<key>pfm_description</key>
				<string>The type of action to take at the scheduled time: wake, wakepoweron, sleep, shutdown or restart</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_range_list</key>
				<array>
				<string>wake</string>
				<string>wakepoweron</string>
				<string>sleep</string>
				<string>shutdown</string>
				<string>restart</string>
				</array>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>time</string>
				<key>pfm_title</key>
				<string>Time of day</string>
				<key>pfm_description</key>
				<string>The time of day to perform the action specified as minutes offset from 00:00 eg. for 3AM the integer would be 180</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>0</integer>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>weekdays</string>
				<key>pfm_title</key>
				<string>Days to execute</string>
				<key>pfm_description</key>
				<string>The days on which the scheduled event occurs. 1 = Mon, 2 = Tue, 4 = Wed, 8 = Thu, 16 = Fri ORed with each other</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>31</integer>
				</dict>
				</array>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>RepeatingPowerOff</string>
				<key>pfm_title</key>
				<string>Shut down, sleep or restart time</string>
				<key>pfm_description</key>
				<string>Use this key to describe a repeating shut down, sleep or restart</string>
				<key>pfm_type</key>
				<string>dict</string>
				<key>pfm_subkeys</key>
				<array>
				<dict>
				<key>pfm_name</key>
				<string>eventtype</string>
				<key>pfm_title</key>
				<string>The action to take</string>
				<key>pfm_description</key>
				<string>The type of action to take at the scheduled time</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_range_list</key>
				<array>
				<string>wake</string>
				<string>wakepoweron</string>
				<string>sleep</string>
				<string>shutdown</string>
				<string>restart</string>
				</array>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>time</string>
				<key>pfm_title</key>
				<string>Time of day</string>
				<key>pfm_description</key>
				<string>The time of day to perform the action specified as minutes offset from 00:00 eg. for 3AM the integer would be 180</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>0</integer>
				</dict>
				<dict>
				<key>pfm_name</key>
				<string>weekdays</string>
				<key>pfm_title</key>
				<string>Days to execute</string>
				<key>pfm_description</key>
				<string>The days on which the scheduled event occurs. TODO: needs more format description</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>31</integer>
				</dict>
				</array>
				</dict>
				</array>
				</dict>
				-->
			</array>
		</dict>
	</plist>
