<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Developer: TextField Number settings</string>
		<key>pfm_title</key>
		<string>Developer: TextField Number</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.profilecreator.developer.TextFieldInteger</string>
		<key>pfm_interaction</key>
		<string>exclusive</string>
		<key>pfm_targets</key>
		<array>
			<string>user</string>
			<string>system</string>
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>iOS</string>
			<string>macOS</string>
			<string>tvOS</string>
		</array>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_subkeys</key>
		<array>
			
			<!-- Default Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures Developer: TextField Number settings</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Developer: TextField Number</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.profilecreator.developer.textfield</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.finder</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			
			<!-- Custom Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>TextFieldInteger01</string>
				<key>pfm_title</key>
				<string>TextFieldInteger 01: Standard Integer</string>
				<key>pfm_description</key>
				<string>TextField Integer.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_enable</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>TextFieldInteger02</string>
				<key>pfm_title</key>
				<string>TextFieldInteger 02: Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Long Title</string>
				<key>pfm_description</key>
				<string>TextField Integer with a long title.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_enable</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>TextFieldInteger03</string>
				<key>pfm_title</key>
				<string>TextFieldInteger 03: Long Description</string>
				<key>pfm_description</key>
				<string>TextFieldInteger with a long long long long long long long long long long long long long long long long long long long long long long long long long description.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_enable</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>TextFieldInteger04</string>
				<key>pfm_title</key>
				<string>TextFieldInteger 04: Placeholder Value</string>
				<key>pfm_description</key>
				<string>TextFieldInteger with a placeholder value.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_value_placeholder</key>
				<integer>99</integer>
				<key>pfm_enable</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>TextFieldInteger05</string>
				<key>pfm_title</key>
				<string>TextFieldInteger 05: Default Value</string>
				<key>pfm_description</key>
				<string>TextFieldInteger with a default value.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>99</integer>
				<key>pfm_enable</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>TextFieldInteger06</string>
				<key>pfm_description</key>
				<string>TextFieldInteger with no title.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_enable</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>TextFieldInteger07</string>
				<key>pfm_title</key>
				<string></string>
				<key>pfm_description</key>
				<string>TextFieldInteger with an empty title.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_enable</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>TextFieldInteger08</string>
				<key>pfm_title</key>
				<string>TextFieldInteger 08: No Description</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_enable</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>TextFieldInteger09</string>
				<key>pfm_title</key>
				<string>TextFieldInteger 09: Empty Description</string>
				<key>pfm_description</key>
				<string></string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_enable</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>TextFieldInteger10</string>
				<key>pfm_title</key>
				<string>TextFieldInteger 10: Max Value</string>
				<key>pfm_description</key>
				<string>TextFieldInteger with a max value of: 99</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_value_max</key>
				<integer>99</integer>
				<key>pfm_default</key>
				<integer>98</integer>
				<key>pfm_enable</key>
				<true/>
			</dict>
		</array>
	</dict>
</plist>
