<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>"New to Mac" notification settings</string>
	<key>pfm_domain</key>
	<string>com.apple.touristd</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2019-03-16T15:55:03Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>"New to Mac" notification settings</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>New to Mac</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.touristd</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.touristd</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>macOS</string>
				<string>Mac</string>
				<string>Seeds</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>macOS</key>
				<array>
					<string>seed-https://help.apple.com/osx/mac/10.12/new-to-mac</string>
					<string>seed-https://help.apple.com/macOS/high-sierra/mac-basics</string>
					<string>seed-https://help.apple.com/macOS/mojave/mac-basics</string>
					<string>seed-https://help.apple.com/osx/mac/10.12/whats-new</string>
					<string>seed-https://help.apple.com/macOS/high-sierra/whats-new</string>
					<string>seed-https://help.apple.com/macOS/mojave/whats-new</string>
				</array>
				<key>Mac</key>
				<array>
					<string>seed-https://help.apple.com/osx/mac/10.12/imac-21a</string>
					<string>seed-https://help.apple.com/osx/mac/10.12/imac-21b</string>
					<string>seed-https://help.apple.com/osx/mac/10.12/imac-21r</string>
					<string>seed-https://help.apple.com/osx/mac/10.12/imac-27</string>
					<string>seed-https://help.apple.com/osx/mac/10.12/macbook</string>
					<string>seed-https://help.apple.com/osx/mac/10.12/macbook-pro-13</string>
					<string>seed-https://help.apple.com/osx/mac/10.12/macbook-pro-15</string>
					<string>seed-https://help.apple.com/macOS/mojave/mac-mini</string>
				</array>
				<key>Seeds</key>
				<array>
					<string>seed-viewed-+trJt2VsTvK1yfPGwOySDw</string>
					<string>seed-viewed-/+vP78HsSh+Yeb4xJnUT9A</string>
					<string>seed-viewed-2+LvxAVyT6qnV1sDMZT0NA</string>
					<string>seed-viewed-40reAuuYTHOsx4oGcx4qrA</string>
					<string>seed-viewed-APhNaYV1RxSS41lC7ZJJ9Q</string>
					<string>seed-viewed-B70mVuHeT0WUgKh/VdUuZQ</string>
					<string>seed-viewed-ETJeJ9/1QmmWUde7uK8fDg</string>
					<string>seed-viewed-EWfaSdJwR/6f1BYGiyLpcQ</string>
					<string>seed-viewed-EeEFv8cyS0CVe3ia2UEehA</string>
					<string>seed-viewed-FQrkbNP9ThKQQtpqx2saFg</string>
					<string>seed-viewed-GZAJdmpdSqmfH2PkCr8ebw</string>
					<string>seed-viewed-JTecrrXDSVut2tSfltty9Q</string>
					<string>seed-viewed-KwUoo0fRRM2VPmIm0V67xg</string>
					<string>seed-viewed-LR2P9+rnQ2q9xSUy1ZgWOw</string>
					<string>seed-viewed-MM3ne3nTR9eXFyVwZ5gN7Q</string>
					<string>seed-viewed-Pa88nesPSO6POlutVN4/Sg</string>
					<string>seed-viewed-SdV08ZZQRxOCWq6JBEXmfg</string>
					<string>seed-viewed-Tu81gKhDTvmNkjyqcPBfKA</string>
					<string>seed-viewed-UhiR1M79RWmXLIQr4M0AWw</string>
					<string>seed-viewed-WEyaCPMVRB6HbnmRq9EnNQ</string>
					<string>seed-viewed-We59wh+OTa6c1yas/yppwg</string>
					<string>seed-viewed-b/dLke8ZTQaN9KKrxfwDQw</string>
					<string>seed-viewed-baXokbqsQ/2KLkzIZrR6ng</string>
					<string>seed-viewed-bydF6fX5Sp6aBYdEXD0VwQ</string>
					<string>seed-viewed-d+gfl8CNTNeauANKjf9WqA</string>
					<string>seed-viewed-f/Pn3F4RScOh+GUBKO9sRA</string>
					<string>seed-viewed-fWRpNw7IR3S3qxX63nmvMw</string>
					<string>seed-viewed-hP2OZh+MTEKeFcjgec2gZw</string>
					<string>seed-viewed-krdWS8DSQIqJSqQFXW1/pw</string>
					<string>seed-viewed-kti4ZkMKQFyCL2kbgCY23A</string>
					<string>seed-viewed-lEDfW5O+SZe8KTQ93HGOPA</string>
					<string>seed-viewed-lQlm1yrMS0GPVyAL44id+A</string>
					<string>seed-viewed-n87FVu1TSwGzble8vqBvsg</string>
					<string>seed-viewed-pDWyREoARJm5V1mJYr9GKg</string>
					<string>seed-viewed-srluh6uOQiuWCzxguqhDNw</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/osx/mac/10.12/imac-21a</string>
			<key>pfm_title</key>
			<string>macOS Sierra - iMac 21"a</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/osx/mac/10.12/imac-21b</string>
			<key>pfm_title</key>
			<string>macOS Sierra - iMac 21"b</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/osx/mac/10.12/imac-21r</string>
			<key>pfm_title</key>
			<string>macOS Sierra - iMac 21"r</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/osx/mac/10.12/imac-27</string>
			<key>pfm_title</key>
			<string>macOS Sierra - iMac 27"</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/osx/mac/10.12/macbook</string>
			<key>pfm_title</key>
			<string>macOS Sierra - MacBook</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/osx/mac/10.12/macbook-pro-13</string>
			<key>pfm_title</key>
			<string>macOS Sierra - MacBook Pro 13"</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/osx/mac/10.12/macbook-pro-15</string>
			<key>pfm_title</key>
			<string>macOS Sierra - MacBook Pro 15"</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/osx/mac/10.12/new-to-mac</string>
			<key>pfm_title</key>
			<string>macOS Sierra - New to Mac</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/macOS/high-sierra/mac-basics</string>
			<key>pfm_title</key>
			<string>macOS High Sierra - New to Mac</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.14</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/macOS/mojave/mac-basics</string>
			<key>pfm_title</key>
			<string>macOS Mojave - New to Mac</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/osx/mac/10.12/whats-new</string>
			<key>pfm_title</key>
			<string>macOS Sierra - What's New</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/macOS/high-sierra/whats-new</string>
			<key>pfm_title</key>
			<string>macOS High Sierra - What's New</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.14</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/macOS/mojave/whats-new</string>
			<key>pfm_title</key>
			<string>macOS Mojave - What's New</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_macos_min</key>
			<string>10.14</string>
			<key>pfm_name</key>
			<string>seed-https://help.apple.com/macOS/mojave/mac-mini</string>
			<key>pfm_title</key>
			<string>macOS Mojave - Mac Mini</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-+trJt2VsTvK1yfPGwOySDw</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-/+vP78HsSh+Yeb4xJnUT9A</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-2+LvxAVyT6qnV1sDMZT0NA</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-40reAuuYTHOsx4oGcx4qrA</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-APhNaYV1RxSS41lC7ZJJ9Q</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-B70mVuHeT0WUgKh/VdUuZQ</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-ETJeJ9/1QmmWUde7uK8fDg</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-EWfaSdJwR/6f1BYGiyLpcQ</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-EeEFv8cyS0CVe3ia2UEehA</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-FQrkbNP9ThKQQtpqx2saFg</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-GZAJdmpdSqmfH2PkCr8ebw</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-JTecrrXDSVut2tSfltty9Q</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-KwUoo0fRRM2VPmIm0V67xg</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-LR2P9+rnQ2q9xSUy1ZgWOw</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-MM3ne3nTR9eXFyVwZ5gN7Q</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-Pa88nesPSO6POlutVN4/Sg</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-SdV08ZZQRxOCWq6JBEXmfg</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-Tu81gKhDTvmNkjyqcPBfKA</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-UhiR1M79RWmXLIQr4M0AWw</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-WEyaCPMVRB6HbnmRq9EnNQ</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-We59wh+OTa6c1yas/yppwg</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-b/dLke8ZTQaN9KKrxfwDQw</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-baXokbqsQ/2KLkzIZrR6ng</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-bydF6fX5Sp6aBYdEXD0VwQ</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-d+gfl8CNTNeauANKjf9WqA</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-f/Pn3F4RScOh+GUBKO9sRA</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-fWRpNw7IR3S3qxX63nmvMw</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-hP2OZh+MTEKeFcjgec2gZw</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-krdWS8DSQIqJSqQFXW1/pw</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-kti4ZkMKQFyCL2kbgCY23A</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-lEDfW5O+SZe8KTQ93HGOPA</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-lQlm1yrMS0GPVyAL44id+A</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-n87FVu1TSwGzble8vqBvsg</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-pDWyREoARJm5V1mJYr9GKg</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
		<dict>
			<key>pfm_date_allow_past</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>seed-viewed-srluh6uOQiuWCzxguqhDNw</string>
			<key>pfm_type</key>
			<string>date</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>New to Mac</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
