<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>SystemUI Server settings</string>
	<key>pfm_domain</key>
	<string>com.apple.systemuiserver</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2018-07-18T08:58:48Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures SystemUI Server settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>SystemUI Server</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.systemuiserver</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.systemuiserver</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>	
		<dict>
			<key>pfm_description</key>
			<string>List of menu extras to combine with the user's menu bar</string>
			<key>pfm_name</key>
			<string>menuExtras</string>
			<key>pfm_title</key>
			<string>Menu Extras</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_value_unique</key>
			<true/>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>menuExtra</string>
					<key>pfm_title</key>
					<string>Menu Extra Path</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_range_list_allow_custom_value</key>
					<true/>
					<key>pfm_range_list</key>
					<array>
						<string>/System/Library/CoreServices/Menu Extras/AirPort.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Battery.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Bluetooth.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Clock.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Displays.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/DwellControl.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Eject.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/ExpressCard.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Ink.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/IrDA.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/PPP.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/PPPoE.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/SafeEjectGPUExtra.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Script</string>
						<string>/System/Library/CoreServices/Menu Extras/Menu.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/TextInput.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/TimeMachine.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/UniversalAccess.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/User.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/VPN.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Volume.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/WWAN.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/iChat.menu</string>
					</array>
				</dict>
			</array>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>SystemUI Server</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
