<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://apple.com/macos</string>
	<key>pfm_description</key>
	<string>Folder Redirection settings</string>
	<key>pfm_documentation_url</key>
	<string>https://github.com/jamf/Jamf-Nation-Managed-Preference-Manifests/blob/master/com.apple.MCXRedirector.manifest</string>
	<key>pfm_domain</key>
	<string>com.apple.MCXRedirector</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2018-07-18T08:58:48Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Folder Redirection configuration preferences</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Folder Redirection</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.MCXRedirector</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.MCXRedirector</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Redirect folders in the user's home during login.
- Use "deleteAndCreateSymLink" to delete an item at "Source Path" and then create a symbolic link to "Destination Path."
- Use "renameAndCreateSymLink" to rename an item at "Source Path" and then create a symbolic link to "Destination Path."
- Use "deletePath" to delete an item at "Source Path."
- Use "deleteSymLinkAndRestore" to delete an symbolic link at "Source Path" and move a folder created by "renameAndCreateSymLink" to "Source Path."</string>
			<key>pfm_name</key>
			<string>LoginRedirection</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>action</string>
							<key>pfm_range_list</key>
							<array>
								<string>deleteAndCreateSymLink</string>
								<string>renameAndCreateSymLink</string>
								<string>deletePath</string>
								<string>deleteSymLinkAndRestore</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The folder path to act upon, and is where to place a symbolic link. The path must be in the user's home. Start the path with "~/" or a non "/"-character.</string>
							<key>pfm_name</key>
							<string>path</string>
							<key>pfm_title</key>
							<string>Source Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Destination folder path for a symbolic link.  Use "~" to specify a path in the curent user's home. Use "%@" to specify the current user's name.</string>
							<key>pfm_name</key>
							<string>destPath</string>
							<key>pfm_title</key>
							<string>Destination Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Login Redirection</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Redirect folders in the user's home during logout.
- Use "deleteAndCreateSymLink" to delete an item at "Source Path" and then create a symbolic link to "Destination Path."
- Use "renameAndCreateSymLink" to rename an item at "Source Path" and then create a symbolic link to "Destination Path."
- Use "deletePath" to delete an item at "Source Path."
- Use "deleteSymLinkAndRestore" to delete an symbolic link at "Source Path" and move a folder created by "renameAndCreateSymLink" to "Source Path."</string>
			<key>pfm_name</key>
			<string>LogoutRedirection</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>action</string>
							<key>pfm_range_list</key>
							<array>
								<string>deleteAndCreateSymLink</string>
								<string>renameAndCreateSymLink</string>
								<string>deletePath</string>
								<string>deleteSymLinkAndRestore</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The folder path to act upon, and is where to place a symbolic link. The path must be in the user's home. Start the path with "~/" or a non "/"-character.</string>
							<key>pfm_name</key>
							<string>path</string>
							<key>pfm_title</key>
							<string>Source Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Destination folder path for a symbolic link. Use "~" to specify a path in the curent user's home. Use "%@" to specify the current user's name.</string>
							<key>pfm_name</key>
							<string>destPath</string>
							<key>pfm_title</key>
							<string>Destination Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Logout Redirection</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Folder Redirection</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
