<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Content Caching settings</string>
		<key>pfm_title</key>
		<string>Content Caching</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.apple.AssetCache.managed</string>
		<key>pfm_interaction</key>
		<string>exclusive</string>
		<key>pfm_targets</key> <!-- Added for ProfilePayloads -->
		<array>
			<string>system</string>
		</array>
		<key>pfm_platforms</key> <!-- Added for ProfilePayloads -->
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_macos_min</key>
		<string>10.13.4</string>
		<key>pfm_subkeys</key>
		<array>
			
			<!-- Default Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures Content Caching settings</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Content Caching</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.AssetCache.managed</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.AssetCache.managed</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			
			<!-- Custom Payload Keys -->
			<dict>
				<key>pfm_name</key>
				<string>AutoActivation</string>
				<key>pfm_title</key>
				<string>Automatically activate content caching</string>
				<key>pfm_description</key>
				<string>Users can’t turn off the content caching service.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<true/>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>AllowPersonalCaching</string>
				<key>pfm_title</key>
				<string>Caches the user’s iCloud data, such as photos and documents</string>
				<key>pfm_description</key>
				<string>Clients may take some time (hours, days) to react to changes to this setting; it does not have an immediate effect.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>AllowSharedCaching</string>
				<key>pfm_title</key>
				<string>Cache non-iCloud content, such as apps and software updates</string>
				<key>pfm_description</key>
				<string>Clients may take some time (hours, days) to react to changes to this setting; it does not have an immediate effect.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>CacheLimit</string>
				<key>pfm_title</key>
				<string>Maximum Cache Size</string>
				<key>pfm_description</key>
				<string>The maximum number of bytes of disk space that will be used for the content cache. The value of zero allows unlimited space.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>0</integer>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>Port</string>
				<key>pfm_title</key>
				<string>Port</string>
				<key>pfm_description</key>
				<string>TCP port on which the content caching service accepts requests for uploads or downloads. Set to 0 to pick a random port.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>0</integer>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>DataPath</string>
				<key>pfm_title</key>
				<string>Data Path</string>
				<key>pfm_description</key>
				<string>The path to the directory used to store cached content. Changing this setting manually does not automatically move cached content from the old to the new location. The path must be, or end with, /Library/Application Support/Apple/AssetCache/Data.</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_placeholder</key>
				<string>/Library/Application Support/Apple/AssetCache/Data</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>DenyTetheredCaching</string>
				<key>pfm_title</key>
				<string>Share Internet Connection</string>
				<key>pfm_description</key>
				<string>Share this computer's Internet connection and cached content with iOS devices connected using USB.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_value_inverted</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>LogClientIdentity</string>
				<key>pfm_title</key>
				<string>Log Client Details</string>
				<key>pfm_description</key>
				<string>Log the IP address and port number of clients that request content.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<false/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>Parents</string>
				<key>pfm_title</key>
				<string>Parents IP Addresses</string>
				<key>pfm_description</key>
				<string>A list of the local IP addresses of other content caches from which this cache should download or upload content instead of downloading from or uploading to Apple directly.</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>IPAddress</string>
						<key>pfm_title</key>
						<string>IP Address</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>string</string>
						<key>pfm_placeholder</key>
						<string>10.0.0.1</string>
					</dict>
				</array>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>Parents</string>
				<key>pfm_title</key>
				<string>Parent Selection Policy</string>
				<key>pfm_description</key>
				<string>The policy to use when choosing among more than one configured parent content cache.</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_range_list</key>
				<array>
					<string>first-available</string>
					<string>random</string>
					<string>round-robin</string>
					<string>sticky-available</string>
					<string>url-path-hash</string>
				</array>
				<key>pfm_range_list_titles</key>
				<array>
					<string>First available</string>
					<string>Random</string>
					<string>Round robin</string>
					<string>Sticky available</string>
					<string>Hash</string>
				</array>
				<key>pfm_default</key>
				<string>round-robin</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>ListenRangesOnly</string>
				<key>pfm_title</key>
				<string>Restrict content to local network</string>
				<key>pfm_description</key>
				<string>Content cache should offer content only to clients on the same immediate local network. If this is turned off, you can add a range of IPv4 and IPv6 addresses and select whether to restrict clients to those specified ranges.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_value_inverted</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>ListenRanges</string>
				<key>pfm_title</key>
				<string>Client Listen Ranges</string>
				<key>pfm_description</key>
				<string>A range of IPv4 and IPv6 addresses to restrict clients to.</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>RangeDict</string>
						<key>pfm_title</key>
						<string>RangeDict</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>type</string>
								<key>pfm_title</key>
								<string>IP Address Type</string>
								<key>pfm_description</key>
								<string></string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_range_list</key>
								<array>
									<string>IPv4</string>
									<string>IPv6</string>
								</array>
								<key>pfm_default</key>
								<string>IPv4</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>first</string>
								<key>pfm_title</key>
								<string>Start IP Address</string>
								<key>pfm_description</key>
								<string></string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_placeholder</key>
								<string>10.0.0.0</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>last</string>
								<key>pfm_title</key>
								<string>End IP Address</string>
								<key>pfm_description</key>
								<string></string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_placeholder</key>
								<string>10.255.255.255</string>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
		</array>
	</dict>
</plist>
