<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Time Machine settings</string>
		<key>pfm_title</key>
		<string>Time Machine</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.apple.MCX.TimeMachine</string>
		<key>pfm_interaction</key>
		<string>combined</string>
		<key>pfm_targets</key>
		<array>
			<string>system</string>
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_subkeys</key>
		<array>
			
			<!-- Default Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures Time Machine settings</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Time Machine</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.MCX.TimeMachine</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.MCX.TimeMachine</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			
			<!-- Custom Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>BackupDestURL</string>
				<key>pfm_title</key>
				<string>Backup Destination</string>
				<key>pfm_description</key>
				<string>URL of the backup destination. (e.g., smb://server.example.com/backups/)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>BackupAllVolumes</string>
				<key>pfm_title</key>
				<string>Backup all volumes</string>
				<key>pfm_description</key>
				<string>Only startup volume is backed up by default.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<false/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>BackupSkipSys</string>
				<key>pfm_title</key>
				<string>Back up system files and folders</string>
				<key>pfm_description</key>
				<string>System files and folders are skipped by default.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<true/>
				<key>pfm_value_inverted</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>AutoBackup</string>
				<key>pfm_title</key>
				<string>Enable automatic backups</string>
				<key>pfm_description</key>
				<string>Automatically backup at regulard intervals.</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>MobileBackups</string>
				<key>pfm_title</key>
				<string>Enable local snapshots</string>
				<key>pfm_description</key>
				<string>Creates local backup snapshots if the backup destination is offline.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_macos_min</key>
				<string>10.8</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>BackupSizeMB</string>
				<key>pfm_title</key>
				<string>Backup size limit</string>
				<key>pfm_description</key>
				<string>Enter a limit in MB for the size of the backup. Set to 0 for unlimited.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>5000</integer>
				<key>pfm_value_unit</key>
				<string>MB</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>SkipPaths</string>
				<key>pfm_title</key>
				<string>Paths to skip</string>
				<key>pfm_description</key>
				<string>Enter additional volumes and locations to exclude from the backup.</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>SkipPath</string>
						<key>pfm_title</key>
						<string>Path to skip from startup volume</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>string</string>
					</dict>
				</array>
			</dict>
			
			<!-- FIXME: Unverified. Not seen in documentation
			<dict>
			<key>pfm_description</key>
			<string>Unverified - BasePaths to back up</string>
			<key>pfm_name</key>
			<string>BasePaths</string>
			<key>pfm_title</key>
			<string>BasePaths</string>
			<key>pfm_type</key>
			<string>array</string>
			</dict>
			-->
		</array>
	</dict>
</plist>
