<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Single App Mode settings</string>
		<key>pfm_title</key>
		<string>Single App Mode</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.apple.app.lock</string>
		<key>pfm_interaction</key>
		<string>exclusive</string>
		<key>pfm_targets</key>
		<array>
			<string>system</string>
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>iOS</string>
			<string>tvOS</string>
		</array>
		<key>pfm_ios_min</key>
		<string>6.0</string>
		<key>pfm_supervised</key>
		<true/>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_subkeys</key>
		<array>
		
			<!-- Default Payload Keys -->
		
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures Single App Mode</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Single App Mode</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.app.lock</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.app.lock</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
		
			<!-- Default Payload Keys -->
		
			<dict>
				<key>pfm_name</key>
				<string>App</string>
				<key>pfm_title</key>
				<string>App</string>
				<key>pfm_description</key>
				<string>A dictionary containing information about the app</string>
				<key>pfm_type</key>
				<string>dictionary</string>
				<key>pfm_require</key>
				<string>always</string>
				<!-- FIXME - Defaults in a dict should be handled better in the app and not included as default if the key is not selected. Excluding for now.
				<key>pfm_default</key>
				<dict>
					<key>Options</key>
					<dict>
						<key>DisableTouch</key>
						<false/>
						<key>DisableDeviceRotation</key>
						<false/>
						<key>DisableVolumeButtons</key>
						<false/>
						<key>DisableRingerSwitch</key>
						<false/>
						<key>DisableSleepWakeButton</key>
						<false/>
						<key>DisableAutoLock</key>
						<false/>
						<key>EnableVoiceOver</key>
						<false/>
						<key>EnableZoom</key>
						<false/>
						<key>EnableInvertColors</key>
						<false/>
						<key>EnableAssistiveTouch</key>
						<false/>
						<key>EnableSpeakSelection</key>
						<false/>
						<key>EnableMonoAudio</key>
						<false/>
					</dict>
					<key>UserEnabledOptions</key>
					<dict>
						<key>VoiceOver</key>
						<false/>
						<key>Zoom</key>
						<false/>
						<key>InvertColors</key>
						<false/>
						<key>AssistiveTouch</key>
						<false/>
					</dict>
				</dict> -->
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>Identifier</string>
						<key>pfm_title</key>
						<string>Identifier</string>
						<key>pfm_description</key>
						<string>The bundle identifier of the application.</string>
						<key>pfm_type</key>
						<string>string</string>
						<key>pfm_require</key>
						<string>always</string>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>Options</string>
						<key>pfm_title</key>
						<string>Options</string>
						<key>pfm_description</key>
						<string>Settings enforced when in Single App Mode</string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_ios_min</key>
						<string>7.0</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>DisableTouch</string>
								<key>pfm_title</key>
								<string>Disable Touch</string>
								<key>pfm_description</key>
								<string>Disable Touch Screen</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
								<key>pfm_tvos_min</key>
								<string>10.2</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>DisableDeviceRotation</string>
								<key>pfm_title</key>
								<string>Disable Device Rotation</string>
								<key>pfm_description</key>
								<string>Disable Device Rotation</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
								<key>pfm_platforms</key>
								<array>
									<string>iOS</string>
								</array>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>DisableVolumeButtons</string>
								<key>pfm_title</key>
								<string>Disable Volume Buttons</string>
								<key>pfm_description</key>
								<string>Disable Volume Buttons</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
								<key>pfm_platforms</key>
								<array>
									<string>iOS</string>
								</array>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>DisableRingerSwitch</string>
								<key>pfm_title</key>
								<string>Disable Ringer Switch</string>
								<key>pfm_description</key>
								<string>Disable Ringer Switch</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
								<key>pfm_platforms</key>
								<array>
									<string>iOS</string>
								</array>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>DisableSleepWakeButton</string>
								<key>pfm_title</key>
								<string>Disable Sleep Wake Button</string>
								<key>pfm_description</key>
								<string>Disable Sleep Wake Button</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
								<key>pfm_platforms</key>
								<array>
									<string>iOS</string>
								</array>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>DisableAutoLock</string>
								<key>pfm_title</key>
								<string>Disable Auto Lock</string>
								<key>pfm_description</key>
								<string>Disable Auto Lock</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
								<key>pfm_tvos_min</key>
								<string>10.2</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>EnableVoiceOver</string>
								<key>pfm_title</key>
								<string>Enable Voice Over</string>
								<key>pfm_description</key>
								<string>Enable Voice Over</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
								<key>pfm_tvos_min</key>
								<string>10.2</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>EnableZoom</string>
								<key>pfm_title</key>
								<string>Enable Zoom</string>
								<key>pfm_description</key>
								<string>Enable Zoom</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
								<key>pfm_tvos_min</key>
								<string>10.2</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>EnableInvertColors</string>
								<key>pfm_title</key>
								<string>Enable Invert Colors</string>
								<key>pfm_description</key>
								<string>Enable Inverted Colors</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
								<key>pfm_tvos_min</key>
								<string>10.2</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>EnableAssistiveTouch</string>
								<key>pfm_title</key>
								<string>Enable Assistive Touch</string>
								<key>pfm_description</key>
								<string>Enable Assistive Touch</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
								<key>pfm_platforms</key>
								<array>
									<string>iOS</string>
								</array>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>EnableSpeakSelection</string>
								<key>pfm_title</key>
								<string>Enable Speak Selection</string>
								<key>pfm_description</key>
								<string>Enable Speak Selection</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
								<key>pfm_platforms</key>
								<array>
									<string>iOS</string>
								</array>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>EnableMonoAudio</string>
								<key>pfm_title</key>
								<string>Enable Mono Audio</string>
								<key>pfm_description</key>
								<string>Enable Mono Audio</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
								<key>pfm_platforms</key>
								<array>
									<string>iOS</string>
								</array>
							</dict>
						</array>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>UserEnabledOptions</string>
						<key>pfm_title</key>
						<string>User Enabled Options</string>
						<key>pfm_description</key>
						<string>Allow the user to change these settings when in Single App Mode</string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_ios_min</key>
						<string>7.0</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>VoiceOver</string>
								<key>pfm_title</key>
								<string>Voice Over</string>
								<key>pfm_description</key>
								<string>Allow user to enable Voice Over</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>Zoom</string>
								<key>pfm_title</key>
								<string>Zoom</string>
								<key>pfm_description</key>
								<string>Allow user to enable Zoom</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>InvertColors</string>
								<key>pfm_title</key>
								<string>Invert Colors</string>
								<key>pfm_description</key>
								<string>Allow user to enable Inverted Colors</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>AssistiveTouch</string>
								<key>pfm_title</key>
								<string>Assistive Touch</string>
								<key>pfm_description</key>
								<string>Allow user to enable Assistive Touch</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_default</key>
								<false/>
								<key>pfm_platforms</key>
								<array>
									<string>iOS</string>
								</array>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
		</array>
	</dict>
</plist>
