<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Global HTTP Proxy settings</string>
		<key>pfm_title</key>
		<string>Global HTTP Proxy</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.apple.proxy.http.global</string>
		<key>pfm_supervised</key>
		<true/>
		<key>pfm_interaction</key>
		<string>exclusive</string>
		<key>pfm_targets</key>
		<array>
			<string>system</string>
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>iOS</string>
			<string>tvOS</string>
		</array>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_subkeys</key>
		<array>
		
			<!-- Default Payload Keys -->
		
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures Global HTTP Proxy settings</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Global HTTP Proxy</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.proxy.http.global</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.proxy.http.global</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
		
			<!-- Custom Payload Keys -->
		
			<dict>
				<key>pfm_name</key>
				<string>ProxyType</string>
				<key>pfm_title</key>
				<string>Proxy Type</string>
				<key>pfm_description</key>
				<string>Use Manual for proxies that require authentication.</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Manual</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_range_list</key>
				<array>
					<string>Manual</string>
					<string>Auto</string>
				</array>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>ProxyServer</string>
				<key>pfm_title</key>
				<string>Proxy Server</string>
				<key>pfm_description</key>
				<string>The IP address or fully qualified domain name (FQDN) of the proxy server.</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_conditionals</key>
				<array>
					<dict>
						<key>pfm_require</key>
						<string>always</string>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_target</key>
								<string>ProxyType</string>
								<key>pfm_range_list</key>
								<array>
									<string>Manual</string>
								</array>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_target</key>
								<string>ProxyType</string>
								<key>pfm_n_range_list</key>
								<array>
									<string>Manual</string>
								</array>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>ProxyServerPort</string>
				<key>pfm_title</key>
				<string>Proxy Server Port</string>
				<key>pfm_description</key>
				<string>The port on which to connect to the proxy server.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_conditionals</key>
				<array>
					<dict>
						<key>pfm_require</key>
						<string>always</string>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_target</key>
								<string>ProxyType</string>
								<key>pfm_range_list</key>
								<array>
									<string>Manual</string>
								</array>
							</dict>
						</array>
					</dict>
				</array>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_target</key>
								<string>ProxyType</string>
								<key>pfm_n_range_list</key>
								<array>
									<string>Manual</string>
								</array>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>ProxyUsername</string>
				<key>pfm_title</key>
				<string>Proxy Username</string>
				<key>pfm_description</key>
				<string>The user name for the proxy server.</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_target</key>
								<string>ProxyType</string>
								<key>pfm_n_range_list</key>
								<array>
									<string>Manual</string>
								</array>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>ProxyPassword</string>
				<key>pfm_title</key>
				<string>Proxy Password</string>
				<key>pfm_description</key>
				<string>The authentication password for the proxy server.</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_target</key>
								<string>ProxyType</string>
								<key>pfm_n_range_list</key>
								<array>
									<string>Manual</string>
								</array>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>ProxyPACURL</string>
				<key>pfm_title</key>
				<string>Proxy PAC URL</string>
				<key>pfm_description</key>
				<string>The URL of the PAC file that defines the proxy configuration.</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_target</key>
								<string>ProxyType</string>
								<key>pfm_n_range_list</key>
								<array>
									<string>Auto</string>
								</array>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>ProxyPACFallbackAllowed</string>
				<key>pfm_title</key>
				<string>Proxy PAC Fallback Allowed</string>
				<key>pfm_description</key>
				<string>Proxy PAC Fallback Allowed</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_ios_min</key>
				<array>
					<string>7.0</string>
				</array>
				<key>pfm_exclude</key>
				<array>
					<dict>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_target</key>
								<string>ProxyType</string>
								<key>pfm_n_range_list</key>
								<array>
									<string>Auto</string>
								</array>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>ProxyCaptiveLoginAllowed</string>
				<key>pfm_title</key>
				<string>Proxy Bypass Allowed</string>
				<key>pfm_description</key>
				<string>Allow the device to bypass the proxy server to display the login page for captive networks.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_ios_min</key>
				<array>
					<string>7.0</string>
				</array>
			</dict>
		</array>
	</dict>
</plist>
