<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>AirPlay settings</string>
		<key>pfm_title</key>
		<string>AirPlay</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.apple.airplay</string>
		<key>pfm_interaction</key>
		<string>combined</string>
		<key>pfm_targets</key>
		<array>
			<string>user</string>
			<string>system</string>
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>iOS</string>
			<string>macOS</string>
		</array>
		<key>pfm_ios_min</key>
		<string>7.0</string>
		<key>pfm_macos_min</key>
		<string>10.10</string>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_subkeys</key>
		<array>
		
			<!-- Default Payload Keys -->
		
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures AirPlay settings</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>AirPlay settings</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.airplay</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.airplay</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
		
			<!-- Custom Payload Keys -->
		
			<dict>
				<key>pfm_name</key>
				<string>Whitelist</string>
				<key>pfm_title</key>
				<string>Whitelist</string>
				<key>pfm_description</key>
				<string>List of MAC addresses for visible AirPlay destinations restricted on this device. If this list is empty, the device can connect to any device.</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_supervised</key>
				<true/>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>WhitelistItem</string>
						<key>pfm_title</key>
						<string>Whitelist Content Item</string>
						<key>pfm_description</key>
						<string>An item in the whitelist</string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_require</key>
						<string>always</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>DeviceID</string>
								<key>pfm_title</key>
								<string>Device ID</string>
								<key>pfm_description</key>
								<string>The AirPlay destination&apos;s MAC address</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_require</key>
								<string>always</string>
								<key>pfm_format</key>
								<string>^([0-9A-Fa-f]{2}:){5}([0-9A-Fa-f]{2})$</string>
								<key>pfm_value_placeholder</key>
								<string>a4:2d:73:c1:b5:f1</string>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>Passwords</string>
				<key>pfm_title</key>
				<string>Passwords</string>
				<key>pfm_description</key>
				<string>Sets passwords for known AirPlay destinations</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>PasswordItem</string>
						<key>pfm_title</key>
						<string>Password Content Item</string>
						<key>pfm_description</key>
						<string>An item in the passwords</string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_require</key>
						<string>always</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>DeviceName</string>
								<key>pfm_title</key>
								<string>Device Name</string>
								<key>pfm_description</key>
								<string>The AirPlay destination&apos;s name</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_require</key>
								<string>always</string>
								<key>pfm_platforms</key>
								<array>
									<string>iOS</string>
								</array>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>DeviceID</string>
								<key>pfm_title</key>
								<string>Device ID</string>
								<key>pfm_description</key>
								<string>The AirPlay destination&apos;s MAC address</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_require</key>
								<string>always</string>
								<key>pfm_format</key>
								<string>^([0-9A-Fa-f]{2}:){5}([0-9A-Fa-f]{2})$</string>
								<key>pfm_platforms</key>
								<array>
									<string>macOS</string>
								</array>
								<key>pfm_value_placeholder</key>
								<string>a4:2d:73:c1:b5:f1</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>Password</string>
								<key>pfm_title</key>
								<string>Password</string>
								<key>pfm_description</key>
								<string>The password for the AirPlay destination</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_require</key>
								<string>always</string>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
		</array>
	</dict>
</plist>
