<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Firewall settings</string>
		<key>pfm_title</key>
		<string>Firewall</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.apple.security.firewall</string>
		<key>pfm_interaction</key>
		<string>combined</string> <!-- FIXME: Unknown -->
		<key>pfm_targets</key>
		<array>
			<string>system</string>
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_unique</key>
		<false/> <!-- FIXME: Unknown -->
		<key>pfm_macos_min</key>
		<string>10.12</string>
		<key>pfm_subkeys</key>
		<array>
			
			<!-- Default Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures Firewall settings</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Firewall</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.security.firewall</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.security.firewall</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			
			<!-- Custom Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>EnableFirewall</string>
				<key>pfm_title</key>
				<string>Enable Firewall</string>
				<key>pfm_description</key>
				<string>Enables the firewall on managed Mac computers.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>BlockAllIncoming</string>
				<key>pfm_title</key>
				<string>Block all incoming connections</string>
				<key>pfm_description</key>
				<string>Blocks all incoming connections except those required for basic Internet services, such as DHCP, Bonjour and IPSec.</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>EnableStealthMode</string>
				<key>pfm_title</key>
				<string>Enable Stealth Mode</string>
				<key>pfm_description</key>
				<string>Don't respond to or acknowledge attempts to access this computer from the network by test applications using ICMP, such as Ping.</string>
				<key>pfm_type</key>
				<string>boolean</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>Applications</string>
				<key>pfm_title</key>
				<string>Applications</string>
				<key>pfm_description</key>
				<string>Add applications to either allow or block them from connecting to your network and the Internet.</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>ApplicationItem</string>
						<key>pfm_title</key>
						<string>Application Item</string>
						<key>pfm_description</key>
						<string>A firewall application item</string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_require</key>
						<string>always</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>BundleID</string>
								<key>pfm_title</key>
								<string>Bundle ID</string>
								<key>pfm_description</key>
								<string>Identifies the application</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_require</key>
								<string>always</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>Name</string>
								<key>pfm_title</key>
								<string>Name</string>
								<key>pfm_description</key>
								<string>Name of application (Undocumented)</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_require</key>
								<string>always</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>Allowed</string>
								<key>pfm_title</key>
								<string>Allowed</string>
								<key>pfm_description</key>
								<string>Specifies whether or not incoming connections are allowed</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_require</key>
								<string>always</string>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
		</array>
	</dict>
</plist>
