<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Parental Controls: Dashboard settings</string>
		<key>pfm_title</key>
		<string>Parental Controls: Dashboard</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.apple.dashboard</string>
		<key>pfm_interaction</key>
		<string>exclusive</string> <!-- FIXME: Unknown -->
		<key>pfm_targets</key>
		<array>
			<string>system</string> <!-- FIXME: Unknown -->
			<string>user</string> <!-- FIXME: Unknown -->
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string> <!-- FIXME: Unknown -->
		</array>
		<key>pfm_unique</key>
		<true/> <!-- FIXME: Unknown -->
		<key>pfm_subkeys</key>
		<array>
		
			<!-- Default Payload Keys -->
		
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Parental Controls: Dashboard settings</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Parental Controls: Dashboard</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.dashboard</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.configurationprofile.identification</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
		
			<!-- Custom Payload Keys -->
		
			<dict>
				<key>pfm_name</key>
				<string>whiteListEnabled</string>
				<key>pfm_title</key>
				<string>Enable dashboard widget whitelist</string>
				<key>pfm_description</key>
				<string>Set to true to enable the widget white list items.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>whiteList</string>
				<key>pfm_title</key>
				<string>Dashboard widget whitelist</string>
				<key>pfm_description</key>
				<string>List that defines Dashboard widgets.</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>Type</string>
						<key>pfm_title</key>
						<string>Entry Type</string>
						<key>pfm_description</key>
						<string>Set to "bundleID" to use a widget’s bundle ID as its ID.</string>
						<key>pfm_type</key>
						<string>string</string>
						<key>pfm_require</key>
						<string>always</string>
						<key>pfm_default</key>
						<string>bundleID</string>
					</dict>
					<dict>
						<key>pfm_name</key>
						<string>ID</string>
						<key>pfm_title</key>
						<string>Bundle ID</string>
						<key>pfm_description</key>
						<string>The bundle ID of a widget.</string>
						<key>pfm_type</key>
						<string>string</string>
						<key>pfm_require</key>
						<string>always</string>
					</dict>
				</array>
			</dict>
		</array>
	</dict>
</plist>
