<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Exchange Web Services settings</string>
		<key>pfm_title</key>
		<string>Exchange (EWS)</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.apple.ews.account</string>
		<key>pfm_interaction</key>
		<string>combined</string>
		<key>pfm_targets</key>
		<array>
			<string>user</string>
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_unique</key>
		<false/>
		<key>pfm_subkeys</key>
		<array>
		
			<!-- Default Payload Keys -->
		
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures an Exchange account</string>
			</dict>
		
			<!-- This is a special case where PayloadDisplayName is used as the Account name in the payload -->
		
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Account name</string>
				<key>pfm_description</key>
				<string>The display name for the account.</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_enabled</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.ews.account</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.eas.account</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
		
			<!-- Custom Payload Keys -->
		
			<dict>
				<key>pfm_name</key>
				<string>UserName</string>
				<key>pfm_title</key>
				<string>Account user name</string>
				<key>pfm_description</key>
				<string>The user name with the optional domain (e.g "user" or "domain\user").</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_require</key>
				<string>push</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>EmailAddress</string>
				<key>pfm_title</key>
				<string>Account email address</string>
				<key>pfm_description</key>
				<string>The email address for the account (e.g. &quot;john@company.com).</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>Password</string>
				<key>pfm_title</key>
				<string>Account password</string>
				<key>pfm_description</key>
				<string>The password of the user account.</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_sensitive</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>Host</string>
				<key>pfm_title</key>
				<string>Internal Exchange Host</string>
				<key>pfm_description</key>
				<string>The IP address or fully qualified domain name (FQDN) of the internal Exchange host.</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>Port</string>
				<key>pfm_title</key>
				<string>Internal Exchange Host Port</string>
				<key>pfm_description</key>
				<string>The port on which to connect to the internal Exchange host.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_range_min</key>
				<integer>0</integer>
				<key>pfm_range_max</key>
				<integer>65535</integer>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>Path</string>
				<key>pfm_title</key>
				<string>Internal server path</string>
				<key>pfm_description</key>
				<string>The server path for the internal Exchange host.</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>SSL</string>
				<key>pfm_title</key>
				<string>Use SSL for Internal Exchange Host</string>
				<key>pfm_description</key>
				<string>Send all communication through Secure Socket Layer.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>ExternalHost</string>
				<key>pfm_title</key>
				<string>External Exchange Host</string>
				<key>pfm_description</key>
				<string>The IP address or fully qualified domain name (FQDN) of the external Exchange host.</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>ExternalPort</string>
				<key>pfm_title</key>
				<string>External Exchange Host Port</string>
				<key>pfm_description</key>
				<string>The port on which to connect to the external Exchange host.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_range_min</key>
				<integer>0</integer>
				<key>pfm_range_max</key>
				<integer>65535</integer>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>ExternalPath</string>
				<key>pfm_title</key>
				<string>External server path</string>
				<key>pfm_description</key>
				<string>The server path for the external Exchange host.</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>ExternalSSL</string>
				<key>pfm_title</key>
				<string>Use SSL for External Exchange Host</string>
				<key>pfm_description</key>
				<string>Send all communication through Secure Socket Layer.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<true/>
			</dict>
			<!-- FIXME: In profile manager both Allow Mail Drop, 
			and Enable per-message encryption switch are visible when creating a ews payload, 
			but nowhere in the documentation does it say that it supports it. So I have left that out for now. -->
		</array>
	</dict>
</plist>
