<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Setup Assistant settings</string>
		<key>pfm_title</key>
		<string>Setup Assistant</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.apple.SetupAssistant.managed</string>
		<key>pfm_interaction</key>
		<string>combined</string> <!-- FIXME: Unknown -->
		<key>pfm_targets</key>
		<array>
			<string>user</string>
			<string>system</string>
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_unique</key>
		<false/> <!-- FIXME: Unknown -->
		<key>pfm_subkeys</key>
		<array>
			
			<!-- Default Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Setup Assistant Payload</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Setup Assistant Payload</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.SetupAssistant.managed</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.SetupAssistant.managed</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			
			<!-- Custom Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>SkipCloudSetup</string>
				<key>pfm_title</key>
				<string>Skip iCloud</string>
				<key>pfm_description</key>
				<string>Skip iCloud Setup</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_macos_min</key>
				<string>10.12</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>SkipSiriSetup</string>
				<key>pfm_title</key>
				<string>Skip Siri</string>
				<key>pfm_description</key>
				<string>Skip Siri Setup</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_macos_min</key>
				<string>10.12</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>SkipTouchIDSetup</string>
				<key>pfm_title</key>
				<string>Skip TouchID</string>
				<key>pfm_description</key>
				<string>Skip TouchID Setup</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_macos_min</key>
				<string>10.12</string> <!-- FIXME: UNKNOWN not seen in documentation-->
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>SkipPrivacySetup</string>
				<key>pfm_title</key>
				<string>Skip Privacy consent window</string>
				<key>pfm_description</key>
				<string>Skip Privacy consent window</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_macos_min</key>
				<string>10.13.4</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>SkipiCloudStorageSetup</string>
				<key>pfm_title</key>
				<string>Skip iCloud Storage window</string>
				<key>pfm_description</key>
				<string>Skip iCloud Storage window</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_macos_min</key>
				<string>10.13.4</string>
			</dict>
		</array>
	</dict>
</plist>