<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Login Window: Scripts settings</string>
		<key>pfm_title</key>
		<string>Login Window: Scripts</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.apple.mcxloginscripts</string>
		<key>pfm_interaction</key>
		<string>combined</string>
		<key>pfm_targets</key>
		<array>
			<string>user</string>
			<string>system</string>
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_subkeys</key>
		<array>
			
			<!-- Default Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures Login Window: Scripts settings</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Login Window: Scripts</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.mcxloginscripts</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.mcxloginscripts</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			
			<!-- Custom Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>loginscripts</string>
				<key>pfm_title</key>
				<string>Login script</string>
				<key>pfm_description</key>
				<string>Select the script that runs when users log in.</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_range_min</key>
				<integer>1</integer>
				<key>pfm_range_max</key>
				<integer>1</integer>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>LoginScript</string>
						<key>pfm_title</key>
						<string>Login Script</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_require</key>
						<string>always</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>filedata</string>
								<key>pfm_title</key>
								<string>Script</string>
								<key>pfm_description</key>
								<string>Script to run a login.</string>
								<key>pfm_type</key>
								<string>data</string>
								<key>pfm_require</key>
								<string>always</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>filename</string>
								<key>pfm_title</key>
								<string>Name</string>
								<key>pfm_description</key>
								<string>Name of the script.</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_require</key>
								<string>always</string>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>skipLoginHook</string>
				<key>pfm_title</key>
				<string>Execute the Mac computer’s LoginHook script</string>
				<key>pfm_description</key>
				<string>Run any LoginHook script in addition to the Login script.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_value_inverted</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>logoutscripts</string>
				<key>pfm_title</key>
				<string>Logout script</string>
				<key>pfm_description</key>
				<string>Select the script that runs when users log out.</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_range_min</key>
				<integer>1</integer>
				<key>pfm_range_max</key>
				<integer>1</integer>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>LoginScript</string>
						<key>pfm_title</key>
						<string>Login Script</string>
						<key>pfm_description</key>
						<string></string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_require</key>
						<string>always</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>filedata</string>
								<key>pfm_title</key>
								<string>Script</string>
								<key>pfm_description</key>
								<string>Script to run a login.</string>
								<key>pfm_type</key>
								<string>data</string>
								<key>pfm_require</key>
								<string>always</string>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>filename</string>
								<key>pfm_title</key>
								<string>Name</string>
								<key>pfm_description</key>
								<string>Name of the script.</string>
								<key>pfm_type</key>
								<string>string</string>
								<key>pfm_require</key>
								<string>always</string>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>skipLogoutHook</string>
				<key>pfm_title</key>
				<string>Execute the Mac computer’s LogoutHook script</string>
				<key>pfm_description</key>
				<string>Run any LogoutHook script in addition to the Logout script.</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_value_inverted</key>
				<true/>
			</dict>
		</array>
	</dict>
</plist>
