<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Finder settings</string>
		<key>pfm_title</key>
		<string>Finder</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.apple.finder</string>
		<key>pfm_interaction</key>
		<string>combined</string>
		<key>pfm_targets</key>
		<array>
			<string>user</string>
			<string>system</string>
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_subkeys</key>
		<array>
			
			<!-- Default Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures Finder settings</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Finder</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.finder</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.finder</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			
			<!-- Custom Payload Keys -->
			
			<!-- Preferences -->
			<dict>
				<key>pfm_description</key>
				<string>Select if the standard (Full) or Simple Finder should be used</string>
				<key>pfm_name</key>
				<string>InterfaceLevel</string>
				<key>pfm_title</key>
				<string>Finder Interface Level</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Full</string>
				<key>pfm_range_list</key>
				<array>
					<string>Full</string>
					<string>Simple</string>
				</array>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Warning message requiring user approval before emptying the Trash</string>
				<key>pfm_name</key>
				<string>WarnOnEmptyTrash</string>
				<key>pfm_title</key>
				<string>Show warning before emptying the Trash</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<true/>
			</dict>
			
			<!-- Commands -->
			<dict>
				<key>pfm_description</key>
				<string>Opens a dialog box for finding servers on the network</string>
				<key>pfm_name</key>
				<string>ProhibitConnectTo</string>
				<key>pfm_title</key>
				<string>Allow Connect to Server</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_value_inverted</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Ejects removable media and mountable volumes</string>
				<key>pfm_name</key>
				<string>ProhibitEject</string>
				<key>pfm_title</key>
				<string>Allow Eject</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_value_inverted</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Writes permanent information to a CD or DVD. Disc burning restrictions require both Disc Burning and Finder payloads.</string>
				<key>pfm_name</key>
				<string>ProhibitBurn</string>
				<key>pfm_title</key>
				<string>Allow Burn Disc</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_targets</key>
				<array>
					<string>user</string>
					<string>user-managed</string>
					<string>system-managed</string>
				</array>
				<key>pfm_default</key>
				<false/>
				<key>pfm_value_inverted</key>
				<true/>
				<key>pfm_conditionals</key>
				<array>
					<dict>
						<key>pfm_require</key>
						<string>always</string>
						<key>pfm_target_conditions</key>
						<array>
							<dict>
								<key>pfm_domain</key>
								<string>com.apple.DiscRecording</string>
								<key>pfm_target</key>
								<string>BurnSupport</string>
								<key>pfm_contains_any</key>
								<array>
									<string>off</string>
									<string>authenticate</string>
								</array>
							</dict>
						</array>
					</dict>
				</array>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Allows user to open files or folders by typing a pathname</string>
				<key>pfm_name</key>
				<string>ProhibitGoToFolder</string>
				<key>pfm_title</key>
				<string>Allow Go to Folder</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<false/>
				<key>pfm_value_inverted</key>
				<true/>
			</dict>
			
			<!-- "Show these items on the desktop" -->
			<dict>
				<key>pfm_description</key>
				<string>Show hard disks on the desktop</string>
				<key>pfm_name</key>
				<string>ShowHardDrivesOnDesktop</string>
				<key>pfm_title</key>
				<string>Show Hard disks</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<false/>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Show external disks on the desktop</string>
				<key>pfm_name</key>
				<string>ShowExternalHardDrivesOnDesktop</string>
				<key>pfm_title</key>
				<string>Show External disks</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Show removable media on the desktop</string>
				<key>pfm_name</key>
				<string>ShowRemovableMediaOnDesktop</string>
				<key>pfm_title</key>
				<string>Show Removable media (CDs, DVDs, etc.)</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<true/>
			</dict>
			<dict>
				<key>pfm_description</key>
				<string>Show connected servers on the desktop</string>
				<key>pfm_name</key>
				<string>ShowMountedServersOnDesktop</string>
				<key>pfm_title</key>
				<string>Show Connected servers</string>
				<key>pfm_type</key>
				<string>boolean</string>
				<key>pfm_default</key>
				<false/>
			</dict>
		</array>
	</dict>
</plist>
