<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Identification settings</string>
		<key>pfm_title</key>
		<string>Identification</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>com.apple.configurationprofile.identification</string>
		<key>pfm_interaction</key>
		<string>exclusive</string>
		<key>pfm_targets</key>
		<array>
			<string>system</string>
			<string>user</string>
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_macos_min</key>
		<string>10.9</string>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_subkeys</key>
		<array>
			
			<!-- Default Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures Identification settings</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Identification</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.configurationprofile.identification</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.configurationprofile.identification</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			
			<!-- Custom Payload Keys -->
			
			<key>pfm_name</key>
			<string>PayloadIdentification</string>
			<key>pfm_title</key>
			<string>PayloadIdentification</string>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>FullName</string>
					<key>pfm_title</key>
					<string>Full Name</string>
					<key>pfm_description</key>
					<string>The full name of the designated accounts.</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_require</key>
					<string>push</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>EmailAddress</string>
					<key>pfm_title</key>
					<string>E-mail address</string>
					<key>pfm_description</key>
					<string>The address for the accounts.</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_require</key>
					<string>push</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>UserName</string>
					<key>pfm_title</key>
					<string>Username</string>
					<key>pfm_description</key>
					<string>The UNIX user name for the accounts.</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_require</key>
					<string>push</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>Password</string>
					<key>pfm_title</key>
					<string>Password</string>
					<key>pfm_description</key>
					<string>You can provide the password or choose to have the user provide it when he or she installs the profile.</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_sensitive</key>
					<true/>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_target</key>
									<string>AuthMethod</string>
									<key>pfm_range_list</key>
									<array>
										<string>UserEnteredPassword</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>AuthMethod</string>
					<key>pfm_title</key>
					<string>Authentication Method</string>
					<key>pfm_description</key>
					<string>Allow the user to enter the password upon installation instead of being supplied in the payload</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_default</key>
					<string>UserEnteredPassword</string>
					<key>pfm_range_list</key>
					<array>
						<string>Password</string>
						<string>UserEnteredPassword</string>
					</array>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_distribution</key>
									<array>
										<string>push</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>Prompt</string>
					<key>pfm_title</key>
					<string>Prompt</string>
					<key>pfm_description</key>
					<string>Short prompt text</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_distribution</key>
									<array>
										<string>push</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>PromptMessage</string>
					<key>pfm_title</key>
					<string>Prompt Message</string>
					<key>pfm_description</key>
					<string>Additional prompt description.</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_distribution</key>
									<array>
										<string>push</string>
									</array>
								</dict>
							</array>
						</dict>
					</array>
				</dict>
			</array>
		</array>
	</dict>
</plist>
