<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>pfm_description</key>
		<string>Loginwindow (Old) settings</string>
		<key>pfm_title</key>
		<string>Loginwindow (Old)</string>
		<key>pfm_format_version</key>
		<integer>1</integer>
		<key>pfm_version</key>
		<integer>1</integer>
		<key>pfm_domain</key>
		<string>loginwindow</string>
		<key>pfm_interaction</key>
		<string>combined</string>
		<key>pfm_targets</key>
		<array>
			<string>user</string>
		</array>
		<key>pfm_platforms</key>
		<array>
			<string>macOS</string>
		</array>
		<key>pfm_unique</key>
		<true/>
		<key>pfm_subkeys</key>
		<array>
			
			<!-- Default Payload Keys -->
			
			<dict>
				<key>pfm_name</key>
				<string>PayloadDescription</string>
				<key>pfm_title</key>
				<string>Payload Description</string>
				<key>pfm_description</key>
				<string>Description of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Configures Loginwindow settings</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadDisplayName</string>
				<key>pfm_title</key>
				<string>Payload Display Name</string>
				<key>pfm_description</key>
				<string>Name of the payload</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>Loginwindow</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadIdentifier</string>
				<key>pfm_title</key>
				<string>Payload Identifier</string>
				<key>pfm_description</key>
				<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>loginwindow</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadType</string>
				<key>pfm_title</key>
				<string>Payload Type</string>
				<key>pfm_description</key>
				<string>The type of the payload, a reverse dns string</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string>com.apple.loginitems.managed</string>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadUUID</string>
				<key>pfm_title</key>
				<string>Payload UUID</string>
				<key>pfm_description</key>
				<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
				<key>pfm_type</key>
				<string>string</string>
				<key>pfm_default</key>
				<string></string>
				<key>pfm_require</key>
				<string>always</string>
				<key>pfm_format</key>
				<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadVersion</string>
				<key>pfm_title</key>
				<string>Payload Version</string>
				<key>pfm_description</key>
				<string>The version of the whole configuration profile.</string>
				<key>pfm_type</key>
				<string>integer</string>
				<key>pfm_default</key>
				<integer>1</integer>
				<key>pfm_require</key>
				<string>always</string>
			</dict>
			<dict>
				<key>pfm_name</key>
				<string>PayloadOrganization</string>
				<key>pfm_title</key>
				<string>Payload Organization</string>
				<key>pfm_description</key>
				<string>This value describes the issuing organization of the profile, as displayed to the user</string>
				<key>pfm_type</key>
				<string>string</string>
			</dict>
			
			<!-- Custom Payload Keys -->
			
            <dict>
                <key>pfm_name</key>
                <string>DisableLoginItemsSuppression</string>
                <key>pfm_title</key>
                <string>Disable shift to suppress login items</string>
                <key>pfm_description</key>
                <string>Prevent users from disabling login items launching using the Shift key.</string>
                <key>pfm_type</key>
                <string>boolean</string>
            </dict>
			
			<dict>
				<key>pfm_name</key>
				<string>AutoLaunchedApplicationDictionary-managed</string>
				<key>pfm_title</key>
				<string>Launch network home share point at login</string>
				<key>pfm_description</key>
				<string>Automatically launch the users network home share point when logging in.</string>
				<key>pfm_type</key>
				<string>array</string>
				<key>pfm_range_min</key>
				<integer>1</integer>
				<key>pfm_range_max</key>
				<integer>1</integer>
				<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_name</key>
						<string>AutoLaunchedApplicationItem</string>
						<key>pfm_title</key>
						<string>Login Item</string>
						<key>pfm_description</key>
						<string>Automatically Launched Login Item</string>
						<key>pfm_type</key>
						<string>dictionary</string>
						<key>pfm_require</key>
						<string>always</string>
						<key>pfm_subkeys</key>
						<array>
							<dict>
								<key>pfm_name</key>
								<string>Hide</string>
								<key>pfm_title</key>
								<string>Hide</string>
								<key>pfm_description</key>
								<string>Hide application at launch.</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_require</key>
								<string>always</string>
								<key>pfm_default</key>
								<false/>
							</dict>
							<dict>
								<key>pfm_name</key>
								<string>AuthenticateAsLoginUserShortName</string>
								<key>pfm_title</key>
								<string>Authenticate with short name.</string>
								<key>pfm_description</key>
								<string>Authenticate to the URL with the current users short name. Required if URL is specified, but not for Path</string>
								<key>pfm_type</key>
								<string>boolean</string>
								<key>pfm_require</key>
								<string>always</string>
								<key>pfm_default</key>
								<true/>
							</dict>
                            <dict>
                                <key>pfm_name</key>
                                <string>MCX-NetworkHomeDirectoryItem</string>
                                <key>pfm_title</key>
                                <string>Mount network home</string>
                                <key>pfm_description</key>
                                <string>Mount network home.</string>
                                <key>pfm_type</key>
                                <string>boolean</string>
								<key>pfm_require</key>
								<string>always</string>
								<key>pfm_default</key>
								<true/>
                            </dict>
						</array>
					</dict>
				</array>
			</dict>
		</array>
	</dict>
</plist>
